let tet = `
明日はハレるよ（本編）

導入　省略



タイトル前、先がき。及び注意点。
キヴォトスの先生、または教育実習生の皆様。まずはこちらの本を手にとっていただき、ありがとうございます。
はじめに断っておきますと、私はブルーアーカイブが大好きです。特にストーリーが好きで、本作を執筆するに当たり、設定や世界観を可能な限り公式の設定した範囲から逸脱しないよう徹底しております。

しかしながら、甚だ遺憾なことに、本編で語られている情報と一部決定的な矛盾が生じてしまいました。何が起きたのか、ここで説明は控えますが、本編を読み勧めている間に「ん？」となる箇所があった場合はあとがきをご覧になってください。また、あらかじめ断っておきますが、キヴォトスの設定や世界観は奥が深く、理解しきれていない部分が多々あります。ですが、デカグラマトン特殊作戦を含め、読める限りのストーリーは読了済みです。（チヒロの絆ストーリーだけは読めていません。持っていないので）決してエアプではないので、それらをご了承の上、読んでほしいです。

では、先生！　キヴォトスのあったかもしれない世界線をぜひ、その目で観測してきてください！






あとがき

・さきがきで述べた致命的な矛盾について。
　ピボットくんの暗号で、キヴォトスで最も多くの情報を持つサーバーをハレが知っていた件について。本篇において、ハレ（キャンプ）の絆ストーリー参照後のモモトークで、その差出人が副部長であることが明かされている。
気づいた方はおめでとうございます。その差出人が副部長じゃないと`;//テンプレリテラルはバッククオートじゃなきゃダメ！　”　’じゃエラー！　SHIT+＠で｀は撃てるよ！
console.log(tet);
document.querySelector("noveltext").textContent = tet;
