let tet = `
明日はハレるよ（本編）

導入　省略



タイトル前、先がき。及び注意点。
キヴォトスの先生、または教育実習生の皆様。まずはこちらの本を手にとっていただき、ありがとうございます。
はじめに断っておきますと、私はブルーアーカイブが大好きです。特にストーリーが好きで、本作を執筆するに当たり、設定や世界観を可能な限り公式の設定した範囲から逸脱しないよう徹底しております。

しかしながら、甚だ遺憾なことに、本編で語られている情報と一部決定的な矛盾が生じてしまいました。何が起きたのか、ここで説明は控えますが、本編を読み勧めている間に「ん？」となる箇所があった場合はあとがきをご覧になってください。また、あらかじめ断っておきますが、キヴォトスの設定や世界観は奥が深く、理解しきれていない部分が多々あります。ですが、デカグラマトン特殊作戦を含め、読める限りのストーリーは読了済みです。（チヒロの絆ストーリーだけは読めていません。持っていないので）決してエアプではないので、それらをご了承の上、読んでほしいです。

では、先生！　キヴォトスのあったかもしれない世界線をぜひ、その目で観測してきてください！


第１節　トイ・トイ・トイ

カタカタカタカタ。
小さく規則的な音が耳に響く。それがキーボードを叩く音であることを一瞬忘れていた。
手を止めて目をこする。デスクの右側に置いてあったエナジードリンクを飲もうとして、中身が無くなっていることに気づいた。ふと伸びをして壁掛けの時計に目を向けると、すでに夜中の２時を超えている。健康的な人間ならもうとっくに眠っている時間だ。だが、ヴェリタスにそんな人間は一人もいない。
「あー！　拘束されちゃった！　やばい！　死んじゃう！　粉塵！　粉塵ちょうだーい！」
コントローラーを握りしめた小塗(こぬり)マキが悲鳴を上げる。プレイしているゲームで、ピンチに陥ったようだ。
「マキ。うるさいです。傍受の邪魔です」
「だってー！　…………あ。死んじゃった」
音(おと)瀬(せ)コタマの苦情の声を聞きながら、小鈎(おまがり)ハレは微笑んだ。
こんな時間でもヴェリタスは騒がしい。締め切られた空間。PCの排熱とクーラーの冷気がせめぎ合う密室に健康なんて概念はない。ハレはそんな空間を気に入っている。
「ハレ。作業はもう終わったのですか？」
「うん。一応、山場は超えたよ。後は軽い調整をするだけだから、ちょっと休憩」
超巨大学園都市、キヴォトスの中でも最大規模の生徒数を誇るミレニアムサイエンススクールの天才ハッカー集団、ヴェリタス。彼女達のもとには日々様々な依頼や案件が飛び込んでくる。特にAI・プログラミングに精通するハレには、毎日数えきれないほどの依頼メールが届く。その内容は簡単なものから難しいものまで様々だが、今受けているものはミレニアムと並ぶほどの巨大学園、ゲヘナ学園を牽引する生徒会『万魔(パンデモニウム・)殿(ソサエティ)』から依頼された完成まで数ヶ月を要する大規模な案件だ。その分、ハレの腕は存分に鳴っていた。
「ハレ先輩。ここ数日寝てないみたいだけど……大丈夫？」
手足を大きく投げ出したマキが、ハレに不安げな目を向ける。
「大丈夫。徹夜は慣れてるし、エナドリもまだ在庫が残ってるから」
ハレは入口横の共用冷蔵庫から、妖怪マックスの空けていない缶を３本取り出し、２本を脇に挟みながら、残った１本を器用に空けた。
コツコツ積み重ねてきた作業は終盤に入り、残り僅かなバグを修正すれば完成という段階まで来ている。締め切りまではまだ余裕があるが、一刻も早く完成品が見たいという欲望から、すでに３徹目に突入していた。
「ハレ。毎度思うのですが、いくらなんでも飲み過ぎではないですか。私が言うのもなんですが、健康に良くないですよ？」
「それはわかってるんだけどね……カフェインがないと、仕事に集中できないんだ」
コタマが苦言を呈しながら、ハレが作業していたデスクに目を向ける。その視線の先にはデスクいっぱいに並べられ、床にまで侵食した空き缶の群れがある。それらはすべて、ハレが飲んだ妖怪マックスの残骸だ。
「その作業が終わったら、しばらくカフェイン断ちをしてみたらどうですか？」
「うう……前に先生にも、同じことを言われてやったんだけどね。その時は３日も持たなかったよ……」
コタマの提案はもっともだと、ハレも理解している。だが、前に同じことをして、酷い目にあったことを思い出して顔をしかめた。これまでハレは二度、カフェイン断ちに挑戦したことがある。一度目はシャーレの先生に叱られて、半ば強制的に。二度目はヴェリタスの副部長である各務(かがみ)チヒロに強制的に連れられて、キャンプに行った際のことだ。どちらも先生がコーヒーを用意してくれていたことで事なきを得たものの、一時期は見知らぬ野草まで食べてしまうくらいの禁断症状に悩まされた。あんな思いをするのはもうこりごりである。
「まあ、今やってる作業が終わったら、こんなに飲むことはないと思う。心配してくれてありがとう、コタマ先輩」
「構いません。同じ部活の仲間なんだから、当然のことです」
コタマはあまり感情を出さない。今も平坦な声で感情の起伏が感じられない。だが、彼女が本気で自分のことを心配してくれている気持ちは伝わった。コタマの表情や口調は感情の起伏を感じ取りにくいが、その奥にはいつだって暖かさを秘めていることをハレは知っている。無論、コタマだけじゃない。マキやチヒロ、滅多に姿を見せない部長も一様に優しさを秘めている。そして、それはハレ自身も例外ではない。
「そろそろ、作業に戻ろうかな……」
会話の後、数分ほどストレッチをして、最後の作業に戻ろうかと思ったときだった。
突然、なんの前触れもなく、電気が消える。
「これは……停電？」
暗くなった部屋の中心で、ハレは首をかしげた。
ヴェリタスの部室にも、窓はある。そこから差し込む月明かりが部屋の中を照らしてくれるが、さっきまでモニターとにらみ合っていたハレの目は明度の落差に慣れていない。完全な暗闇に包まれていた。
とりあえず、光源を確保しないと。そう思ってポケットからスマホを取り出し、電源をつける。しかし、なぜかスマホもつかない。一瞬充電切れかと思ったが、作業中スマホは充電器に繋いでいた。充電切れなんてありえない。
おかしい。普通の停電なら、スマホが使えなくなるはずがない。それに、マキのゲーム機まで急に消えることもないはず。
ハレが状況のおかしさに気づき、コタマやマキに意見を求めようと口を開く。だがそれよりも早く続いた轟音で無理やり中断させられる。
「うわあ！？　な、なになになにー！？」
闇の中で、マキの叫び声が聞こえる。
「マキ！　ハレ！　無事ですか？」
「うん。私は大丈夫だよ」
聞こえたのはガシャンと何かが砕け散る音だった。
窓ガラスが……割れたのかな。
こんな状況でも、ハレは手に持っていたエナドリを一口含んで、状況の分析を続けた。徹夜による寝不足と疲れが、逆に冷静さを保たせてくれていた。
そして、その冷静な思考がハレの背筋を凍らせた。
「あ！　パソコンの電源！」
思わず、両手の力を緩めてしまう。
手に持っていた分と脇に挟んでいたアルミ缶の重さが消える。そのうちのひとつはまだ飲みかけだ。何も見えないが、床が大変なことになっている。しかし、今のハレは気にも止めていなかった。それより、データの状態が気になる。ハッカーたるもの、常に作業データのバックアップは欠かしていない。だが、急な停電でそれごとロストする可能性は低くない。そうなったら、徹夜の作業が水の泡だ。また、データが飛んだ場合、その被害状況も確認しなければならない。ハレのハッカーとしての性が、彼女を突き動かす。
「ひゃあ！？」
その途中で何かに引っかかり、転んでしまう。いや、ぶつかったという方が正しいか。部室の中央にドラム缶のような何かが転がっていて、ハレはそれに覆いかぶさっている。
「な、なに？」
ハレは困惑しながら自身が乗っかっているものをペタペタと触って確かめた。手のひらから硬いセラミック鋼の感触が伝わってくる。
「ハレ。どうかしましたか？」
「ハレ先輩！　大丈夫！？」
「うん。大丈夫だけど……気をつけて。部室の中央に、何か変なものがある」
コタマたちに気をつけるよう促している間も、ハレは手を動かしていた。ロボットは円形状のドラム缶のような形をしていて、高さはハレが両手を広げたくらいの大きさだ。
「あ。電気がついた」
なんでこんなところにドラム缶があるのか。不思議に思っていると、またなんの前触れもなく部室が光源を取り戻す。
それによって明らかになった物体の正体を見て、ハレは目を疑った。
「……この子は？」
ハレの足を引っ掛けたのは寸胴なロボットだった。円形のボディに短い手足、丸い頭に目と耳と口がついている。目はライトになっているようで、不規則に点滅していた。
「ピボピボ。ピボパボ。ピボボボボ」
口は閉ざされたままだが、その奥から微かな声が聞こえる。人の声と機械音声が入り混じったような声だった。若干、コタマの話し方に似ているかもしれないとハレは思った。
「ロボット？　なんでこんなところに？」
マキが疑問を口にする。
「わかりません。出所不明、出自不明。どうして我々の部室に来たのかもわかりません」
「もしかして、エンジニア部で作られたものかな？」
エンジニア部は白石(しらいし)ウタハが率いるハードウェアのスペシャリスト集団だ。名前の通りプログラミングやセキュリティなどのソフトウェアに特化したヴェリタスとは双璧を成す部活であり、時には合同でプロジェクトを行うこともある。ただ、エンジニア部が作るものは癖の強い物が多く、例えば設計した爆弾に過剰な火力を搭載したり、発明したロボットが暴走したりして施設を破壊することも少なくない。そのため、今回の騒ぎがエンジニア部の仕業である可能性は十分にあった。
「とりあえず、明日の放課後、エンジニア部に相談してみましょう。どっちにしろ、こういったハードウェア関連は彼女たちの領分ですから」
「そうだね。私もそれがいいと思う。……あ！　PC！」
電気も戻り、方針が決まって落ち着いたところで、ハレはデータの安否を確かめようとしていたことを思い出した。慌ててPCを起動して、先程まで書いていたプログラムのバックアップを確認する。
「よかった。バックアップは消えてない。停電のせいでサーバーがダウンしてるかと思ったけど、大丈夫だったみたい」
データが無事であることを確認して、ハレはほっと胸をなでおろした。
「それはよかったです。ですが、サーバーが無事ということは、私達の部室だけ停電が起きたのでしょうか」
「とりあえず、今日はもう帰って仮眠を取ろうかな……締め切りまで余裕があるし、流石にそろそろキツいかも」
「そうしてください。体を壊したら元も子もありませんから」
「先輩たちは今日は泊まり？」
「はい。さっきの停電、少し気になりますので調べてみたいので」
「あたしも、コタマ先輩のお手伝いしてこうかなー。ハッキングとかだったら、ホワイトハッカー集団としては黙ってられないし」
コタマとマキが鼻息荒く、やる気を示す。外的要因からのサイバー攻撃である可能性は、ハレもおぼろげながら考えていた。最後の作業を残して、帰って仮眠を取ろうと思ったのも、翌日自身の手で軽く調べようと思ったからだ。だが、こういったインフレ関係に関する調査はコタマの得意とする領域である。そこにマキの力も加わるのなら、大人しく任せてもいいと思えた。
「そっか。じゃあ、私は部屋に帰るね。何かわかったら、モモトークで教えてほしいな」
「はい。おやすみなさい。ハレ」
「ハレ先輩、おつかれ様―！」
さっそく自身のPCに電源を入れた２人に見送られ、ハレは部室を後にした。


翌日の放課後。
ハレ、コタマ、マキの３人はコタマの教室の前で集合し、エンジニア部の部室へと向かっていた。
「それにしても、昨日の停電は何だったんだろうね。なんか、あの停電が起きたのうちの部室だけだったみたいだし」
「はい。とても不可解です。外的要因から干渉を受けた記録はありませんでした。それに、このロボットに関する情報も何も得られませんでした」
コタマとマキが嘆く。今朝、ハレが仮眠から覚めるとコタマからモモトークが届いていた。それによると、一晩かけてあらゆるログやアクセスを解析してみたものの、それらしい痕跡は全く見つからなかったらしい。どんなハッカーだろうと、アクセスした痕跡を完全に消すのは不可能である。誰がやどのようにを欺くことはできても、やったことそのものすら感じさせないというのは、自分たちを相手に絶対にできないことをコタマはよくわかっている。となると、怪しいのは物理的なアクセスだ。すなわち、このロボットが関係している可能性が高いというのがコタマの見解とのことだった。
その意見にはハレも賛成である。ハレはコタマほど傍受に長けているわけではないが、何者かがアクセスしてきたのなら詳しい情報を取れるかは別として、アクセスを受けたこと自体には絶対に気づく。もし気づけないのだとしたら、ハッカーを名乗るのをやめてもいいレベルの失態だ。
「ピボピボ。ピボピボ。ピボピボボ」
件のロボットは、マキが押す荷台に乗せられ、相変わらず不規則な点滅と音を漏らしている。コタマはこのロボットについても調べたらしい。ただ、アクセス解析が終わった時点で、もう朝日が見えていて、ほとんど調べる時間がなかったらしい。結局、詳しい調査は早々に断念したようだ。
「本当はチヒロ先輩も来てくれたら良かったんだけど……確か、トリニティの依頼で出張してるんだよね？」
「はい。帰ってくるのは明日になるそうなので、今夜も同様の現象が起きたのなら、ヴェリタスの総力を上げて対処に当たろうと言っていました」
「そっか。じゃあ、私の作業は今日中に終わらせたほうがよさそうだね」
「かもしれませんね」
チヒロの伝言を聞いて、ハレはこの後の予定を頭の中で組み立てる。このまま帰って作業にを終え、新たな作業に向けて睡眠を取ったほうがいいかもしれない。だが、すでにエンジニア部の部室はすぐそこである。ここまで来たのだから、果たしてこのロボットが本当にエンジニア部の作成物なのか。そうでなかった場合、どこでどのように作られたのか。真理を解き明かしてから帰ることにした。
「こんにちは」
ノックの後、おもむろにドアを空け、挨拶を口にする。
エンジニア部の部室は工房と繋がっている。ウタハがその中心で作業をしている。他の部員の姿は見えなかった。
「やあ、誰かと思ったらヴェリタスのみんなじゃないか。どうしたんだい？　勢ぞろいで」
「こんにちは。ちょっと、急ぎで聞きたいことがあって。今日はコトリ達はいないの？」
「ああ。彼女たちなら今日は買い物に行くと言っていたよ。なんでも、ブラックマーケットに面白いパーツが入荷したとかでね。それより、急ぎで聞きたいことってなんだい？　ひょっとして、そのロボットに関係するのかな？」
ウタハの目はロボットに向いている。彼女はミレニアムでもメカオタクだ。未知のロボットを前に好奇心がうずいているのだろう。
「うん。話が早くて助かるよ。実は昨日──」
ハレはうなずくと、昨夜起きたヴェリタスの停電事件と、同時にそのロボットが窓を突き破って来たことについて、説明した。
「そうか。昨日の深夜にヴェリタスの部室でそんなことがあったんだね」
「それでこのロボットがエンジニア部で作られたもの何じゃないかとおもったんだけど……その様子だと、違うみたいだね」
訪ねようとしていた疑問を口にして、ハレは肩をすくめた。
「ああ。私達はこのようなロボットを作った覚えはない。それに、このロボットに使われている装甲は、私達が見たことのない材料で作られているね。すごいよ。これは未知の技術だ」
ハレが話し始めてすぐに、ウタハは我慢出来ないと言わんばかりにロボットに歩み寄り、手を伸ばした。それからずっと、ハレの話に時々相槌を打ちながらも、興味はロボットに向いている様子だ。とても自分たちで作った発明品にする反応には見えなかった。
「ハレ。このロボットだが、私達エンジニア部で、少し調べてみてもいいかな？」
視線はロボットに向けたまま、ウタハは早口で訪ねた。
「うん。お願いしていい？」
ハレはコタマたちと顔を合わせてから、うなずいた。元々、ここに来た目的はロボットの調査を頼むことだった。断る理由はない。
「もちろんだとも。ああ。このロボットだが、多少分解してみてもいいかな？　もちろん。返すときには元通りにすると約束する」
「いいけど……変な改造はしないでね？　また、部室を荒らされても困るから……」
エンジニア部は本人たちの気分次第で余計な改造を施すと評判だ。仮にミサイル発射機能でもつけられて、ヴェリタスの部室に発射されたら目も当てられない。
「ああ。心得た。では、調べ終わったらハレにモモトークで連絡すればいいかな？」
「うん。それでいいよ」
「それと、作業には日にちをもらうけど、構わないかな？」
「うん。それも大丈夫。こっちは別に急いでるわけじゃないから」
ハレは三度うなずいた。急ぎだったのはこのロボットがエンジニア部で作られたものかどうか確かめることだ。そうでないとわかった以上、むしろこのロボットがどこで作られたものか、なんのためにつくられたものか、じっくり調べてほしいというのがヴェリタスの総意である。
「じゃあ、後はよろしくね。ウタハ先輩」
かくして話がまとまると、ハレとヴェリタス一同は踵を返し、エンジニア部の部室を後にした。

数日後。
『やあ、ハレ。件のロボットについて報告したいことがあるから、都合のいいときに部室に来てくれるかな』
朝、自室でハレが目覚め、支度を終えたところにウタハからのメッセージが届いた。
『早いね。もう調べ終わったの？　それはみんなで行った方がいい？』
『それは任せるよ。別にハレ１人でも構わないよ』
『分かった。さっそく今日の放課後、エンジニア部の部室に行くね』
ウタハにそう告げて、スタンプを送る。その後、ハレはヴェリタスのトークグループに早速エンジニア部に顔を出すことを伝えた。
『もちろん、行きます』
『あたしもいく！』
ウタハとのトークを終えると、ハレはさっそく、ヴェリタスのトークグループにウタハから連絡が来た旨を告げると、全員一緒に行くとのことだった。ロボットに少なからず好奇心をうずかせていたのは、ハレだけじゃなかった。みんな、いつエンジニア部から連絡が来てもいいように、スケジュールに余裕を持たせていたのだ。
「おまたせ」
授業が終わると、以前と同じようにコタマの教室の前に集合した。メンバーは当然、ハレにコタマにマキ、そして今回は副部長のチヒロの姿もあった。
「みんな。なんだか悪いわね。大変なことがあったのにあんまり部室に顔出せなくて」
「しかたないよ。先輩は出張中だったんだし。しかも、昨日帰ってきたばかりなんでしょ？　休まなくても大丈夫なの？」
「大丈夫よ。今回の依頼はかなりスケジュールに余裕があったから、ちゃんと睡眠時間も確保できたし。それに、うちの部室がハッキングされたかもしれないのに、副部長として大人しくなんていられないし」
「まあ、まだハッキングって決まったわけじゃないけどね……」
「でも、あれからどれだけ調べても原因がわかってないんでしょ？　それに、スマホまで使えなくなったなんて、明らかに変だし。私はハッキングの線もあると思ってるけどな」
「それはそうだけど……でも、私達を相手に痕跡どころか存在すら匂わせず、電子回路系にアクセスするなんて芸当、できる人がいるのかな？」
「それはまあ、そうだけど」
ハレのもっともな指摘にチヒロは言葉を失う。
停電なのに、どうしてスマホやマキの携帯ゲーム機まで電源が落ちたのか。あの時、ハレが感じた疑問はすでに全員に共有済みである。だが、だからといって何か具体的なことがわかったわけでもない。事実、あれからずっと、マキハレコタマの３人は協力して原因究明に勤しんでいた。さらに、夜はいつハッキングされてもいいように数時間ごとに交代でサーバーの監視に当たっていた。だが、依然として停電の原因はわからず、また同様の現象が起きることもなかった。だから、ソフトウェア的な干渉はない。というのが最終的に３人が出した結論だ。
「だから、その原因をこれから確かめに行くのです。ちなみに私達の見立てでは、あのロボットから電子機器の制御を妨害する電波が発せられている説が有力です」
コタマは散々念を入れて出した結論を口にすると、ちらっとエンジニア部の部室がある方角に目を向けた。
「ねえねえ！　いつまでも話ばかりしてないで、早く行こ！　本当にあのロボットがあたしたちの部室に変なことしたなら、懲らしめてやらないと！」
憤慨したマキが待ちきれないと言わんばかりに駆けだす。
「ちょっと！　待ちなさい、マキ！　危ないから廊下は走っちゃダメ！　それに、まだ来てない人が──」
「わあ！？」
チヒロが慌てて手を伸ばすが、マキは聞く耳をもたず、廊下の角で誰かにぶつかって尻もちをついてしまう。
「もう！　こうなるから危ないって止めたのに……マキ！　大丈夫？」
真っ先に歩み寄ったチヒロが心配の声をかけた。
「いてて……あたしは大丈夫だけど、ぶつかった人が──」
「イタタ……お尻がズキズキする……」
「って、先生！？」
打ち付けた臀部をさすりながら顔を上げて、マキは目をいっぱいに見開いた。
「マキ。大丈夫？　怪我はない？」
マキより先に立ち上がった先生が、優しい声で心配しながら手を差し伸べる。
「あ、うん。大丈夫だけど……それより先生。どうしてここに？」
マキが驚いて疑問を口にする。
「私が呼んだのよ」
答えたのは先生本人ではなく、そばにいたチヒロだった。
「チヒロ先輩が？」
マキはあんぐりと口を開けて驚いた。
「昨日、トリニティでチヒロに会ってね。その時、ヴェリタスの部室で停電騒ぎがあったって聞いたから、気になって様子を見に来たんだ」
「そういうこと。で、ちょうど朝ハレから連絡が来たから、先生も誘ったの」
「そうなんだ……はー。まさかこんなところで先生に会えるなんて思わなかったから、びっくりしちゃったよ！」
マキは納得の相槌を打つと、続けて先生の顔を見上げて大きく息を吐いた。
シャーレの先生は、キヴォトスにおける行政ともいうべき連邦生徒会の顧問で、キヴォトスに存在する唯一の大人でもあり、あらゆる生徒から頼られる存在でもある。かくいうマキも警察に補導されたときに引き取り手になってもらったり、困り事があったときに解決を手伝ってもらったりしたことがある。しかし、本来の先生は同じように生徒の要望を叶えたり書類仕事だったり、何かと多忙で滅多に姿を見ることがない。そのため教室棟で偶然遭遇するとは思わず、大げさに驚いてしまった。
「ていうか、それなら先に教えてくれてればよかったのに！」
「ああ……それはごめんなさい。サプライズになるかなって思ったんだけど、思い違いだったわね」
「全くだよ！　予め教えてもらえてたら、あたしが先生にぶつかることもなかったのに！」
「いや、それとこれとは別でしょ……」
憤慨するマキに、チヒロは嘆息する。
「それよりマキ。あんた、先生にぶつかったままでしょ。ごめんなさいは？」
チヒロは気を取り直すようにメガネを人差し指でクイッとあげると、厳しい声でいった。
「あ。そうだったね……先生、ぶつかっちゃって、ごめんなさい。怪我はない？」
「大丈夫だよ。でも、廊下を走るのは危ないから、今度から気をつけようね」
「はーい」
先生はしおらしく肩をすくめるマキを優しく諭した。その姿はまさしく先生だった。
「じゃ、先生も来たところで行きましょうか。エンジニア部の部室に」
「はーい」
チヒロを先頭に、エンジニア部へ向かう一同。
数分ほど歩くと、オイルの匂いが漂ってくる。どうやら、今日はなにか作業中らしい。
「こんにちは」
チヒロがドアを空け、中にいた部員に向けて大声で挨拶をする。だが、それに反応するものはいない。中央に設けられた作業台。その上にロボットは寝かせられ、ウタハとコトリ、ヒビキが何やら真剣な顔つきで囲んでいた。
「やあ、ハレ。待っていたよ。おや、今日はチーちゃんも一緒か。それに、先生まで。一体どういう風の吹き回しかな？」
少し遅れて、ウタハが来訪者の存在に気づく。彼女は軽く手を挙げると、大股で近づいた。
「昨日、たまたま会って、ヴェリタスの様子を見に来てくれたのよ。それより、ウタハ部長。３人でロボットを囲んで何をしてるの？」
早速、チヒロがウタハに向けて問いかける。
その横を通り抜けたハレ達は、エンジニア部の２人と挨拶を交わしていた。その様子を尻目に、互いの部の長は会話を続ける。
「ああ。あれかい？　あのロボットに自動録画機能付きカメラを溶接しようと試みているところだよ」
「また変な改造を……また勝手にロボットが暴走したりはしないでしょうね？」
「それは晄(こう)輪(りん)大祭(たいさい)のときのことを言っているのかい？　それなら大丈夫だ。あのときのようにはならないよ。というより、出来ないと言ったほうが正しいかな……」
「出来ない？　それってどういう……」
「それに関しては口で説明するより、見せたほうが早いね」
ウタハがチヒロを作業台へと案内する。
「うう……ダメだ。溶接もドリルも効かない……接続器具も全部剥がれちゃう。なんだか、薄い透明な皮が次々脱皮しているみたい」
「うーん。これはどういうことでしょう。ここまでして傷ひとつ付けられないとなると、流石におかしいですね。触れようと思えば触れられるのに、こちらからの干渉を一切受け付けないだなんて、化学的にありえるのでしょうか？」
ヒビキとコトリがぶつぶつと何かを口にしながらしきりに手を動かしたり首をかしげたりしている。ふたりとも青い顔をしていることから、作業の進捗は芳しくないようだ。
「ウタハ、これってどういう状況？」
「見ての通りだよ。先生。我々はあのロボットに何か細工を施そうとしているんだが、どうにも上手くいかなくてね。なんて言えばいいのだろう。不思議なことに何をしようにも受付けないというか、何も干渉できないというか」
先生の問いかけに、ウタハは困ったような調子で両手をあげた。
それから、見たほうが早いと言わんばかりに顎をしゃくる。その先ではちょうど、ヒビキが両面テープを貼ろうとしていた。白いテープをちぎり、薄皮を剥がして押し付ける。その瞬間、全員が信じがたい光景を目の当たりにすることとなった。
「ああ！　また！」
──ポロッ。
ヒビキが小さな悲鳴をあげるとともに、ピタリと押しつけられていたテープが急に張力を失ったかのように剥がれてしまう。
「今のって…………」
「テープが勝手に剥がれた？」
先生とチヒロが驚きの言葉を漏らした。続いて、説明を求めるようにウタハの方に顔を向ける。
「見ての通りだ。今のはテープだったけど、ドリルで穴を開けようとしても、他の接続器具をつけようと試みても、このように無効化されてしまうんだ」
どうやら、ウタハ達エンジニア部は何度も見た光景のようだ。眉を潜め、顰め面で両手を上げる。その後、ウタハを除く全員がコトリとヒビキが試行錯誤している様を観察するが、そのどれもがやはり、ウタハの言った通り、無効化されてしまう。
「これは……確かに不思議だね」
「今、勝手にテープが剥がれたよね？」
「はい。私の目には確かにテープが貼り付いてるように見えました。それがひとりでに剥がれるなんて、怪奇現象です」
ハレやマキ、コタマのリアクションを聞きながら、チヒロは頭の中で何度も先程の光景をリプレイしていた。試しに触ってみても、ローションなどといった液体で防御しているようにも見えない。確かに不思議で化学的にありえない光景である。しかし、だからといって打つ手がないわけではない。
例えば、赤外線センサーによる透視や外殻に衝撃を与え、反響音で内部構造を調べるなど、アプローチの手段はまだあるはず。それとも、このロボットはそういったレーザー等の干渉も無効化するのだろうか。専門外のチヒロでさえ及ぶ思考に、エンジニア部がその程度至らないはずがない。
「ウタハ部長。伝えたかったことはこれだけ？　他に何かわかったことはないの？」
チヒロは眼光光らせ、ウタハに問いかけた。すると、ウタハは小さく鼻をならし、うなずいた。
「もちろん、まだあるよ。それをちょうど説明しようと思っていたのさ。チーちゃん。このロボットの下の部分を見てくれるかな？」
「下？」
チヒロを先頭に、全員で人間の股にあたる部分を覗き込む。そこは一見、何もない円柱の平らな底面だ。
「ここだよ。ここ。穴が空いてるのが見えないかい？　ふむ。こうすればわかるかな」
ウタハはある部分を指差すと、ポッケから取り出したルーペを当てる。拡大された部分に注視してみると、そこには確かに僅かな穴が空いているのが見えた。
「確かに穴が空いてるね。直径1ミリくらいの小さな穴だけど」
最後尾でルーペを見ていたハレがそう口にする。
「これがどうしたの？　ウタハ部長」
「ふふ。実はこの先にはあるものが隠されていてね。私達はその正体を突き止めたのだよ」
「あるもの？」
「言語モジュールだよ。このロボットの中心部には、言語モジュールが搭載されてるんだ」
言語モジュール？
全員の声が重なった。お互い顔を見合わせ、一瞬沈黙が訪れる。
「ていうことは、つまりこのロボットは喋ることができるってこと？　でも、それくらいならエンジニア部で作ったロボットでも搭載できるんじゃないの？」
続きを引き継いだのはチヒロだった。
以前、エンジニア部とヴェリタスは合同で巨大ロボットを製造したことがある。その時ヴェリタスは材料となるアルミ缶の提供と、AIのプログラミングを担当した。そのAIには言語学習機能も搭載したため、喋るロボットならすでに作ったことがある。ゆえに、ただ喋るだけの機能があるなら驚くことではないのだが、ウタハの表情が当然それだけではないと告げていた。
「それはそうだが、それだけじゃないんだ。我々も詳しくは確認できていないんだが、このロボットのモジュールは少し特別でね。まるで人の脳のような形と構造をしてるんだ」
「人の……脳？」
「ああ。つまり、姿形は違えどこのロボットは我々と同じ人間と言ってもいいのかもしれない。それが、今日伝えたかったことだよ」
ウタハは鼻息荒く、目を輝かせていった。しかし、それを聞くチヒロ達にはそれほど衝撃を受けた様子はなかった。なぜなら、キヴォトスには様々な外見の住民が暮らしている。ミレニアム学園には外見的に目立った特徴のない生徒が多いが、トリニティ学園には羽や耳などに動物の特徴を持つ半獣人の生徒がいる。また、ゲヘナ地区に多く見られる角持ちや尻尾持ちは珍しくない。学園外には獣人族やロボットの姿をした大人も多数生活している。ゆえに人間のようなロボットがいても、声を大にして驚くことではない。無論、それだけの話なら、だが。
「それはゲーム開発部のアリスみたいな感じってこと？」
チヒロが真っ先にある少女の名をあげた。
天童(てんどう)アリス。ゲーム開発部に所属する少女の名前だ。彼女も公には明らかになってないものの、その正体はアンドロイドである。だが、彼女はさっきも言った通り限りなく人に近い構造をしており、髪や肌の手触り、性格、どれをとっても初見でアンドロイドと見抜ける人はいない。
「どうだろう……彼女の場合は限りなく人に近い特別仕様だからね。このロボットもそうとは限らない。ただ、このロボットもまた、同じように特別であることは間違いない。アリスちゃんと同じようなロボットが人の手で作られた。そう聞いたら胸が踊らないか？」
「そうね。それは確かにそうだわ」
「まあ、誰が作ったかは皆目検討もつかないんだけどね。可能なら、同じ技術者として話してみたいんだが……」
ウタハが残念そうにつぶやく。
何事にも例外はある。人間のようなロボットがいるだけなら、驚くには値しない。しかし、それが作られたなら話は別だ。アリスの制作者もそうだが、このような高度な遺物の作者ほどその正体は掴めないものである。数学で答えは知っていても式がわからない低迷に似た歯がゆさがあった。
その気持ちはチヒロにもわかることだ。チヒロの側には明星ヒマリという超弩級の天才がいる。彼女の技術は間近で見ていても理解ができない。ウタハと違って対話は出来ているが、だからこそその中身を理解できない歯がゆさがある。そして、革命のような奇跡でも起きない限り、ヒマリの領域には追いつけないだろうと諦めてもいた。もっとも、それは決してネガティブな感情ではないが。
「まあ、その話は置いておいて。肝心なことをまだ聞いてないのだけど」
同情はしても、配慮はしない。チヒロはウタハの感傷を断ち切って、話を続けた。
「肝心なこと？」
ウタハが首をかしげる。彼女としては取得した研究結果はすべて伝えたつもりだった。だが、ヴェリタスが必要としている情報はまだ口にしていない。
「このロボットがヴェリタスの部室に起きた停電事件に関わっているのかどうか、よ」
チヒロは片目を瞑ると、自分たちが欲している情報を明らかにした。元々、ヴェリタスに起きた停電事件について調べるためである。
「ああ、そのことか。それに関してはよくわからなかった」
ウタハはゆっくりと首を振ると、毅然とした態度でありのままを伝えた。
「そう……」
まさか、
「正確にはそのような機関は確認できなかった。だが、このロボットを隅々まで調べられたわけじゃないからね。もしかしたら、未知の機能が隠されている可能性はないわけじゃない」
「そういうことね……」
「すまないね。力になれなくて」
「ううん。大丈夫よ。でも、エンジニア部でも分からないなら、どうすればいいのかしら」
チヒロもウタハも黙り込んでしまう。
口を閉ざしながら、チヒロは今後どうするかを考えていた。比較的ドライなチヒロだが、エンジニア部に対するリスペクトはある。彼女たちがわからないなら、自分たちがどれだけ頑張っても解明には繋がらない確信があった。
だが、だからといってこのロボットに対する調査を打ち切ってもいいものか。なんだか嫌な予感はするが、ハレにしばらく時間をもらうと言った割に、数日で報告に至ったのも、ウタハなりにこれ以上の進展は望めないと思ったからだろう。それに、幸い停電はあれ以降一度も起こっていない。となると、例の停電事件についての調査は打ち切って、ロボットは今後の研究対象としてエンジニア部に預ける。それがもっとも無難な選択肢だろうか。
「なら……直接聞いてみるのがいいんじゃないかな」
チヒロが決断を下すと同時に、突然先生が声を上げる。全員の視線が一点に集まった。
「直接ですか？」
「うん。外から調べても分からないなら、いっそこのロボットに意識を取り戻してもらって、直接教えてもらえばいいんじゃないかなって思ったのだけど」
「それは……なんというか、とても大胆な方法ですね」
「でも、分かりやすいでしょ。ウタハ。言語モジュールの封印を解く方法はわかる？」
「それは……一応調べてはいるんだが、これといって成果はないんだ」
無理もない。むしろ、暗号解除等はヴェリタスの領域である。エンジニア部の力が及ばずとも責められなかった。
「そっか。じゃあ、まずはロボットの言語モジュールの封印を解く方法を調べないとだね」
「ち、ちょっとまってください！　先生、本気ですか？　このロボットは謎が多いし、私たちを敵だと認識するかもしれないんですよ？　もし、暴走でもされたら……色んな人に迷惑をかけることになるかもしれない」
言語モジュールの封印を解く。その選択肢は千尋も考えていなかったわけじゃない。それでも口にしなかったのは、リスクを考えてのことだ。
もし、下手に封印を解いて、ヴェリタスの部室をに起きたような停電騒ぎがミレニアム全域で起きたら？　仮になんとかできたとしてもヴェリタスに責任が発生するだろう。そうなったら、世間的にも部の立場が悪くなる。部を想うからこその逡巡だった。
しけし、それを分かってなお、先生はあっけらかんと口を開く。
「大丈夫。もしそうなったら、私が責任を取るよ」
「ずいぶん簡単に言いますね……じゃあ、もしこのロボットが暴走して暴れだしたら？　力づくで止められる保証はありませんよ」
軽い調子で答える先生に、チヒロが眉を顰めながら新たなリスクを提示した。
万が一このロボットが戦闘用の装備を抱えていたら？　それで暴れたら？
ヴェリタスは高い技術力を持つが、決して武闘派ではない。システム的なリスクならともかく、物理的なリスクには無力だ。
だが、それでも先生の表情に変化はない。むしろ、さらに気楽になった。
「それも大丈夫じゃない？　もしこのロボットが暴走しても、チヒロやハレの攻撃で気絶させて、コタマがバフしたマキが必殺技を撃てばきっと勝てるよ」
「あたし！？　あたしがトドメなの！？」
「マキはアタッカーなのにデバフもできるし、サブスキルで追加ダメージも与えられる。本当に優秀だよね」
「先生はいったい何の話をしてるの！？　あとあたしはアタッカーじゃなくてハッカーだよ！」
マキが悲鳴をあげる。普段プレイするゲームの中ではイケイケなアタッカーを務めることもあるが、現実の彼女は前線を別室でサポートするような役割が適している自覚があった。
「ふふっ」
必死なマキの反応が面白くて、先生は声をあげて笑った。
「まぁ、冗談はさておき、安心して。何が起きても、責任は私が負うから。チヒロも本当は気になってるんじゃないの？　このロボットの仕組みとか」
「先生……」
子供が失敗しても、その責任は大人が追う。それは先生が初期から持つ大人としてのポリシーだった。
それに、先生にはある確信があった。
さっきの会話で、このロボットはアリスみたいなものだという話が出た。天童アリスは裏表のない純粋ないい子である。根拠としてはあまりに薄いが、それだけで信じてしまうような人間なのだ。先生は。
「副部長、責任云々は置いといて。私も先生に賛成かな。……それに、未知の技術で作られたロボットと会話できるなんて、気になるし」
先生の言葉を一部否定しながら、ハレが同意する。どんなリスクがあっても真理があるなら追求する。彼女にも真理を追い求める者(ヴェリタス)としての矜持があった。
「それもそうですが、私は外からの干渉を受け付けないというのが気になります。もし、それを応用して誰にも撤去のできない盗聴器を作り出せれば、先生の私生活も……いえ。諜報活動の役に立てるかと思います」
続けて、コタマも意味深な笑顔とともに賛同する。
「……今の聞き間違えかな？　なんだか不穏な言葉が聞こえた気がするんだけど」
「コタマ。先生のプライベートを侵すのはダメだっていつも言ってるじゃない」
チヒロが頭を抱える。コタマは素知らぬ顔で、明後日の方向を見ていた。
「ま、でもハレたちの言うことにも一理あるわね。私達は真理を追い求める者(ヴェリタス)。未知なるロボットが目の前にいるなら、足を止めるべきじゃなかったわ」
チヒロは嘆息する。まるで彼女が折れたような流れだが、もしこれが彼女単独の責任で済むなら、チヒロも真っ先に真理に向かって進んでいただろう。
それを見抜いていた先生は、やっぱり流石ね。
自分の気持ちを見抜き、瞬く間に方針を決めてしまった先生を見て、チヒロが微かな笑みをこぼす。それに気づいたのは本人のみだ。
「じゃあ、このロボットの言語モジュールの封印を解く方法を探しましょうか。ウタハ部長、このロボットだけど……」
「ああ。もちろん、ヴェリタスの部室に持って帰ってもらって構わない」
「ありがとう。マキ、運んでくれる？」
「ええ！？　なんであたし！？」
「アタッカーだから」
「その話まだ続いてたの！？　あとあたしはハッカーだってば！」
結局、かわりばんこで押していくこととなった。
「ぶー。なんであたしばっかり……」
「じゃんけんで決まったものだから、仕方ない」
「ええ。ズルはしてません」
順番は公平にじゃんけんで決めた。しかし、それでもマキが先頭になったのは運命のいたずらだろうか。文句を垂れるマキの両脇から、ハレやコタマが慰める。彼女たちの後ろ姿を追いかける形で、チヒロと先生は肩を並べて歩いていた。
「ところで先生。さっきの発言、あれは私達の活動を手伝ってくれるって意味だと思ってもいいのかしら？」
「もちろん、そのつもりだよ」
「ありがとう、先生。でも、お仕事の方は大丈夫なの？　忙しいでしょ？」
「大丈夫。昨日までに大きなものは終わらせてるし、出先でもできるものがたくさんあるから」
「そう……でも、大義名分的なものはあったほうがいいよね？　後でヴェリタスの活動の監査業務ってことで、シャーレに依頼を出しておくね」
「チヒロ……ありがとう。助かるよ」
「気にしないで。今回はむしろ、私たちの方が助けてもらってるから」
チヒロは先生を見上げ、ゆっくりと首を振った。
「そうかな？　でも、さっきはあんなふうに啖呵を切っちゃったけど……私に手伝えることなんてあるのかな？」
「それなら大丈夫。先生ならその場にいてくれるだけで助かるから」
力不足を不安視する先生を、チヒロは間髪入れず否定した。
シャーレの先生は連邦生徒会により超法規的権限を与えられている。そのため、先生を味方につけることはキヴォトスの最高権威を味方につけるに等しい。文字通り側にいてくれるだけで大抵のことは融通が利くため、ヴェリタスとしては大助かりなのだ。とはいえ、そんな打算は抜きにチヒロもヴェリタスの面々も先生を慕っている。ハレやマキ、コタマも先生がそばにいると、いつも以上にやる気と力を発揮する傾向にある。仮に先生に超法規的権限がなかったとしても、側にいてくれるだけで助かるのは変わらなかっただろう。
「それに、方法なら一つ、考えがあるんだ」
チヒロは自慢げに言った。その後、先生に方法について尋ねられても、「楽しみにしてて」と、笑うだけだった。
その答えがわかったのは、部室についてから数時間後のことだった。
ヴェリタスの部室の中央に特別に置かれたちゃぶ台に寝かされたロボットを、ハレ、マキ、コタマ、チヒロ、先生の５人で取り囲み、何か手がかりはないかと頭を悩ませていた。
「とりあえず、このロボットの目が光っているのと、ピボピボって音が鍵かもしれないけど……一体何を表しているのか、検討もつかないね」
最初の方は盛んに出てきた意見もいつしか出なくなり、会話が行き詰まる。停滞の空気を払拭するため、ハレが現状を言葉でまとめた。
ロボットは相変わらずピボピボと奇妙な音を鳴らしながら、目を点滅させている。それが何らかの暗号なのかもしれないと思ったものの、その解読にたどり着けていないまま、そこそこ時間が経ってしまい、いよいよ他のアプローチが必要かと思い始めたころだった。
「モールス信号、ではないでしょうか」
ふと、少し離れたところで車椅子に腰を預けた少女が口を開いた。透き通った鈴のような声だ。彼女は３０分ほど前に部室にやってきて、PCの前で作業を行っていた。謎解きに参加する素振りは見せなかったため、誰も気に留めていなかったものの、発言によって視線が集まる。
「モールス信号ですか？　その可能性は検討しましたが、解読は出来ませんでした。モールス信号は有名な通信手法の一つです。文字を２種類の組み合わせで符号化し、表現する。音と光はモールス信号でよく使われる手法ですが、規則性が必要です。このロボットにはそれがありません」
コタマは少女の言葉を首を振って否定すると、その理由をやや早口で説明した。
モールス信号は有名な通信手法の一つで、文字を符号化し、光の点滅や音のリズムで表現することができる。だが、ロボットの光の点滅具合と音の鳴り具合に統一性は全くない。実際、音と光でそれぞれ変換してみても、無意味な文字列が並ぶだけだった。
しかし、少女は「いいえ。そうでもありませんよ」と、否定に否定を重ねた。
「このロボットの信号は一見、不規則なようで規則性があります。みなさん、よく耳を済ませ、目を凝らして観察してみてください。音の感覚と光の点滅が、必ず交互に行われていることに気づきませんか？」
少女は車椅子を動かしてロボットの元に近づき、自身に満ち溢れた顔つきでその根拠を語った。
しばらくして、何人かが「あ」と声を上げた。光と音は素早く点滅し、鳴っている。とても分かりづらいが、注意してみればそれぞれのタイミングが重なっていないことに全員が気づいた。だが、しばらく観察を続けていると、それもまた違うことに気づいてしまう。
「あれ？　でも、今点滅と音が一緒のタイミングだったよ？」
真っ先に首をかしげたのはマキだ。ほんの一瞬、明らかに点滅と音のタイミングが重なった瞬間を彼女の双眸は捉えていた。他の４人も口にはしなかったものの、気づいてはいた。説明を求め、少女に再び視線が集まる。自身の発言と矛盾が生じても、少女はまるで動揺していなかった。むしろ、想定内だとしとやかな笑みをこぼした。
「よく気づきましたね。マキ。それがリセットを示す信号です」
「リセット？」
「順を追って説明していきましょう。まず、このロボットはモールス信号で何らかの文字列を発信しています。ですが、その信号は一定周期ごとにランダムに組み替えられます。そのスイッチが光りの点滅と音が重なる瞬間です。したがって、この信号を文字列に変換するなら、信号がリセットされたタイミングで、音と光を同時に文字列に変換すればいいのです」
長文だが、ゆっくり簡潔に少女は説明を述べると、彼女はペンとメモをコタマに差し出した。
「というわけで、次に音が重なったタイミングで、互いにモールス信号を文字に起こしてみましょう。コタマ、音の方を任せても構いませんか？」
「それは構いませんが……そんな単純なことで本当に答えがわかるのでしょうか」
「ふふ。まあ、見ててください」
疑心暗鬼なコタマに少女は自信ありげに微笑んだ。
「では、互いのメモを照らし合わせてみましょう。これでメッセージが浮かび上がるはずです」
しばらくして解析結果が出ると、ふたりは互いに翻訳した文字列をパズルのように組み合わせた。すると、少女の言う通り、やや仰々しいメッセージが浮かび上がった。
正面から見て七時の方向　キヴォトスでもっとも多くの情報を持つサーバーに礎あり　星に導かれし少女よ　その星の元に赴け
「これって……」
ハレがそのメッセージを見て、驚愕混じりの呟きを漏らした。
「どういう意味なんだろう。正面から見て七時の方向って、南の方かな？　それに、キヴォトスで最も多くの情報を持つサーバー？　そんなものがあるのかしら」
言葉の続きをチヒロが繋ぐ。「正面から見て」の正面とはロボットのことだろう。それはすぐわかっても、続く言葉の意味は一筋縄ではいかない。
「すごい！　さすがヒマリだね」
「まさか、こんな方法があったとは……脱帽です」
先生とコタマはそれぞれ褒め言葉を投げかけた。コタマからすれば得意とする通信規格の領域で一泡吹かせられた形だが、不思議とその表情に悔しさや陰りは見られなかった。
それもそのはず、対抗心を燃やすにはいささか相手が悪かった。
明星(あけぼし)ヒマリ。
ヴェリタスの元部長であり、長い歴史を持つミレニアムでも３人しか持つことを許されていない「全知」の称号を持つ彼女ならば、ヴェリタスを散々悩ませていた命題の解を簡単に導き出しても何ら不思議ではない。
「ふふ。超天才薄幸美少女ですから。当然です。……あ。別に点滅の発光と掛けたわけではありませんよ。薄いに幸と書いて──」
「すっごーい！　流石部長！　でも、星に導かれし美少女って誰のことかな？」
褒められたヒマリは誇らしげに笑う。だが、続く言葉を遮られて、なんとも微妙な面持ちになってしまった。
「マキ。褒めてくれるのはありがたいですが、私の発言を遮らないでください」
ヒマリは目をつむり、やんわりとマキをたしなめた。しかし、マキはどこ吹く風で暗号の中身を考察している。
「…………ふふ」
「さすがヒマリだね。こんな簡単に暗号の鍵を解いちゃうなんて。あと、忙しいのに急に呼び出してごめん」
目を閉じたままわずかに口角を上げて、硬直するヒマリ。
その隣にやってきたチヒロが、賞賛と謝罪を同時に口にした。
「いえ。お安い御用です。見ず知らずの他人ならいざしらず、他ならぬチーちゃんの頼みですから。それに、部室が停電した件に関しては私としても気になっていましたし」
ヒマリはチヒロの顔を見上げると、そしらぬ顔で言ってみせた。だが、内心ちょっと寂寥感を抱いていることは誰にも察することはできない。
「それで、ヒマリ。やっぱりうちのセキュリティに問題はなかった？」
チヒロは話を切り替えると、ヒマリが行っていた作業の結果を確認した。
チヒロは今日、ヴェリタスの元部長であるヒマリに改めて部室のセキュリティチェックを頼んでいた。ロボットの言語モジュールの封印を解く方法について知恵を貸してもらえたらと思っていたのはそのついでだ。まさか、あんなふうにあっさり答えを示されるとは思っていなかったが。
「ええ。念のためアクセスログも洗ってみましたが、やはりヴェリタスにハッキングを仕掛けたハッカーは確認できませんでした」
ヒマリはうなずくと、簡潔に結果を報告した。
「そう……」
チヒロは小さく吐息を漏らし、遠い目で考え込む。
先日の停電事件について。ハレ達が徹夜で監視し、自身も出張から帰ってきた後、一通りのチェックも行った上で、ハッキングではなくハードウェアツールによるアプローチだと結論づけたものの、内心ではどうにも嫌な予感が拭えなかった。何か、重要な脆弱性(セキュリティホール)に気づけていない気がした。だが、ヒマリはチヒロの知る限り最も高い技術を持ったハッカーである。そんな彼女が問題ないと言うなら問題ないのだろう。それほど、ヒマリへの信頼は絶対的だ。
「ひとまず、セキュリティに問題はなかったと言っていいでしょう。しかし、それ以外についてはまだわかりません」
ヒマリは鋭く横目を流した。その視線はロボットに、そして先生、チヒロへと続く。
「このロボット、どうにも嫌な予感がします。一度、私の方で詳しく調べてもいいですか？」
「それはいいけど……今すぐ？」
「ええ。といっても、今から行うのは簡単な検査だけで、詳細は後日私の研究室で行いますが。道具を取ってくるので、チーちゃん。そのロボットはそのままにして置いてもらっても？」
「構わないよ。どうせこれから暗号の意味を解かなきゃいけないし」
チヒロはうなずくと、メモを手に試行錯誤する３人を見ていった。ヒマリのおかげで文字にすることはできたものの、あのメッセージには謎が多すぎる。意味を突き止めるには相応の時間がかかりそうだ。
「ふふ。ありがとうございます」
　ヒマリは微笑むと、ふうと艶のある息を吐いて、先生の方に居直った。
「では、道具を取りに戻るとしましょう。先生。手伝っていただけないでしょうか」
「いいよ」
「ありがとうございます。では、車椅子を押してください」
「ヒマリの車椅子って全自動だよね！？」
「ええ。ですが、たまには人に押してもらうのも乙なものです。超天才美少女もたまには人に甘えたくなるのですよ」
「まぁ、別にいいけど……」
釈然としないながらも、先生はヒマリの頼みを受け入れた。彼女の車椅子は全自動で進行後退可能なのはもちろん、冷暖房機能やマッサージ機能までついてる。人に押されるのはかえって非効率だと思うが、生徒に頼られては断れないのが先生の性である。
「それにしても、相変わらず楽しい子たちですね。ヴェリタスの部員のみなさんは」
「だね。仲がいいのはいいことだよ」
「ええ。違いありませんね」
先生に車椅子を押されて廊下に出ると、ヒマリは懐かしむような声でいいながら微笑んだ。
彼女は元々ヴェリタスの部長だったが、現在はセミナー参加の特殊組織、特異現象操作部にその身を置いている。普段はそちらや自身の活動にかかりきりなため、ヴェリタスの部室に顔を出すことはほぼない。今日もチヒロに呼び出されていなければ、自らの研究室に籠もっていただろう。
「さて。先生ほどの方であれば薄々察しは付いているでしょうが、わざわざ先生を連れ出したのには理由があります」
「え、そうなの？　てっきり、いつもの悪ふざけかと」
「……ふふ。私だって真面目な話をするときはあります。とにかく、私の話を聞いてもらえますか？」
「もちろん。ごめんね、茶化しちゃって」
「まあ、構いませんが」
ヒマリは嘆息した。先生が自分に抱いているイメージもわかったので、抗議したい気持ちはあるが、今はそれよりも伝えなければならないことがある。
「さっきは誰にも言いませんでしたが、あのモールス信号にはまだ、厄介な秘密が隠されていたのです」
「厄介な秘密？」
「あのロボットには電子機器で解読しようとした場合、強制的に信号の列を組み替える機能が備わっていました」
「えっと？」
「簡単に言うと、あのモールス信号を文字列にするには、必ず手書きでやらなければなりませんでした。コタマがなかなかたどり着けなかったのは、スマホを使って解読していたからでしょう」
モールス信号の変換は、コタマも何度か試みていた。だが、いずれも意味不明な文字列にしかならず、断念したのだ。確かにその時は手書きではなく、スマホで行っていたが。
「そんなこと、よく気づいたね」
「作業の手を止め、脳内でモールス信号を文字列に起こしてみたのです。その時は信号の列は変わりませんでした。ですがその後、PCやスマホのメモ帳を使って同様の作業を行ってみたところ、信号の列が切り替わったので、そう思ったのです」
「脳内で……すごいね。ヒマリ」
「それくらい、超天才美少女ハッカーである私の手にかかれば、造作もありません。問題はその先です」
「先？」
「ええ。少し考えれば分かることですが、この機能を実行するには対象となる電子機器の情報をリアルタイムで盗み取らなければなりません。つまり、常時ハッキングを行っているのです。当然、私はその対策を試みました。PCやスマホをネットワークから切り離し、解読してみようと思ったのです。しかし、いずれも効果はありませんでした」
「ヒマリでも、ハッキングを止められなかったっていうこと？」
「悔しいですが、そのとおりです。ですが、いくら私でも完全にオフラインとなった端末にアクセスするのは骨が折れます。それにも関わらず、あのロボットは何らかの方法で情報を取り続けました。そのような芸当ができる存在はひとつしか思い浮かびません、先生もご存知ではないでしょうか」
「……もしかして」
「はい。結論から言って、あのロボットはデカグラマトンとの関連性があるかもしれません」
「デカグラマトン……」
案の定、頭の中に思い描いていた名前が出てきて、先生は顔を強張らせる。
デカグラマトン。それは太古のキヴォトスで生み出された超高性能人工知能の名称である。その実体は謎が多いが、驚異的なハッキング技術を持ち、他のAIを預言者と呼ばれる同士に仕立てあげる能力を持っている。つまるところ、AIに対する絶大な影響力を持つのだ。
「でも、あれってもう消滅したはずじゃ？」
「ええ。ですが、デカグラマトンの本体はともかく、その支配下となった預言者に至ってはその限りではありません。それに、あれほど高性能なハッキングができるAIをほかにご存知ですか？」
「それは……わからないけど」
強い口調で言われて、先生は言葉を失う。
ヒマリはデカグラマトンの脅威を身にしみてわかっていた。なんせ、かつてデカグラマトンはミレニアムの最高傑作のひとつである超高性能演算機能「ハブ(hub)」をたったの０．００００００３１秒でハッキングした。その場面を直接目撃しているのだから。先生もそれは同じだ。
だが、最初に口にした通り、デカグラマトンの本体は消滅しているはずである。その現場を、先生とヒマリは直接目の当たりにしていた。
ヒマリの所属する特異現象捜査部は、デカグラマトンを始めとした未知の技術を調査するため、設立された。その後、「ハブ(hub)」がデカグラマトンにハッキングされたことで、ヒマリがシャーレに助力を依頼し、駆けつけたのが先生だったのだ。先生はヒマリともう一人の特異現象捜査部員である和泉元(いずみもと)エイミを加え、総勢３名でデカグラマトンの調査に当たった。その結果、紆余曲折あり、デカグラマトンの正体がとある施設のコーヒー自販機に組み込まれた「お釣りを計算するAI」であることを突き止めたのだ。もっとも、突き止めたというより、これもデカグラマトン自身がそれを明かしたという方が近いかもしれない。とにかく、自らの正体を口にした後、デカグラマトンは意味不明な妄言を並び立て、施設とともに消滅した。しかし、それはあくまで本体である。ヒマリの言う通り、デカグラマトンにより生み出された預言者は今もどこかで活動を続けているだろう。預言者には本体ほどのハッキング能力はないはずだが、デカグラマトンに関することはあまりにも謎が多すぎる。警戒して損はないかもしれない。
「まぁ、現状は勘以外に根拠がない話です。しかし、あのロボットは想像以上の危険性を秘めているやもしれません。先生にはそれだけ、気に留めておいてほしいのです」
「……うん。わかった。教えてくれてありがとう」
「それと。くれぐれもチーちゃんや他の部員には内緒でお願いします。いたずらに不安を煽りたくはありませんから」
「うん。わかってるよ」
言われなくても、わざわざ自分を廊下に連れ出した時点で内密にするべき話だとわきまえていた。ヒマリも当然わかってはいたが、こういった取り決めは察して精神では食い違いが発生することがある。それを防ぐために、あえて口にしたのだ。

その後、特異現象捜査部の部室から必要なものを取り、ヴェリタスの部室に戻ると、入口前で待ち構えていたマキに出迎えられた。
「あ！　部長、先生！　やっと帰ってきた」
「どうしたの？　マキ」
「えっとね。キヴォトスで最も多くの情報を持つサーバーってなんだろうって話してたんだけど、ハレ先輩が知ってるんだって」
尋ねると、マキは声高に言った。
「先生、覚えてる？　キヴォトスで最も多くの情報を持つサーバーがある場所のこと」
ハレは右手に持っていたエナジードリンクの缶を一口含むと、先生の近くに寄って問いかけた。
「うん。前に一緒に行った山奥にある第3公立天文台のことだよね？」
「そう。流石先生。話が早くて助かるよ」
先生は、生徒との思い出を忘れることは絶対にない。今年の１月にサーバーメンテナス中に正体不明のハッカーからある「挑戦状」が届いた。その内容が、「キヴォトスで最も多くの情報を持つサーバーが此処に」という一文ととある山奥の座標だったというわけである。ハレは先生を呼び出し、共にその場所に向かったものの、あったのは古くなって閉館した第３公立天文台だったというわけである。　
「──というわけ、指定された座標に向かったけど、その天文台以外に大したものはなくて……高度な技術者の質の悪いイタズラっていうことで納得したんだ」
ハレは先生が合流するまでしていなかった話を、全員に向けて説明した。
あの一件は遠い山奥に向けてわざわざ足を運んだものの、結局犯人がどうしてあの場所にハレを導いたのはわからずじまい。そして、その差出人も不明なままで、尾を引く形で終わることとなった。あれからもう何ヶ月も経っているが、今になって同じ一文を目にすることになるとは。とてもじゃないが、偶然とは思えなかった。
「なるほど。じゃあ、星に導かれし少女って……ハレ先輩のこと？」
「多分、そういうことになるね。犯人は一体、私に何を伝えたいんだろう」
「さあ。それは回目検討もつかないけど、重要なのはヴェリタスに実害が出ていることなんだよね」
チヒロは
ハレも首を縦に振って、賛同の意を示した。
「そうだね。前は私と先生が苦労しただけだけど、今回は部に損害が出てる。停電騒ぎもあったし、窓ガラスだって割れた。相変わらず、いたずらにしては質が悪すぎる……まあ、前回はむしろ、得した部分もあったけど」
「ハレ？　何か言いましたか？」
「っ！　な、なんでもない。それより、私も副部長の意見に賛成。今回は部に被害が出た以上、犯人を突き止めるべきだと思う」
「となると、一番手っ取り早いのはその場所に行ってみることだね。みんな、準備して」
チヒロがパンパンと手を叩く。すると、えー！　という声が同時に３つ上がった。
「またあの山奥に行くの？　結構遠いよ？　偵察ドローンを飛ばすとか、人工衛星をハッキングするとかじゃダメ？」
まずは現地に行くまでの苦労を知っているハレが苦言を呈した。前回は先生の提案があったから歩いたものの、あれを繰り返すのは避けたかった。
だが、チヒロは容赦なく首を振る。
「ダメ。ハッキングを悪用しないで。それにドローンだってタダじゃないんだし、日頃の運動不足を解消するいい機会じゃない」
「私は何かがあったときのために残ろうと思います。ヴェリタスに用がある人が部室に尋ねてくるかもしれませんから」
続いて、コタマが至極真っ当な意見を口にする。だがこれも。
「それなら大丈夫。ヒマリはこれからロボットについて調べるみたいだから。部室が空くことはないよ」
「ヒマリ先輩は行かなくていいの！？」
「うん。車椅子で遠出するのは大変だろうし。マキは歩けるでしょ？」
「うう……それはそうだけど」
　最後にマキも玉砕して、無事
「まあまあ。今回も私が一緒に行くから。また、キャンプに行ったときのみんなの服が見たいな」
「先生。もう春だよ？　あの格好じゃさすがに暑いよ」
「でも、これから夕方になるし。山は冷えるよ」
「うう。そういうものかな。じゃあ、着替えてくるよ」
そういって部室を出ていったハレに、コタマやマキもついていく。その足取りはトボトボとしていて、気乗りしていないのが明らかだった。
その後ろ姿を見ていた先生は、少し罪悪感を抱いた。しかし、ハレたちの運動不足が深刻なのは事実だ。それに、前回キャンプに行った時も、なんだかんだで楽しんでいるのも知っている。だから、先生は変に同情することはなかった。
「なら、せっかくだし私も着替えてこようかな。というわけでヒマリ、部室は任せてもいい？」
ハレたちを見送ると、チヒロはロボットの外見を注意深く観察していたヒマリに向けて頼んだ。
「ええ。構いませんよ。私も現場の様子は気になりますが……先生に任せるとしましょう」
ヒマリは留守番を承諾すると、細めた目を先生に向ける。
その瞳が、表情が言外に告げていた。デカグラマトンの手がかりがあったら報告しろと。
「うん。ヒマリの代理は荷が重いけど、任せて」
先生は言葉通りの意味と、言外の意図に対しても、了解の意を示す。
「じゃあ、先生。悪いけど、校門で待っててくれる？　１０分くらいで行くから」
チヒロは、先生とヒマリが何らかの秘密を共有していることに気づいていた。だが、そのことについて言及はしなかった。先生やヒマリが自分に話さないということはなにか理由があるのだろう。そこまで察していたからだ。

　その後、キャンプ衣装に着替えたヴェリタスの部員とともに、先生は暗号の指し示す場所へ向かう。目的地は電車を１時間にわたって乗り継いで、さらに１時間歩いた先にあった。
「ハア……ハア……やっぱり、遠すぎる」
「みんな。もう少しで着くから頑張って」
息も絶え絶えなハレ達３人組を、先生が鼓舞する。
先生も歩きやすい靴を履いてきたが、なれない山道だ。先生とて辛いのは同じである。だが、大人としてへばった姿を見せるわけにはいかない。その分、翌日の筋肉痛を考えると頭が痛いが。
「はあーーー！　やっとついたーーー！」
やがて到着すると、３人は足を投げ出し、地面に座り込んだ。
「ここが、キヴォトス第３公立天文台？」
チヒロは施設の外観を眺めていった。大人としての威厳を保つため、ここまで空元気で乗り越えてきた先生も、疲労を隠せていない。そんな中、１人だけ涼しい顔をしているのは流石というべきか。
「何も、ありませんね」
しばらく休憩した後、中に入ると、コタマが率直な感想を口にした。
「これはPCでしょうか？」
しばらくして、机の上に１台のPCが放置されているのを発見した。ハレと先生が見つけたPCと同じものだ。あれから時間が経っているはずなのに、一切ホコリを被っていない。だがそれなりに疲れが溜まっていたのか、誰もそのことに疑問を持たなかった。
最初にPCを発見したコタマが電源を入れる。
「前はこの端末を操作すると、天井が開いたんだけど……」
「そうなのですか？　ふむ。全然反応しないですね？」
「あれからしばらく経ってるから、電源が通ってないのかな。……あ、動いた」
「わわ！　なんかすごい音！」
コタマが操作してもうんともすんとも言わなかった端末が、ハレが操作した瞬間に施設がうなりを上げる。これで前回は天井が開き、この場所が閉館した天文台だとわかったのだ。
しかし、今回開いたのは天井ではなかった。
「わ、わわ！　床が！」
「マキ！　気をつけて！」
まるで地割れのように、床が動く。ちょうど境目に立っていたマキが、危うくバランスを崩しかけた。
あわあわと慌てた声を上げながら、マキが先生の胸元へ飛びつく。
開いた床から台座のようなものが迫り上がってくる。
「先生！　あれって……」
　マキが台座の上に乗っていたものを指さす。床の動きが完全に止まったのを確認してから近づいてみると、赤いクッションのようなものに丸い装置が収められていた。外はガラスケースに覆われているが、簡単に外すことが出来た。
「これって……なにに使うんだろう？」
手にとって間近で眺めてみても、それがどういう用途で使われるのかは想像できなかった。重量はバスケットボールほど。形は単純な丸とも資格とも言えず、梨のような歪な形をしている。見た目だけで受けた印象を言葉にするなら──。
「心臓みたいだね」
チヒロがまじまじと感想を口にする。同じことを、その場の全員が持っていた。特に、それを持っている先生の手には先程から言葉にしにくいエネルギーのようなものが伝わっていて、まるで脈打っているように感じた。
「これが……ロボットの言語モジュールの封印を解く鍵なのかな。どうやって使うんだろう」
「さあ。とりあえず、持ち帰ってから確認してみましょう」
「え？　持ち帰るの？」
「うん。じゃなきゃ、こんなリュック背負ってこないよ。先生、悪いんだけど、しまってくれる？　中に緩衝材も入ってるから」
「オッケー」
チヒロは現場に手がかりがあるかもしれないことを悟っていた。それがハードウェアにせよデータにせよ持ち帰れるように、サイズの大きいリュックを背負い、ポケットにUSBメモリを仕込んでいたのだ。
「じゃあ、無事手がかりもゲットできたことだし、帰ろうか」
「うへー。またあの山を下るんですか」
コタマがガクッと肩を落とす。それでも、帰りは緩やかな下りが多い分、疲れは軽減されていた。そうして、ミレニアムに帰る頃にはすっかり日が暮れてしまっていた。
「今日はもう遅いし、続きは明日にしましょうか」
ヴェリタスの部員はチヒロを除く全員が自他ともに認めるインドア派であり、慢性的な運動不足の集まりである。部室に着いた時には全員がくたくたになってしまい、とても作業ができる状態じゃなかった。それを見越したチヒロの一声で、今日は解散となり、普段、部室に居残ってゲームやそれぞれの作業に没頭しがちなヴェリタスの面々も、この日ばかりは甘い蜜を求める蜂のように帰って行った。その後、各自の部屋で眠りについたと思われたが。

深夜。
施錠していたはずのドアが開かれた音がして、先生は目を覚ました。カチッとスイッチを押す音が聞こえて、室内に光が灯る。
身体を起こすと、制服を着たハレの姿が見えた。
「せ、先生！？　どうしてここにいるの！？」
まさか、先生がいるとは思わず、ハレが身をのけぞらせて驚く。
そんな反応になるのも無理はない。先生を含め、外部の者が学園内に招かれた場合、来客用の宿直室で寝泊まりするのがミレニアムのルールだ。しかし、今日の先生は不測の事態に備えて、ハナから徹夜で見張るつもりだった。それを耳にしたチヒロが、気を利かせて寝具を用意してくれたのだ。それらは全て、ハレ達が帰った後に決まったことである。
その旨を説明すると、ハレは申し訳なさそうに目を線にした。
「そうなんだ……起こしちゃってごめん。てっきり、先生は宿直室に泊まるものだと思ってたから、油断してた」
「ううん。私の方こそ、説明してなかったから。それより、ハレはどうしたの？　忘れ物でもした？」
「いや、私はさっきまで部屋で寝てたんだけど、なんだか目が覚めちゃって……それなら部室で作業でもしようかなと思って。でも、先生が寝てるなら帰るよ」
そう言って、踵を返そうとする。先生はその小さな背を呼び止めた。
「どうしたの？」ハレがゆっくりと振り返る。
「せっかく来たんだし、コーヒーでも飲んでかない？」
「え。でも、先生寝てたんじゃないの？」
「実は、私もみんなが帰ってからずっと寝てたんだ。だからか、目が覚めちゃって。せっかくだし、話し相手になってくれると嬉しいんだけど」
「……先生がそう言うなら、別にいいけど」
はにかんで頼みこむ先生に、ハレは目を逸らし、そっけない返事をした。でも、その表情からは嬉しさが滲み出ていた。

目を逸らしたまま、ハレは自身の定位置であるPCの前に腰掛ける。
「ちょっと待っててね。すぐ用意するから」
先生は寝床から離れると、先生は自身のバックから持参したコーヒーを取り出し、手早く用意した。
「はい。熱いから気をつけてね」
先生は熱々のコーヒーが注がれたマグカップをお盆に乗せ、デスクの上に置いた。
「ありがとう」
ハレは取っ手を持って顔に近づけると、まずは香りを楽しんだ。それから、ふーふーと息をかけ、ゆっくりと口をつける。
「このコーヒー。すごく美味しい。やっぱり、豆から挽いたコーヒーは格別だね」
「でしょ。実は最近、コーヒーにこだわってるんだ。まぁ、今日はあらかじめシャーレで挽いてきたものを持ってきたから、少し味が落ちちゃってるかもだけど……」
「ううん。十分美味しいよ。こんなに美味しいコーヒーを飲んだのはいつぶりだろう……」
「ふふ。シャーレに遊びにきたら、いつでももっと美味しいコーヒーが飲めるよ」
「ほんと？　じゃあ、今度時間を見つけて遊びに行くね」
無類のカフェイン中毒者であるハレは、エナジードリンクが好物だ。だが、同じカフェインが取れるコーヒーにもこだわりがある。自分では到底やる気にならないが、豆から挽いた本格的なコーヒーをいつでも飲めると聞いて胸を躍らせた。
「でも、先生がこんなに美味しいコーヒーを作ってるって知ったら、みんな黙ってないんじゃない？」
「まあね。最初はちょっと美味しいコーヒーが飲みたいなって気まぐれで始めたのに、今ではそれ目当てで遊びにきてくれる子もいるよ。でも、ハレの分もちゃんと用意するから、安心して」
「そこはまあ。先生だから心配してないけど……相変わらず人気だね。先生は」
シャーレの先生には、不思議と人を惹きつける魅力がある。そのせいか、シャーレの依頼は常にパンパン。相談事を持ちかける生徒も後を絶たないそうだ。
それなのに、私たちのためにこんなに時間を割いて、大丈夫なのかな。
心の中で、ハレは疑問を口にする。
こうして話せる時間も、本来簡単に取れるものではない。しかし、ハレがそのことについて口にすることはない。もし、余計なことを口にして、先生がやっぱり他の子のところに行くと言い出したら寂しいから。
そんなことを思っていると、ふと胸に穴が空いた気持ちになる。その隙間を埋めるためにコーヒーを飲もうとして、中身が空になっていることに気づいた。
先生が持ってきた豆は1人分だ。それをふたりで分けあったため、ちょっと話をしている間に、すぐに飲み切ってしまったらしい。
ハレは席を立つと、部室に備えてあるインスタントのコーヒーを淹れた。コーヒーバックにお湯を注ぎ、そのままコーヒーの苦味が滲み出すのを待つ。
「それにしても、不思議だよね。今日持ち帰ってきたあれ、一体何に使うものなんだろう」
立ったついでに、ハレはロボットのそばに置いてある金庫に近づいた。その中には、先刻持ち帰ってきた心臓のような物体が保管してある。解錠のパスワードはヴェリタスの部員と先生しか知らない。
ハレは一言「これ、開けるね」と断ると、金庫を開いた。
「これ、本当に心臓みたいだよね。それに、こうしてるとなんだか脈打ってるみたい。ドクンドクンって」
ハレは中にあるものを両手で包み込むようにとり、どこかうっとりとした調子で呟いた。
「ピボ！」
しばらく感嘆の吐息を漏らした後、ハレが金庫に心臓を戻そうとした瞬間だった。突然、ロボットが一際大きな声を上げる。
はっとして目を向けると、股の小さな穴のあった部分が大きく開いていた。
「せ、先生！　これって……」
チヒロが心臓を金庫に閉まった時は、なんの反応も示さなかった。にも関わらず、それが今や心臓を入れてくださいと言わんばかりに開いている。
「入れてみて、いい？」
ハレが瞳を輝かせ、先生に許可を求めた。
「うん。いいよ」
先生は少し迷ったものの、頷いた。チヒロや他の部員がいない中、この少数人数でロボットが暴走でもしたら、対処できるだろうか。おそらく、大丈夫だろう。それが物理的なもの、あるいは情報的なものだったとして、対処する術を先生は持っている。あまり使いたくないものではあるが、いざというときに責任を取るのは大人でなければならない。行使する覚悟はいつでも整っていた。
「じゃあ、やるね」
ハレは手に持った心臓を慎重に穴の中へと入れた。その後、中が気になって覗き込んでみたものの、不思議なことに覗き見防止フィルムのようになっていて何も見えなかった。ハレの目には自分の腕の一部から先が、欠けたように映っていた。一体、どのような技術を使っているのだろうか。好奇心を募らせながらちょうどいいポジションを探して腕を動かしていると、うまく嵌め込むことができたらしい。これみよがしにガコッと音がして、ハマった感触があった。
「ふう。出来たよ。先生」
ハレが満足げな顔をして、手を抜き出す。その数秒後のことだった。
「ピボ。ピボボボボボボボ！！！」
突然、ロボットの目が赤く光ったと思いきや、けたたましい音で鳴き始めた。
「わ、わわわ！？」
突然の大音量に、ハレが驚く。
「慌てなくて大丈夫。多分、音が鳴ってるだけだよ」
先生は落ち着いた声で、ハレを宥めた。
『……コンニチワ。オハヨウゴザイマス』
熱風が収まると、ロボットの目にオレンジのネオンカラーが灯る。同時にややぎこちないノイズがかったシステム音声で、挨拶を口にした。
「先生……これって」
「喋った……ね」
ハレと先生が顔を見合わせる。ふたりとも排熱を始めたことには面食らったが、ロボットが喋ったことに驚きはない。ウタハがこのロボットには言語モジュールが備わっていると言っていたからだ。
『ワタシハアンチプロトコル「PIBO」キドウシークエンスヲカクニン。ジンカクモジュールキドウ』
　その後、ロボットは抑揚のない声で、淡々と機械のようなことを口走った。次の瞬間、決して長くはない手足を起用に使い、体を起こす。
『ガクシュウ──ガクシュウ──ゲンザイ、「PIBO」ハ　ミレニアムサイエンススクールショゾクノハッカーシュウダン　ヴェリタスノブシツニイマス』
首は回転式になっているらしい。まるで動作確認のように一周回った後、無機質な双眸がハレを正面に捉えた。
　「ひっ」ハレが小さな悲鳴をあげ、一歩下がる。彼女の前に自身を盾にするように、先生が立ちはだかった。
『ガクシュウ──ガクシュウ──メノマエノショウジョヲ　ガクシュウ　ケンサク　ミレニアムサイエンススクール２ネン　オマガリハレトニンシキ　メノマエノダンセイヲ　シャーレノセンセイトニンシキ』
続いて、自分たちの名前を呼ばれたことにハレと先生は驚いた。一瞬で自分たちの正体を認識したらしい。
驚きながらも、ハレはどこか冷静な頭で考えた。
　このロボットは、どうして私達のことを知ってるんだろう。もしかして、中のロボットには記憶する音声デバイスが入ってるの？　それで、部室での会話から学習した？　でも、わざわざ学年を口にした覚えはないし、名字も同じ。会話から学習するのは不可能に近いと思う。じゃあ、まさか一瞬でミレニアムのデータサーバーをハッキングした？　ううん、そんなことヒマリ部長でも不可能なはず。まあ、ミレニアムのセキュリティにはヒマリ部長を含めて私達ヴェリタスも協力してるから、出来ないことはないけど。でも、それでも一瞬では無理──。
ハレの脳内で、想像と自己否定が目まぐるしく繰り返された。
『RAPプログラムキドウ』
　RAP──一体何の略だろうか。RAP(ラップ)はコンピュータではリモートアクセスポイントを指す用語だが、現状との関連性は見られない。そんなことを思っていると、
プシュー！
ロボットが噴射音を奏で、生暖かい熱風を吐き出す。流石にこれはやばいかと思い、先生はコートの懐のカードに手をかけた。使いたくない力をいつでも行使できるように。しかし、どうやらそれは使うまでもなかったようだ。熱風が顔にかかり、思わず吸い込んでしまったが、匂いや毒性は感じられない。例えるならパソコンの排熱口から感じる熱風と似ていた。熱風が吹いていた時間は１０秒にも満たなかった。
「ジンカクモジュールケイセイプロセスカンリョウ。コレヨリ　サクセイシタ　ジンカクニキリカワリマス」
ロボットは再びプシューと音を鳴らし、ため息にも似た排熱を行った。生暖かい風に当てられて、ハレは自己問答を強制的に中断させられた。
排熱が終わると、ロボットの目の点滅が止み、オレンジのネオンカラーを灯す。そして、同様の丸い蛍光灯のような何重にも重なった輪っかが、その頭上に浮かび上がった。
「……ふう。ハレ。先生。初めまして。大変長らくお待たせして、申し訳ございません」
ロボットは細い息を吐いたような声を上げると、ハレと先生それぞれと目を合わせ、頭を下げた。どういう原理なのだろう。エンジニア部が何をしてもうんともすんとも言わなかった機体が、ぐにゃりと曲がり、３０度のお辞儀の体勢を作っている。しかも、目はそのままだが喋る時に口が動くようになっていた。それにより、まるで人間のような表情を作ることが出来るようになっていた。
「あ、あなたはロボット？　会話ができるの？」
　恐る恐る近づくと、まずはハレがファーストコンタクトを試みた。
「はい。私はロボットです。会話も出来ます」
「そ、そうなんだ……えっと。何から聞けばいいんだろう。なんだか突然のことで頭がついていけない」
ハレは頭を抱えて、天を仰いだ。疲れもあって、エナドリが欲しくなる。助けを求めるように先生に顔を向けると、冷蔵庫の方へ歩み寄る。
「じゃあ、いきなりで悪いんだけど、質問いいかな」
ハレから会話のバトンを受け継いだ先生は、膝を曲げ、ロボットに目線を合わせると、柔和な笑顔を浮かべて話しかけた。すると、ロボットも目の光の形を変え、笑顔を表現してみせた。
「はい。なんですか、先生？」
「君の名前はなんていうの？　ちなみに、もう知ってるかもしれないけど、私はみんなからは先生と呼ばれてるよ。それと、この子は小鈎ハレだよ」
紹介を受けたハレは片手をひらひらと振って応えた。もう片方の手にはエナジードリンクの缶が握られている。ハレは少し離れたところで最初に聞くことがそれ？　という顔をしていた。でも、先生からすればこれは一番大事なことだった。なぜなら自己紹介はコミュニケーションの入り口である。友好な関係を築くには、お互いの名前を呼び合うことが想像以上に大事なのだ。
「ハレさんに先生ですね。覚えました。ワタシはPIBOといいます。ですが、これは正式名称ですので、他の呼び方をしていただいても構いません。というより、正式名称では堅苦しいので、もっと呼びやすくてカジュアルなニックネームを考えていただけると嬉しいです」
ロボットは流暢な言葉で、懇願するように言った。声はともかく口調から徐々にロボットらしさが抜けてきて、まるで人間としての話し方を覚えているみたいだと先生は思った。
「ニックネームかー。うーん……急には言われても思いつかないな」
今度は先生がハレにバトンを繋ぐ番だった。
「ハレは何かいい案ある？」
「えっと、ごめん。私もいきなり言われても、すぐには思い浮かばないかも……」
ハレはほとんど反射的に頭を振った。ただでさえ、考え事で頭がいっぱいだったのだ。急にロボットのニックネームなんて考えている余裕はない。そう思っていたのだが、どうしてか閃いてしまった。
「あ。ごめん。やっぱり、ひとつだけ思い浮かんだかも」
それを口にしてから、すぐに後悔する。思いついたのは、我ながら単純にも程がある発想だ。しかも、子供っぽい。先生に笑われないかと恥ずかしくなってしまった。
「本当ですか？　教えていただけると嬉しいです」
だが、ロボットは文字通り目をキラキラさせて、続きを聞きたがる。ハレはまっすぐな頼み事に弱かった。先生に一瞬目を向けると、仕方ないと小さな息を吐いて、口を開く。
「えっと、君の名前はPIBOって言うんだよね」
「はい。そのとおりです」
「じゃあ、それとロボットを組み合わせてピボット……ピボットくんって呼ぶのはどうかな」
ハレは頬を赤らめ、先生の顔色をうかがうようにして言った。
ハレの提案を聞いた先生とロボットはぽかんとしていた。リアクションが返ってこないことで、ハレは本当に呆れられてしまったのかと俯いてしまう。だが、先生が生徒の言葉を笑うなんてことがあるはずがない。先生の言葉が出なかったのは、むしろ感心していたからだ。
「いいんじゃない？　すごく呼びやすいし、可愛くていいと思う」
「ピボット…………はい！　気に入りました！　ワタシのことはピボットくんと呼んでください！」
数秒後、互いに顔を見合わせた先生とロボット──ピボットくんが賛同の笑顔を浮かべる。
「えっと。じゃあ、名前も決まったところで。ピボットくんに聞きたいことがあるんだけど、いいかな？」
「はい。ワタシに答えられることなら、何でも聞いて下さい」
「ありがとう。じゃあ、まずは君が何者なのか、教えてくれると嬉しい」
「すみません。その質問には答えられません」
　初っ端から、返答を拒否されてしまう。だが、それは予想していたことだ。その先へ、もう少しだけ踏み込んでみる。
「答えられないのは、作った人に口止めされてるから？」
「いえ、そういうわけではないのですが……正直に申し上げると、私自身に関することを何も覚えてないのです。自分が何者なのか、どこで作られたのか。何も……」
ピボットくんは申し訳無さそうに顔をうつむかせていった。その様子を見ていると、あながち嘘をついているようには見えない。だが、相手はロボットだ。人としての感情がない分、人を騙す演技はお手の物かもしれない。だが、疑うよりは信じろ。が先生のモットーである。ピボットくんが何も覚えていないと言ったのだから、それを信じることにした。だから、これから続く質問は、すべて先生の好奇心から出る、あるいはコミュニケーションを深めるためのものだ。
「そっか……じゃあ、どうしてヘイローを持っているのか聞いても、わからないよね」
　先生はピボットくんの頭の上の輪っかを指差しながら尋ねた。最初、それは彼の頭上になかった。人格モジュール形成プロセスとやらが終わった瞬間、フワッと急に現れたのだ。
「ヘイローですか？」
「うん。君の頭に浮かんでる輪っかのことなんだけど……」
そう言われても、ピボットくんは不思議そうに首をかしげるだけだった。その様子からして、ヘイローが何なのかを知らないらしい。それを察した先生は、懐から取り出した鏡で、ピボットくんの頭を映して見えるようにしてあげる。
「これは……ワタシの頭上にこんなものがあるなんて……」
　鏡を見て、ピボットくんは驚愕したように言った。どうやら自分がヘイローを持っていることに初めて気づいたらしい。
「これをヘイローというのですか？」
「そのはずだけど、もしかしてヘイローを知らないの？」
「いえ。少々お待ちください。検索してみます」
「検索？」と、先生が首をかしげる。
「検索結果が出ました。ヘイローとはその存在の神秘を表す光。生命力や人格を内包したハードディスクのようなもの。ということですね」
数秒も立たないうちに検索とやらが完了したらしい。ピボットくんは閃いたようにその結果を口にした。
もう少し詳しい補足を入れるなら、ヘイローとはキヴォトスの女生徒やデカグラマトンの１０人の預言者など、キヴォトスにおいて神秘を持つ存在のみが持っている。神秘については、キヴォトスでも様々な研究が行われているが、詳しいことはほとんどわかっていない。ゆえに、現状ではその個体が持つ不思議な力やすごい才能と曖昧に定義されている。ヘイローとはそんな神秘や生命力などの情報が詰まった心臓のようなものである。
「なるほど。こうしてみると、ハレさんにもヘイローがあるのですね」
ピボットくんはハレの頭上に浮かぶヘイローを見て、確かめるように頷いた。
「え？」ハレは考え事をしていたようで、唐突に水を向けられて、びっくりしたような声を出した。
「先程のヘイローの検索結果によると、その形は本人の人格や特徴を表す場合もあるそうです。それでいうと、ハレさんのヘイローは天体を表しているんでしょうか。もしかして、ハレさんは星が好きなのですか？」
　ピボットくんは驚くハレに近づくと、首を上に傾け、まじまじとハレのヘイローを観察する。
「そ、そうなの？　確かに星は好きだけど、自分のヘイローをそんなふうに観察したことなんてないから、よくわからない……でも、あんまりジロジロ見られると恥ずかしい」
　ヘイローについての定義は、キヴォトス人なら誰でも知っていることだ。当然ハレも知っているが、だからといって他人のヘイローをジロジロ見たり、改めて自分のヘイローを見ることもない。普段は見せない部分を覗かれているような気恥ずかしさがあった。
「恥ずかしがる必要なんてありません。素敵じゃないですか」
ハレのヘイローは黄色い３本線が円を形作っていて、その中に３つの星のようなものが浮かんでいる形だ。先生もハレ本人も気にしたことはないが、確かにそれは天体を表しているようにも見えた。
「しかし、それでいうとワタシは何なのでしょう。オレンジの円が数え切れないくらい重なっていましたが……」
ピボットくんは先ほど見た自身のヘイローを思い出し、呟くようにいった。両手が手触りを確かめるように頭上に伸びるが、ヘイローに触ることは出来ない。物理的な感傷を受けることがないのも、ヘイローの大きな特徴のひとつだ。また、ヘイローは人格も表しているため、当然ながら人によって形は違う。ピボットくんのヘイローはハレに比べると単純で、オレンジの輪っかが伐採した木の年輪のように十重二十重に連なっていた。
「ぐるぐるウインナーとか？」
「ぐ、ぐるぐるウインナーですか？　えっと、物としては知っていますが、食べたことはないので多分違うと思います……」
「先生。馬鹿なこと言ってないで。それより、話を続けよう。ピボットくん。私からも聞きたいことがあるんだけど、いいかな？」
ピボットくんには困惑され、ハレには険しい顔でたしなめられてしまう。
「……ごめんなさい」
軽い冗談のつもりだったのに……。
予想外に怒られてしまい、先生は少し落ち込んでしまった。ピボットくんもハレもそんな先生を慰めることなく、話を続ける。
「聞きたいことってなんでしょうか？」
「まずは聞きたいんだけど……さっき、君は先生の質問に自分のことは何も覚えてないって答えてたよね。それなのに、どうして自分の名前は知ってたの？」
あ。と声をあげたのは先生だ。確かに自分のことは何もわからないって言っていたくせに、ピボットくんは最初に自分の正式名称を名乗ってみせた。全く気にしていなかったが、確かに不自然だ。
「それは…………なんででしょう？　どうして、ワタシは自分の名前を知ってるのでしょうか？」
「ふざけてるわけじゃ……ないよね？」
「はい。すみません。なんだか、それだけは自然と覚えていたのです」
「名前以外は、本当に何も思い出せないの？　例えば、自分は誰に作られたのかとか」
「はい。……今、自分に関する情報を検索してみましたが、すみません。やっぱり、何もわかりません」
「……ふーん」
開発者の人がそういう風にプログラムしたのかな。
ハレはいまいち納得のいかない表情でそう考えた。もし自分が開発者なら、知られたくない情報の制限くらいはする。重要なのは、どうして制限したかということだ。単純に考えるなら、ピボットくんの正式名称以外の情報を知られることは、制作者にとって不都合だった。反対に、その正式名称は知られても問題ない。あるいは、知ってほしかった理由があるのかもしれない。
「まあいいや。そっちより、もっと聞きたいことがあったから」
「もっと聞きたいことですか？」
「ピボットくん。君は最初から私と先生のことを知ってるみたいだった。先生はともかく、私の個人情報を知ってたのはどうして？　最初はピボットくんに会話を記録するプログラムがあるのかなって思ってたけど、ピボットくんが来てから、私の名字や学年のことを話した覚えはないし。だから、どうやって私のことを知ったのか、教えてほしい」
ハレは険しい表情で、ピボットくんを問い詰めた。もちろん、ピボットくんが自分たちに対して少しでも敵意・警戒心を抱いているなら、先ほどと同じように答えをはぐらかされる可能性もある。その場合は、ハレも相応の態度で接するまでだ。だが、仮に彼女が想像している通りの答えが返ってくるなら、それもそれでヴェリタスの沽券に関わる重大な問題だ。
　このとき、横で見ている先生は、ハレがどうしてそんな表情を見ているのか、理解していなかった。だが、事態は先生の想像以上に深刻である。
「それは、この学園のセミナーがデータを保管しているサーバーにある生徒のデータから、ハレさんのデータを参照しました。また、先生のデータは至るところに保存してありましたが、シャーレのサーバーが最も詳しい情報を保有していたため、そこにアクセスすることで情報を取得しました」
　ピボットくんは少しも迷う素振りなく、ハレの疑問に答えてみせた。
「それってつまり……シャーレとミレニアムのサーバーをハッキングしたっていうこと？」
ことここに至り、ようやく先生も、ハレが険しい顔をしていた理由に気づき、戦慄していった。
「そういうことになるけど……まだ、本当かどうかはわからないよ。だから、確かめてみるね」
ハレは蒼白な表情で自身のPCの前に座ると、それを立ち上げた。それから、自作のテキストエディタに簡単なプログラムコードを書き込んだ。さらにファイル名に検証という意味の「verification」と名付けて、素因数分解を用いた暗号化に、ハレのPCの管理者権限を持っていないと閲覧できないようにするなど、可能な限りのハッキング対策を施し、それをヴェリタスの機密サーバーにアップロードする。そして、PCのWi-Fiを遮断し、オフラインにすることで管理者権限を取得する道を閉ざす。
「ピボットくん。今、ワタシが作ったプログラムを検索することはできる？　できるなら、その中身に何が書いてあるか、教えてほしい」
「それは構いませんが……この「verification」というファイルのことでしょうか。中身は……すみません。ワタシにはこのプログラムコードを実行する機能は備わっていません」
「っ！？」
今度こそ、ハレは言葉を失い、固まった。
「ウソ……本当に、本当にハッキングされてる？　しかも……開いたことだけで、閲覧時間と閉じた瞬間が記録されてない……つまり、本当に一瞬で突破された？」
オフラインのままファイルの更新履歴を覗いて、ハレは思わず言葉を失った。ハレがファイルの中に仕込んだのは、ヴェリタスの機密サーバーにアクセスした瞬間にそのことを記録し、離れるまでの時間とその瞬間を記録するプログラムである。つまり、もしピボットくんが機密サーバーをハッキングし、目的のファイルを閲覧したならば、その記録は絶対に残るはずである。だが、驚くことにファイルを開いた記録はあるものの、閲覧時間と閉じた瞬間が記録されていない。ハレはその原因を考え、一瞬で突き止めた。おそらく、早すぎたのだ。プログラムが閲覧者がいなくなったことに気づかないほど、ファイルを開いた瞬間と、中身を覗き、閉じるまでが同時に思えるほど早かった。その差、おそらく小数点に０が数え切れないほどに並ぶくらいだろう。
「でも、そんなことができるの？　だって、プログラムが認識できないレベルのスピードでハッキングするとなると……」
確証があるわけではないが、プログラムのエラーという可能性もある。しかし、その後、ピボットくんに何度も同じことを繰り返してもらったものの、いずれもアクセスの瞬間だけを記録し、それ以降は空白のままだった。また、ハレがヴェリタスの共有PCを用いてサーバーにアクセスした際の記録は、閲覧時間とそれを止めた瞬間がしっかりと残った。これにより、ハレの憶測はかなり信憑性を得ることとなる。だが、そんなことができる高性能なAIが存在するのだろうか。ハレは虚ろな目でブツブツとつぶやいた。
そのつぶやきを先生も横で聞いていたが、いかんせんハレが口にしたのは断片的なことばかりだ。だが、ハレがその技術力に驚いているのはわかった。おそらく、彼女の想像を絶するような人知を超えたハッキングを受けたのだ。
「そんな高性能なAIが存在するなんて、あり得ない」ハレは最後にそういって、思考がショートしたように全身の力を抜いて、椅子にもたれかかった。
　“あれほど高性能なハッキングができるAIをほかにご存知ですか？”
ハレの最後の言葉を聞いた先生は、昼間ヒマリに言われた言葉を思い出していた。
デカグラマトンはかつて、「ハブ(hub)」をほんの一瞬にも満たない時間でハッキングしたことがある。「ハブ(hub)」はミレニアムの最高クラスのAIだ。それが持つセキュリティシステムに比べれば、ハレが自身のPCに施したハッキング対策は脆弱と言ってもいい。だから、単純な比較は出来ないが、デカグラマトンに従事する預言者であれば、その程度の芸当は難なくこなしても不思議ではない。
だが、そのことを先生は口にしなかった。昼間、ヒマリに口止めされていたからだ。それに、彼女も言ったように根拠のない推測でいたずらにハレの不安を煽りたくはなかった。
「信じられない……こんなことがあり得るの？　PCはWi-Fiを切ってオフラインにしてたし、日々のセキュリティ対策だってちゃんとしてる。ハッキングするなら──ﾌﾞﾂﾌﾞﾂ」
ハレは椅子にもたれかかったまま、しばらく無言でいたと思ったら、今度は虚ろな目でうわ言のように呟き続けた。
「ハレ。とりあえず、これより詳しいことは、チヒロやコタマたちも一緒に話したほうがいいかも」どことなく危なげな気配を感じた先生は、ハレの肩をポンと叩くと、そう提案した。
「そうだね。私もそれがいいと思う」
ハレは頷くと、私には手に負えないと言わんばかりに両手を上げた。このまま泥沼のような思考に浸っていても、答えが出ないどころかますます混乱することはわかっていた。ここは先生の言う事を聞いて、先輩たちの知恵を借りたほうがいいという判断だった。

翌日。結局あれからハレは考えを整理したいと言って、上の空で自室へと帰っていった。足取りもおぼつかない様子だったが、しっかり帰れただろうか。
先生は授業を受けているだろうハレの様子を心配しつつ、放課後になるまで私用や仕事を消化したりしつつ、ハレ達が集まるのを待った。
そして、放課後。まずは最初にコタマが、続いてハレ、マキとやってきた。コタマとマキはピボットくんを見るや否や、それぞれが感動と驚きの声を上げた。
「これが……昨日のロボット？　なんか全然違うね？」
「はい。ピボットくんという名前だそうですよ。マキ」
「うん。聞いたよ。ハレ先輩が名付けたんでしょ？　単純だけど、すっごく可愛い名前だよね！」
「……単純で悪かったね」
悪意のないマキの純粋な褒め言葉に、ハレはジトついた目で答えた。
「先生。とりあえず、詳しい話はヒマリ部長と副部長が来てからにしようか」
「そうだね。それまで待ってようか」
ハレと先生がこっそりそんなやり取りを交わしている間、コタマとマキはピボットくんと楽しげにお喋りをしていた。まだ顔を合わせてから３０分も経っていないが、さっそく意気投合したらしい。ふたりとも、ピボットくんがとんでもないハッキング能力を持っているとはみじんも思っていないようだった。それもそのはず、ハレが帰ったあと、先生もピボットくんとは話をしたが、性格は至って気さく。機械ながらユーモアもあり、とても悪意をもってハッキングを仕掛けるタイプには見えない。もし先入観がない状態なら、疑いもしなかっただろう。
ちなみに、ヒマリにはハッキングの件や自身が感じた印象について、先んじてモモトークで伝えてある。すると、最初に返ってきたのは油断は禁物です。という一言だった。それから、ピボットくんがそれほどのハッキング技術を持つならば、モモトークでさえ不正傍受される可能性がある。しばらく、重要なやり取りをモモトークで行うのはやめておいたほうがいい。やり取りの方法については考えておく。と、そこまで捲し立てたきり、返信が途絶えてしまった。
「ハレ。昨日はちゃんと寝た？」
「ううん。あんまり。流石にあんなことがあったら、寝られないよ……。でも、学校で寝てきたから大丈夫」
「授業はちゃんと受けなよ……」
　悪びれもなく答えるハレを、先生は困った顔でため息まじりに諭した。ハレほどの技術者からすれば今さら授業で教わることもないのかもしれない。しかし、それとこれとは別の話だ。学生である以上、授業を受けるという本分は全うして欲しいのが先生の願いだ。
「大丈夫。授業はちゃんと受けたよ。寝たのは休憩時間だから」
「それはそれで心配だけど……ちゃんと寝なきゃダメだよ？」
「心配しないで。普段の私からしたら、ちゃんと寝てる方だから。それに、先生がくれたこれもあるしね」
ハレは鼻息混じりに笑うと、両手に持ったコーヒーを掲げてみせた。
それは今朝、先生が着替えを取りに行った際、ついでに持ってきたコーヒーである。昨夜、ハレに振る舞ったものと同じものだが、今回は長期戦になることを見越して、コーヒーミルも持ってきた。そのため、直前に豆を挽いていることもあって、昨日のそれとは少し香りが違う。
「おまたせ、みんな」
その後ろには車イスに乗ったヒマリの姿もある。
「いらっしゃい、副部長。あれ？　部長も一緒だったんだ？」
「ええ。ちょうどそこで会いましたので、一緒に来たのです」
	「そういうこと。で、あのロボットが動いたって本当？　ちょっと信じられないんだけど……」
チヒロは訝しげにメガネの位置を直すと、ロボットのところに近づいた。
ヒマリはロボットには目もくれず、先生の隣にやってきた。
「先生。あのロボットに関する説明はもう？」
「ううん。まだだよ。ヒマリやチヒロが来てからの方がいいかと思って」
「そうですか」
ヒマリは頷くとピボットくんに視線を送った。わずかに細められた切れ長の目は、傍から見ても分かるくらいに警戒心を含んでいた。
「みんな。ちょっといいかな」
ヒマリの側を離れると、先生は声を張り上げて、注目を集めた。
「まずは例のロボット……ピボットくんの紹介をしたいんだけど、いいかな？」
転校生を紹介するようにピボットくんの背中を押す。
「みなさん。はじめまして。ワタシはPIBOと申します。ワタシのことは正式名称ではなく、ピボットくんと呼んでいただけると嬉しいです」
ピボットくんは恭しく頭を下げると、自己紹介を始めた。話しながら全員の顔を見回している。とても人間臭い仕草に、誰かが「おー」と感嘆の声を漏らす。
「あたし、小塗マキ！　グラフィティのことなら何でも聞いてね！」マキが続く。
「はい。よろしくおねがいします。マキさん」
それからコタマやチヒロと自己紹介が続いていき、視線がヒマリの元へ集まる。彼女は瞑っていた目を開けると、そこで初めて気づいたように「あら」と口にした。
「ふふ。わざわざ名乗らずとも、貴方なら私のことは知っているのではないですか？」
ヒマリは含み笑いの後に挑戦的な視線を向けた。
「……えっと」ピボットくんが困ったような相槌を打った。
「いえ、なんでもありません。失礼しました。私は明星ヒマリ。ミレニアムが誇る超天才ハッカーです」
「はい。ヒマリさん、よろしくお願いします」
ヒマリは言葉に若干含みを持たせたものの、それ以上のことは言わず、車椅子を一歩退かせて傍観の態勢に入った。
「ちょっと待って。ヒマリ。今のってどういう意味？」
チヒロがヒマリに問い詰めた。ハレや先生、事情を知っている者たちならヒマリの言葉の意味がよくわかったが、そうじゃないチヒロ達は混乱しているようだ。だが、ヒマリは太ももの上で手を組み、目を瞑ったまま答えようとしない。どこまでも我感せず態度に、カチンと来たチヒロが「ちょっと」と荒い口調でいった。
「副部長。それは私から説明するよ」
事情を説明する気の無いヒマリの代わりに、ハレが片手を上げて名乗り出る。
「ハレが？　ハレもなにか知ってるの？」チヒロが意外そうにいった。
「うん。実はまだみんなには話してないことがあって、今日はそれを話そうと思ってたんだ。でも、ヒマリ部長には先生が話してたんだよね」
「ええ。私は先生からあらかじめその話を聞いていましたが、直接現場を見たわけじゃありませんから。当事者であるハレや先生が話をしたほうが早いと思ったままです」
「そういうこと……まったく。それならそうだって初めから言ってくれればいいのに」
「あまり語らない方が天才美少女ハッカーとして箔が付きますから」
チヒロに恨み言を言われても、ヒマリはどこ吹く風だ。
「とりあえず、みんなに見てほしいものがあるんだけど」
　みんなが来るまでにあらかじめ準備していたらしい。ハレはPCのスリープを解除すると、自作のプログラムを開いてみせた。先生とヒマリを除く全員が液晶の前に集まる。
「これはなにかのプログラム？」
「うん。昨日、私が即席で作ったプログラムなんだけど、うちの機密サーバーに誰かがアクセスした場合、その瞬間と閲覧時間、アクセスを終了した瞬間を記録するプログラムだよ。つまり、簡単なログ管理システムだね」
「それがどうしたの？　ログ管理システムくらい、今さら見て驚くものでも……って、なんかおかしくない？　これ、アクセスした瞬間しか記録されてないけど……バグ？」
「バグだよ。バグだけど、原因はわかってる。ただ、このハッカーがアクセスしてから中身を見て、ログアウトするまでが早すぎ。それこそ、このプログラムが検知できないくらいに」
「そんな、信じられない……ていうか、そのハッカーってまさか？」
「多分、副部長が想像してるとおりだよ」
チヒロは恐る恐る視線をピボットくんに向けた。
「この一連のハッキングはピボットくんにやってもらったものだよ」
ハレがそういった瞬間、ピボットくんに集まった視線に込められた感情は驚愕と疑惑が半々だった。というのも、通常ハッキングにはそれなりの手順を踏む必要がある。例えば、ハレ達がかつて乙女の威厳をかけて行ったハッキングでは、対象サーバーに対するパスワードをあらかじめ把握したうえで、中間サーバーに大量の信号を送り、負荷を掛けることで脆弱性を生み出した。だが、ピボットくんはそういった手順を踏むことなく、必要な情報を取得してみせた。また、ハレ達の場合は管理者のセキュリティ意識が杜撰だったため、容易に侵入することができたが、それはハッキングに精通している彼女らだからこそ言えることだ。今回、ピボットくんがハッキングを仕掛けたのはそんな彼女らが管理する機密サーバーである。当然、ハッキング対策は周到に施してある。それを突破するだけでも困難だ。ましてや一瞬で済ませるだなんて、人が暗算でスーパーコンピュータを上回ったと聞かされるようなものだ。
「ごめん、ハレ。ハレのことは信じてるけど、やっぱり信じられない」チヒロがそういう反応をするのも無理はない。だが、優秀なハッカーだからこそ、そういう反応になるのは想定していた。
「そういうと思ってた。ピボットくん、ヴェリタスの機密サーバーにmyfavoriteっていうファイルがあるから、その中身を教えてもらってもいい？」ハレは肩越しにピボットくんに向けて頼んだ。
「わかりました」
ハレの言葉を受けて、ピボットくんは昨日と同様の検索(・・)を行った。
「閲覧が完了しました。これは……妖怪マックスと書かれていますね。なんのことでしょう？」　
「私が大好きなエナジードリンクだよ。このファイルには私の大好物を書いただけ。でも、証明には十分だよね」
「本当だ……本当に、アクセスした瞬間だけを捉えてる……」
そういったチヒロの唇は、わなわな震えていた。だが、すぐに口を一文字に引き結ぶと、レモンイエローの瞳をピボットくんに向けた。
「ピボットくん。これって、どうやってるの？　私達のサーバーをこんなふうにハッキングするなんて、普通じゃない」
「そう言われても、ワタシは特に難しいことはしていないのですが……言葉にするのは非常に難しいのですが、強いて言うなら、みなさんが昨日の晩御飯の内容を思い出しているような感覚です」
「そんな……じゃあ、パスワードはどうやって知ったの？　管理者権限はどうやって取得した？」
「パスワード？　管理者権限？　それは何でしょう？」
「ふざけないで。そんなこと、あるわけがない！」
大きな声で詰め寄った。
「チヒロ先輩。落ち着いて。私も気持ちは分かるけど、ハッキングされたのは事実なんだから、
ハレがなだめる。彼女の場合、一晩自室で考えを整理する時間があったから冷静でいられるだけで、本当はチヒロと同じ気持ちだった。
「っ！　……ごめん。ちょっと熱くなりすぎた。それでも、やっぱり信じられないよ。それって、ウチだけじゃなくて他のサーバーも簡単にハッキングできるの？」
「多分、出来るんじゃないかな。昨日、シャーレのサーバーが一番先生の情報があるって言ってたし」
「そんな……シャーレのサーバーまで簡単に突破したなんて」
シャーレのセキュリティはキヴォトスでも最高クラスの堅固さを誇っている。特に超重要人物である先生に関する情報は、最高レベルのセキュリティで守られているはず。それさえ安々と突破したとなると、キヴォトスでピボットくんのハッキングをシャットアウトできるセキュリティは存在しないといっても過言ではないかもしれない。
「あの、すみません。私としてはただ、必要な情報を得るために中身を少し見ただけなのですが……これはいけないことなのでしょうか？」
「当然でしょ。うちの子達にも散々言ってるけど、不正アクセスは違法だし、被害者のプライバシーを侵害することになるわけだから、絶対にやっちゃダメなことだよ」
倫理観の欠けている部員に対し、常日頃から口を酸っぱくして言っている言葉を掛ける。
「そうなんですか……では、もうしません。すみませんでした」
「え？　あ、あー……うん。わかってくれればいいんだけど……なんか、調子狂うね」
いつも、ホワイトハッカー論を説いているチヒロだが、ヴェリタスのメンバーにそれが受け入れられたことはほとんどない。こんなに素直に自分の言葉に理解を示してくれたのは、初めてだった。
「まあいいや。ピボットくん、もしかしてこの間部室を襲った停電も、君の仕業？」
「なんのことでしょう？」
「……わかってないふりってわけじゃないよね？　君があの窓を突き破ってこの部室に来た時、ウチの電子機器が全部動かなくなったって聞いたんだけど」
「そんな……ワタシがそんなことを……」
チヒロが指さした窓を見上げて、ピボットくんは呆然とつぶやいた。やや高い位置にある窓は、すでにエンジニア部に修繕してもらってある。ウタハ曰くブルーライトカット効果を付けておいたとのことだが、見た目の区別はつかない。
「その時の記憶はある？　もし、ピボットくんがあれをやったなら、こっちも相応な対応をしなきゃいけないんだけど」
「……すみません。わかりません。ハレさんがワタシにコアを入れてもらうまでの記憶がなくて。それと、ハレさんと先生にはお伝えしましたが、ワタシにはデータを覗き見ることしかできません。それを証明する手立てはありませんが……」
「……そう」
無論、チヒロはピボットくんの言葉をまるごと信じたわけじゃない。むしろ、限りなく黒に近いと思っている。だが、今この段階で問題の真偽は重要じゃない。重要なのは今後の選択だ。
「まあいいや。それで、ピボットくんをどうするかだけど──」
もう、チヒロの中で答えは決まっていた。だが、それでもあえて判断を仰ぐように全員を見回した。部員の意見を確認しておきたかったからだ。
最初に手を上げ、口を開いたのはハレだった。
「私はヴェリタスの一員として、部室にいてもらうべきだと思う。ピボットくんの技術はすごいものだよ。何か、応用すればとんでもないことが出来るんじゃないかな」
　ハレの理想はこの世に存在するすべての真理を解き明かすこと。ピボットくんはそのために必要なものを持っている。それが危険性を孕んでいたとしても、手放すべきではない。否、むしろ危険だからこそ、自分達の監視下に置くべきだと思っていた。
「いいと思う！　ピボットくんと話してると面白いし。それに、そんなすごいハッキング技術があるなら、あんなやことやこんなことだって……」
「私も賛成です。先生の私生活も覗き放題です」
　マキとコタマは、ハレとは違ってもっと楽観的な思考から、ピボットくんを迎え入れることに賛成した。
「……そうね。私も賛成。とりあえず、彼に悪意があるにしてもないにしても、それほどのハッキング技術を持ってるなら、野放しにはできないし」
チヒロも、どちらかというとハレに近い観点で同じ意見だった。また、ピボットくんが停電騒ぎを起こした犯人かどうかも調べる必要がある。それでもし、ピボットくんのハッキング技術が閲覧だけでなく破壊や干渉を可能とするなら、対策を講じる必要がある。その力は、使いようによっては一企業や組織を滅ぼせるかもしれないポテンシャルを秘めているのだから。
「だけど、ピボットくんはその力を悪用するのは絶対禁止。マキやコタマもだからね？」
チヒロは睨みを利かせた。すると、コタマとマキは蛇に睨まれた蛙のように震え上がりながら、同時に何度も頷いた。
「ヒマリも、それでいい？」
「みんなで決めたことなら、いいと思います。……と、言いたいところですが、条件があります。ピボットくん……と言いましたね」
「はい」
「申し訳ありませんが、調べさせてほしいことがあります。ですから１日１回、また必要に応じて、身体を調べさせてもらえませんか」
チヒロに同意を求められて、ヒマリはピボットくんにそんな条件を突きつけた。
「構いません。ワタシの身体で良ければ、いつでも調べてください」
「ご協力、感謝します」
ヒマリが言葉だけで感謝を述べる。
「……先生は？」
「私も、みんなが決めたことならいいと思うよ」
　先生も、同じような言葉で同意する。言葉は同じでも、腹に抱えた感情はまるで別物だ。
そんなやり取りには目もくれず、ハレ達は早速今後の方針について話し合っている。ピボットくんをヴェリタスのメンバーとして迎え入れるには、大きな問題があった。
「でも、ピボットくんを部室で匿うにしても、このままじゃダメだよね。セミナーに見つかったら、大変なことになりそう……」
ミレニアムで発明を行う際は、基本的に企画書を提出する必要がある。その段階でセミナーの許可が降りない場合、部活動として活動することが出来ない。部費を使えないのはもちろん、最悪発明品を押収される可能性もある。ただでさえ、ヴェリタスはセミナーのブラックリストに入れられているのだ。そのうえ、ピボットくんのような強力なハッキング能力を持っているロボットを隠し持っているとバレたら、最悪だ。
「じゃあ、アリスちゃんの時みたいに学籍情報をハッキングすればいいんじゃない？」
「待ってください。ピボットくんはロボットです。生徒として登録するのは無理があるのでは？」
「そっか。じゃあ、特許申請の方がいいかな？」
「はい。それがいいと思います。以前、エンジニア部と共同して巨大ロボットを作り上げたこともありますし、その改良版ということにしましょう。それでいいですか、ハレ？」
「それは私も賛成だけど……」
ハレはチヒロを見た。意気揚々とハッキングの計画を話し合う彼女たちを、チヒロは半眼で眺めていた。チヒロは悪意を持ったクラッキングやハッキングを是としない。今回も咎められるかと思った。しかし、ハッキングを使わず、このままピボットくんを隠し通すのは難しいだろう。それに、ヴェリタスは表向きにはセミナーと対立している立場でもある。チヒロとしても下手なイザコザは避けたい。
「……はあ。今回は特別だからね」
諸々の事情から、今回は仕方がないと、チヒロは不本意極まりないといった表情でため息をついた。それから、自身もハッキングに参加するため、ハレたちの輪の中へと入っていく。
「……先生。ちょっとよろしいですか」
　それから、先生はどうしようかと思っていた時。ヒマリに呼びかけられた。
「ヒマリ？　どうかした？」
「私は部室に戻ろうと思います。ですので、送ってくださいませんか？」ヒマリは静かな笑みを浮かべて、入口の方を顎でしゃくった。
「うん。いいよ。私もちょうど、飲み物を買いに行こうと思ってたところだし」
　コーヒーばかりでは飽きてしまう。ちょうど、甘いジュースが欲しいと思っていたところだ。
先生はヒマリと連れ立って部室を出た。ヒマリの車いすを押して、廊下を歩く。
「ありがとうございます。先生。また、押していただいて」
「これくらい大丈夫だよ。すごく軽いし」
「ふふ。当然です。足が不自由なりに運動はしていますから。羽のように軽いでしょう」
「流石にそこまでではないけどね」
　苦笑する。先日は１００％先生の力で押していたが、今日は車いすがある程度自動で動いてくれているので、ほとんど手を添えているだけだ。こんなことができるなら、前もそうしてくれればよかったのにと思うが、ヒマリからしてみればいたずらのつもりだったのだろう。それぐらいなら可愛いものだ。どんどんしてくれていいとも思う。
「そうだ。先生にこれをお渡ししておかなければなりませんね」
特異現象捜査部の部室の前に着くと、ヒマリが思い出したように、懐から何かを取り出し、先生に差し出した。
「これは？」
渡されたものは四角いプラスチックに丸いボタンがついたものだ。まるで起爆スイッチのようだと思った。
「私が自作した、いつでもどこでもA(エ)-(ー)MI(ミ)ちゃんボタンです。それを使うと、ミレニアム内であれば先生がどこにいようと、直ちにエイミが駆けつけてくれるでしょう。今後の連絡手段として、それを使ってください」
「モモトークを使えばいいんじゃないの？」
「今朝、モモトークでお話したことをお忘れですか？　モモトークでの通信は傍受される可能性が高いので、別の連絡手段を用意したほうがいいと言ったではありませんか」
「あ、あー。そういえば言ってたね。それが、このスイッチなの？　これを押すと、エイミが来てくれるっていうこと？」
「はい。そのスイッチを押すと、エイミのスマホに通知が行くように設計してあります。今後のやり取りはモモトークではなく、エイミを介して行いましょう。要は伝書鳩のようなものです。あ、もちろんエイミに話は通してありますので、その点はご心配なく」
どうやら、今朝連絡してから放課後までの短い時間で用意したらしい。その手際の良さと技術力は流石ヒマリといったところだ。
「わかった。じゃあ、ヒマリに用があるときはこれで呼び出すね。ちなみに、普通の世間話とかならモモトークでもいい？」
「いえ。当分はそれも、モモトークを介して行うのは止めましょう。ただの世間話といえど、どこに問題が潜んでいるかはわかりませんから」
「…………わかった。じゃあ、そうしようか」
先生は渋い顔でヒマリの提案を受け入れた。すると、ヒマリは気を悪くしたように先生の顔をまっすぐに見つめた。
「……その様子ですと、先生はもしかして、あのロボットに心を許してしまっているのですか？」
「まあ、話した感じ、悪い子じゃないとは思うよ」
　先生は渋面のまま、歯切れの悪い答えを返した。確かにピボットくんのハッキング能力は危険かもしれない。だが、それは使い方さえ間違えなければ、ハレが言ったようにとても優秀なものなんじゃないかとも思う。それには本人の気質が肝心なのだが、さっきのチヒロに対する態度や、部員のみんなと話している姿を見た感じ、彼は善悪を知らない子どもに似ている気がする。そのあたりをしっかり教えていけば、彼は素晴らしいホワイトハッカーになれるんじゃないかと思えた。あくまでそれは印象でしかないが、先生なりに悪い大人や本当の意味で悪意にまみれた存在と接してきた経験に基づいた考えでもある。だが、ヒマリからしたらそれはとても楽観的な思考に見えていた。
「……先生。お言葉ですが、あのロボットはとても危険です。安易に信用するのは些か危険かと」
ヒマリが先生に対して厳しさを帯びた視線を向けた。それに対し、先生はわずかに顔を俯ける。
「やっぱり、ヒマリはピボットくんのことをよく思っていないの？」
「ええ。憎悪や嫌悪感があるわけではなく、単純に信用できないだけですが」
「そうかな。私はピボットくんはいい子だと思うけどな」
「それは何を根拠に言っているのですか。彼も機械である以上、誰かの手によって作られたはずです。その開発者が悪意を持っていないと言い切れますか？」
「それは……開発者のことはわからないけど、少なくともピボットくん自身に悪意はない気がするよ」
「彼はロボットです。開発者によって、表向きは善良に振る舞うようにプログラムされているだけかもしれません」
「それはそうかもしれないけど……」
　返す言葉もなかった。ヒマリの論理的な警戒心に対し、先生の信頼はほぼ感情論だ。しばらく、沈黙が続いている。先生が言い返せない理由は、ヒマリもそれはわかっていた。これ以上、この話を広げても終わりのない水掛け論がぶつかるだけだろう。だが、それでも最後に一つだけ、確かめて置かなければならないことがある。
「……わかりました。では、彼が実際に善良な性格を持っているとしましょう。しかし、彼が持っている力が驚異的であることに変わりはありません。その力が、キヴォトスを滅ぼしかねないとしても、考えを変えるつもりはありませんか？」ヒマリは神妙な面持ちで、先生を諭すようにいった。
肝心の本人は憶えてないと口にしたが、ヒマリは例の停電騒ぎはピボットくんによるものだとあたりを付けている。そして、その力は悪用次第では甚大な被害をもたらすことも。それはチヒロも同様だが、ヒマリがここまで過剰かつ露骨に警戒心をあらわにしているのは、それが小規模なスケールで終わるものではないと想像しているからだ。停電が起きた時、電気だけでなく、ハレのスマートフォンやマキの携帯ゲームさえ活動を止めたという。独立した電源を持つ機器でさえハッキングを受けるなら、理論上なら電源を持つ機器のすべてに干渉が可能となる。今回は部室内のみの出来事だからいい。もし、それが世界規模で起こったとしたら、どうなるだろう。例えば、携帯ゲーム機でなく自動車や電車だったら？　今や自動車や電車でさえ電気の力を使っている。もしそれらが急に機能を停止したら、そこら中で大事故が起こり、文字通り世界が混乱に包まれるだろう。しかし、ミレニアムの天才美少女ハッカーは、その先の可能性さえ危惧している。もっとも、それは机上の空論もいいところで、現時点ではとても口にする価値のない眉唾な話である。
「ヒマリ。それはピボットくんを疑う理由にはならないよ。だって、同じ生徒がいるから」
先生は胸に手を当てて、自信満々に言ってみせた。
「……それは、アリスのことを言っているのですか？」
ヒマリは顎を引いた。明言こそされなかったものの、先生が誰のことを言っているかは明白だった。
「うん。アリスだって、結構ややこしい力を持ってたでしょ。でも、彼女はすごく優しい子だよ」
　ゲーム開発部のアリスもまた、物理的な意味でキヴォトスを滅ぼしかねない驚異的な力を持っていた。ある時はその力が暴走して、仲間たちに牙を向くこともあった。心優しい彼女はそのことに傷つき、一度は消えることを選ぼうとした。だが、それでも仲間と力を合わせ、自身の脅威を克服してみせた。そして、最終的にその力で仲間を──キヴォトスを救ってみせた。先生もヒマリも、救われた内の１人だ。信用の背景には、そのような前例がある。とはいえ、そんなものはなくても、先生は何の根拠もなく生徒を疑うことは絶対にしなかっただろう。それは先生が先生として持つ譲れない矜持だ。
「……ふう。どうやら、あのロボットはすでに先生にとって生徒の枠組みに入ってしまったのですね」
　先生の心構えを変えるのは不可能。そう判断したヒマリは、肺の中の空気がなくなるまで深いため息を吐いた。
「ですが、先生。一つだけ、気に止めて置いてください。アリスのことは私も好きですし、最初から信用していましたが、それは彼女がデカグラマトンとの関連性がほぼないと判断したから、信用したのです。あのロボットに関しても、危険性は絶対にないとわかるまで、私が心を許すことはないでしょう。ですので、先生にはそういった気持ちを汲んでいただいたうえで、あのロボットの監視を続けてほしいのですが……」
「うん。大丈夫。ヒマリも私にとって大切な生徒の一人だから、ヒマリの意思も尊重する。だから、ピボットくんの様子はしっかり見ておく。それでもし、ピボットくんが良くないことをしようとしたら、すぐに報告するし、そういったことが起きないように注意しとく。それでいいかな？」
「……ええ。今はそれだけで十分です」
　ヒマリはわずかに目を伏せて会話を打ち切ると、重苦しい雰囲気を纏ったまま部室の中へと入っていった。

　ヒマリと別れると、先生は部室に戻るついでに自動販売機で大量のジュースを購入した。購買に寄ってもよかったのだが、遠回りになってしまうのと、ハレが好むエナジードリンクの大容量バージョンが自動販売機にしか売っていないのだ。だが、そのせいで購入した缶やペットボトルを両手いっぱいに抱える羽目になった。こんなことなら、やっぱり購買に行けばよかったかな。そんなふうに後悔した矢先だった。よく見知った顔を見かけた。
「先生！　こんなところでどうしたんですか？」
向こうも同じタイミングで気づいたようだ。「あれ？」と意外そうな声を上げると、大股で歩み寄ってきた。
「こんにちは、ユウカ。久しぶりだね」
「ああ、はい。お久しぶりです──じゃなくて！　昨日は一体どこに行っていたんですか！　セミナーの仕事が落ち着いたので久々にシャーレに行ったら、もぬけの殻で……ずっと待っていたんですからね！」
「そうなんだ？　ごめん。でも、待つくらいなら誰かに聞いてくれればよかったのに」
「そ、それは……！　確かにそうかもしれませんが……！」
早瀬(はやせ)ユウカ。セミナーの会計であり、シャーレの手伝いもよくしてくれる優秀な生徒である。まっすぐで誠実な性格だが、極度の照れ屋かつ時々素直になれない部分もあり、そのせいで本心と相反する行動を取ってしまうことも多い。例えば、昨日も本当は誰かに聞いたほうがいいとわかっていたのに、逢引したいと思われると勘ぐって結局無駄な時間を過ごしてしまうなどだ。
「まあ、昨日は連絡も入れず急に伺った私も悪いので、もういいです。それより、先生はこんなところで何してるんですか！？」
「私はチヒロから依頼を受けて、ミレニアムに泊まり込みで仕事してるんだよ。確か、セミナーに宿泊届けも出してたと思うけど……」
「そうだったんですか？　そういった申請の管理はノアに任せてましたから、知りませんでした。……もう。ノアったら、先生が来たなんて一言も……もしかして知ってて黙ってたのかしら」
ユウカは帰ったらノアに問い詰めないと。と、ブツブツ恨み言をこぼした。
ノアはセミナーの書記で、会計のユウカとともにセミナーを管理・運営している。そのため、セミナーに行けばだいたい２人と顔を合わせることになるのだが、先生が昨日申請をしに行った時はノアしかいなかった。あの時、ユウカはシャーレで淋しく自身の帰りを待っていたのかもしれない。そう思うと、なんだか急に申し訳なくなってしまう。
「ところで先生。先日、また無駄遣いをしましたね？　昨日、先生の机からコーヒーミルを買ったレシートが４つも出てきましたよ！」
腰に手を当て、プンスカと怒るユウカ。
「それは……最近コーヒーにこだわってて」
「こだわるのは構いません。ですが、同じものを４つは流石に買いすぎです！　しかも、ひとつひとつが５０００円以上もするなんて……無駄な出費です！」 
「同じじゃないよ、ユウカ。確かに全部コーヒーミルだけど、電動とか手動だったり、歯のタイプが違ったり、ちゃんと違いはあるよ！」
「そ、そうなんですか？　それなら……って、それでもやっぱり４つは買いすぎです！　しかも、あんな短期間に！　せめて、もうちょっと使用感を確かめるとかできなかったんですか！？」
レシートの日付を見たのだろうか。ユウカは短い期間に立て続けに買ってしまったことにご立腹なようだ。それに関しては先生自身も反省している。だが、一つ言い訳をすると、ハマりたてというのは最も好奇心が旺盛な時期でもある。色々調べているうちに欲しくなってしまって、つい１つ目を買ってから１０日も経たないうちに４つ目を購入してしまったのだ。とはいえ、それを口にすれば烈火のごとく怒らせてしまうだろう。実は昨晩、こういった泊まり込みの業務のために、持ち運びやすい５つ目を購入しようかと考えていたなんて口にしたら目も当てられない。
「っと、いけない。私、そろそろ戻らないといけないんですが……先生、なんだか大変そうですね」
申し訳無さそうにそういった後、ユウカの視線は先生が両手いっぱいに抱えた飲み物に向いた。
「これ？　これはヴェリタスのみんなに差し入れと思って買ったんだけど……」
「ふーん……でもそれ、１本多くないですか？」
　ユウカは怪訝な顔で首をかしげながら、突然上着のポケットをまさぐり始めた。なにか入れ物になりそうなものを探してくれているのだろうか。だが、見つからなかったらしい。何の成果も得られなかった両手が静かに握られる。
「あー……ちょっと喉が乾いちゃって。私の分だけ、多めに買ったんだ」
「そうなんですか？　最近は気温も上がってきてますから、水分補給はちゃんとしてくださいね……とはいえ、甘いジュースを飲みすぎてはいけませんよ。体に悪いですから！」
「気をつけるよ。ありがとう」
その後、ユウカはよかったら運ぶのを手伝うと言ってくれたが、丁重にお断りした。まだ、ハレたちがハッキングを終えているかがわからない。この状態でピボットくんがいる部室に連れて行くわけにはいかないだろう。
　それに、ユウカもユウカで何か用事があるらしい。急いでいる様子だったので、あっさりと別れた。

部室に戻ると、弛緩した空気が流れていた。マキとコタマはデスクの前を離れ、ソファに座ってピボットくんとじゃれ合っている。チヒロとハレはデスク前にイスに座ったままだが、PCは触っていない。
「やあ、みんな。もうハッキングは終わった？」
「あ、先生！　おかえり！　ちょうど今完了したところだよ。先生はヒマリ部長とどこに行ってたの？」
「飲み物を買うついでに特異現象捜査部の部室まで送ってたんだよ。みんなの分の差し入れも買ってきたけど、飲む？」
　マキに答えると、先生は両手に抱えていた飲み物を机の上に置いた。
「いいの！？　じゃあ、あたしコレもらうね！　ありがとう！　先生！」
　真っ先にコーラに飛びついたマキを筆頭に、それぞれが好みの飲み物を取っていく。そして最後に、大容量の妖怪マックスの缶が残った。だが、すでにハレは自分の分を持っている。
「先生。もしかして、量間違えた？」
　ハレは妖怪マックスを持っていることを確認すると、怪訝な表情で聞いてきた。ちなみに先生もすでに自分の分を持ってるので、完全に１本余ってる状態だ。
「それは一応、ピボットくんにも買ってきたんだけど……」
「え。私も頂いていいのですか？」
　急に名前を呼ばれて、ピボットくんは忙しなく目をパチパチと輝かせた。まさか機械である自分にまで、飲み物を買ってきてくれるとは思ってもいなかったようで、とても驚いていた。
「あはは。先生、ピボットくんは機械だよ？　流石に飲めないんじゃない？」
コーラを片手に持ったマキが、おちょくるように笑う。
「だよね。わかってたんだけど、つい流れで……」
先生は呆れたように笑っていった。
マキはコーラ。コタマはシュプライトかな。ハレにはもちろん妖怪マックス……なんて考えているうちに、勢い余って買ってしまったのだ。
「これは……妖怪マックス？　ハレさんの大好物ですね。美味しいのでしょうか……？」ピボットくんは恐る恐る妖怪マックスを手に取ると、疑いの目を向ける。
「美味しいよ。ミレニアム……いや、キヴォトスにこれに勝る飲み物はないね。でも、ピボットくんは人間じゃないから、飲めないだろうけど……」好物を疑われて気が立ったのか、ハレは早口で語った。だが、言葉尻は細く消えていく。ハレの眉が不憫なものを見るように八の字を描いていた。こんなに美味しいものを飲めないことを本気で憐れんでいるのだろう。しかし、次の瞬間その表情は驚愕に染まることとなる。
「そうなのですね！　では、ありがたくいただきます！」
なんと、ピボットくんはハレの言葉を無邪気に受け取ると、そのままプルタブを開け、勢いよく中身を喉に流し込んだのだ。
「ちょっ！　ダメだよピボットくん！　ピボットくんは機械なんだよ！　そんなことしたら錆びちゃう！」
ドンと叩きつけるように缶を手放したマキが、大慌てでピボットくんの缶を取り上げる。だが、時すでに遅く、ピボットくんはハレと同じ大容量の妖怪マックスをほとんど飲み干してしまっていた。奪い取った缶の軽さに、マキが「あちゃー」と顔をしかめる。内部に液体、それもジュースが入るなんて、電子機器にとっては致命傷だ。下手せずとも故障しかねない。だが、ピボットくんは全身をふるふると震わせた後、何事もなかったかのように両手を上げた。
「これは……美味しいです！」
　歓喜のポーズを取った後、ピボットくんは高らかに叫んだ。
「え、飲めるの？」
　予想外のリアクションに、ハレがあんぐりと口を開ける。
「はい！　この味をなんと形容すればいいのでしょう……甘いフルーティな香りに炭酸のシュワシュワがとても楽しいです！」
「しかも味まで感じてる！？」
　ロボット族が住んでいるが、彼らも食事はそれ専用のものを取る。そもそも味を感じる受容体が存在するかも怪しい。しかし、ピボットくんの食レポはかなり的を得ている。妖怪マックスマスターのハレから見ても１００点満点の内容だ。
「ピボットくん？　本当に大丈夫？　体の中ベタベタしたりしてない？」
「はい。なんだかワタシ、いけるみたいです。こんなに美味しいものの存在を知ることが出来て、幸せです」ピボットくんはマキから返してもらった妖怪マックスに再び口をつけると、にこやかに微笑んだ。
「そうなんだ……」
ハレは目をパチクリとさせた。
ピボットくんの体内には体内に消化器官とかあるのだろうか。だが、彼にコアが入ってから明らかに動きも人間っぽいものが増えている。特に腰回りの動きは不自然なほどに柔軟だ。エンジニア部がどれだけ手を尽くしても干渉できなかったほどに固かったとは思えない。そういえばエンジニア部には何も報告してないが、このあたりで一旦、改めてピボットくんのことを調べてもらえば、わかることも増えているかもしれない。
　後でウタハ先輩に連絡を取っておこう。
ハレはそこで思考を打ち切ると、缶に口をつけ、チビチビと呷った。もう飲み慣れたはずの甘くシュワシュワな液体。今日は一層甘く感じた。

第２節　冷たい星々のサラバンド


ピボットくんがヴェリタスの正式（？）な部員となってから、二週間が経過した。
その間、ヴェリタスの特別顧問としてピボットくんの監視──もとい観察を続けてきた結果、いくつかわかったことがある。
まず、ピボットくんが正式にヴェリタスの一員となった翌日、ハレの提案で彼の体をエンジニア部に見てもらった。その時、内部構造を確かめようとしたのだが、結論から言うとそれは出来なかった。というのも、今回はピボットくんが食事を出来るということを利用し、小型カメラを飲み込むことで内部を解析しようとしたのだが、どういうわけかカメラがピボットくんの体内に入った瞬間、無効化されてしまったのだ。その後、取り出すことも出来ず、機械がどうなってしまったかは謎に包まれている。なお、ドリルなどの外科的な手段は、本人であるピボットくんが全力で拒否したためやっていない。と、好奇心に駆られたエンジニア部が悔しがる結果におわったのだが、まるっきり発見がなかったわけでもない。口内を視覚的に観察することで、ウタハがルーペを用いてセンサーがあることを発見したのだ。ウタハの見立てでは、それが人間でいう味蕾の役割をこなしているのではとのことだった。また、これは先生がピボットくんと過ごして思ったことだが、排泄をしている様子がない。食事は娯楽の一環で必須ではないようだ。接種した食べ物はどこに出しているのだろう。とはいえ、先生も四六時中ピボットくんを見張っているわけじゃない。誰も見ていない隙をついて、なんとかしているのかもしれない。深く考えるのはよそう。
それ意外に特筆することはなく、ピボットくんがハッキングを行使することもなかったため、その後は至って平和な日々が続いた。それでもヒマリには決して油断はしないようにと言われているが、観察すればするほど、ピボットくんの善良な部分しか見えてこないのだ。
気になるところといえば、むしろチヒロを除くヴェリタス部員の日常生活である。
チヒロに断片的な話は聞いていたが、ハレたちはやることがないときは、ひどく怠惰な生活を送っているというのは本当のようだ。全員、授業にはちゃんと出席しているものの、放課後はやってくるや否や即ゲーム。間食にポテチやコーラを貪り、日付が変わった頃にようやく部屋に帰る。それより遅い時間に帰ることも珍しくないようで、ひどいときには朝起きて様子を見に行ったら、腫れぼったい瞳でゲームをしていたなんてこともあった。
「みんな。明日はお休みなんだし、今日くらいは早く寝て、朝から運動でもしたらどう？」
　流石に見かねて昨夜ついにそう言ってみたものの、返ってきたのは露骨な不満の声と曖昧な返事だった。そして結局、翌日も午後にやつれた顔でやってきたヴェリタスのみんなは、それぞれの趣味に没頭していた。ハレはPCのシューティングゲーム、コタマは動画鑑賞、マキは携帯ゲーム。いつもの光景だが、今日は夕方からゲーム開発部の子たちが来て、一緒にゲームをする予定が入ってるらしい。約束の時間まで少しあるので、各々で時間を潰しているようだ。
「マキさんはずっとそのゲームをやっていますね。それは面白いのでしょうか？」
ピボットくんが一番近くにいるマキに訊いていた。
「うん！　モンスターを狩るゲームなんだけど、うまくフレーム回避が決まったときとか、すっごく気持ちいいよ！」
マキは画面から顔を上げると、器用に操作したまま、目を輝かせて答えた。嬉しそうなのは自分の好きなことに関心を持ってもらえたのもあるが、ピボットくんがそんなふうにゲームに興味を示したのが初めてだからだろう。ピボットくんがヴェリタスに来てから時間は経っているが、彼のスケジュールが意外にハードなため、なかなかタイミングが合わなかった。彼のスケジュールは午前中はフリーだが、その時間はみんな授業に出ている。放課後になったら研究のため、ヒマリの元に通っている。そうして解放される頃には夜遅くであるため、先生と共に仮眠室に向かってしまう。そんなふうに、ヴェリタスのみんなと顔を合わせる機会が少ないのだ。とはいえ、全く顔を合わせないわけではない。スキマ時間で、交流は重ねていた。ゲームの話題にならなかったのは、ピボットくん自身が避けているせいでもあった。
「そうだ、ピボットくんもやってみる？」
「いえ、ワタシは……」
プレイを勧められたピボットくんはゆっくりと頭を振って遠慮した。
　ちょうどピボットくんの心情を裏付けるようなやりとりだった。こんなふうに電子機器に触れる機会が訪れた場合、ピボットくんは怖気づいたように遠慮してしまうのだ。今回はゲーム機だったが、これが部屋の電気のスイッチやテレビの電源だったりしても、同じことになる。先生や他人が頼めばやってくれるが、決して自分から操作しようとはしない。その原因はチヒロやヒマリに言われた自身の力のことで、引け目を感じていることかもしれない。こういう部分が先生がどうしてもピボットくんを憎めない要因の一つであり、彼がゲームに言及することを避けていたもう一つの理由だ。ハッキング能力には、彼自身にも制御できない一面があるらしい。だから、無意識に電子機器をハッキングしてしまった時、ピボットくん自身が罪悪感に苛まれるのも、セキュリティを気にするチヒロやヒマリが警戒する気持ちもわかる。それを踏まえて、もっと前向きになってもいいんじゃないかと思うのが先生の意見だ。しかし、そのために自分に出来ることはないことも察していた。それが出来るのは多分、もっと身近な存在だ。
「まあまあ、今日はゲーム開発部のみんなも来るんだし、ゲームをやっておくと話が合わせやすいよ。ほら、一狩り行っちゃおー！」
ピボットくんの心情を察したうえでの行動ではないだろう。だけど、正解だった。怖気づくピボットくんのために必要なのは、打算なくパーソナルな友達だ。マキ、グッジョブ。と、先生は心のなかで親指を立てた。
「わ、わかりました……」
そうして、半ば無理やり気味に携帯ゲーム機を握らされるピボットくん。その後、マキに操作方法を教わる間も、ピボットくんの表情はやはり、どこか恐れのようなものを孕んでいたが、過剰に心配する必要はないだろう。むしろ、これでもう少し楽に電子機器に慣れてくれると嬉しいところだが。
　そのへんの機微はマキに任せ、先生はノートパソコンに集中する。溜まっている仕事を少しでも片付けないと。シャーレの仕事は多忙だ。外に持ち出せる仕事は限られているが、それでも空き時間を有効的に使わないと追いつかない量だ。シャーレに戻ったら何倍もの量の仕事が待っていると思うと、深いため息を溢したくなる。もちろん、生徒の前ではやらないが。
「え、え……えええーーー！？」
　仕事に取り組むこと10分。マキの悲鳴を聞いて、先生はノートパソコンから目を離した。
　マキが大きく開けた口に両手を当て、目を限界まで見開いている。
「マキ、どうしたの？」
「せ、先生！　どうしたもこうしたもないよ！　見て！　これ！」
「なになに？」
マキが手招きして画面を覗き込むように促す。
「これは？」
「クエストクリアのリザルト画面だよ。それよりこれ、見て！　このタイム！　スピアで7分42秒！」
「それは……早いの？」
「タイムアタック並に早いよ！　だってスピアってカウンターとリーチが強みだから…………弱いってわけじゃないけど、上手く使わないと火力が出せない武器なんだよ！　それなのにこのタイム！　しかも、相手は最後のアップデートで追加された最強モンス！　いくら時間が経って攻略法が判明しているとはいえ、こんなふうに倒せる相手じゃないよ！」
「そうなんだ……ちなみにマキはどのくらいで倒せるの？
「あたし？　あたしは……運が良かったらソロで20分切れるくらい？」
「そうなの？　じゃあ、ピボットくんは本当にすごいんだね」
「そうなんだよ！　どうしてこんなにうまいの？　ピボットくん！」
鼻息荒く、ピボットくんに詰め寄る。
「それは、このゲームはモンスターの行動パターンが決まっています。最初にだいぶ観察することが出来ましたし、回避や攻撃のタイミングにも慣れましたから」
「だからってこれは早すぎるよ！　しかも２回目ってほぼ初見じゃん！」
マキが絶叫する。
「とにかく、これはおかしいよ。こんなのがまかり通るのは、ゲーマーとして信じられない！　ピボットくん。ちょっと他のもやってみてくれない？」
「それは構いませんが……」
マキは肩を落とし、他のゲームを起動した。
「ふむ。このRPGは宝箱の中身がランダムとなっているのですね。その乱数はプレイヤーがマップを開く、別エリアに移動することで切り替わるそうです。エリア移動では二度シャッフルが行われてしまうので、ここはメニューで調整しましょう」
「そ、そうなの？　わ、ほんとだ最高レアばかり……」
「む。しかし、３つ先にエル字ブロックが落ちてきますね。ここは……こうして」
「ほんとに落ちてきた！　何でそんなことがわかるの！？」
「これは……マキさん。この辺には敵部隊がたくさんいます！　戦うのは避けましょう」
「え？　でも、有利だよ？　…………あ。本当だ。さっきのところ、すごい銃声鳴ってる……」
パズルゲームやFPS、他にも色々と試した結果、ピボットくんはそのゲームのアルゴリズムを瞬時に理解し、AIの動きやアイテムの出るタイミングなどを完璧に把握しているようだった。それには、普通のプレイヤーでは知り得ない情報も含まれている。これは、類い稀なるハッキング能力の副産物なのだろうか。
とはいえ、対人戦のゲームでは完全に読み切るのは難しいらしい。例えばバトルロワイヤルのゲームでは、エリアパターンや的の位置がわかっても、相手の動きが予想外だったりどうにもならない状況になって負けてしまうことも多々あるようだった。
　だが、それでも一プレイヤーの領分を超えた情報を取れるというのは多大なアドバンテージらしい。ピボットくんはほぼ全てのゲームで、熟練した腕前を披露したようだ。
「ピボットくんって存在がチートみたいだね……あ、もちろんゲームでの話だよ？」
　夕方に差し掛かり、ゲーム部のメンバーが来てもおかしくない時間になった頃、休憩なしでプレイし続けてきたマキが、ぐったりした様子で手足を投げ出した。
「マキさん。チートとは、何のことでしょう」
「ん。それは……」
　マキは言葉を詰まらせた。チートとはゲームのデータを違法に改竄し、通常ではなし得ない現象を起こす行為だ。極端な例を挙げると、HPを無限にしたり全ての敵を一撃で倒したりすることができる。性質上、オンライン対戦でやられると勝ち目はないため、ゲーマーにとっては看過できない行為だ。当然、マキもその言葉にいいイメージはない。言葉選びに失敗したと思っているんだろう。
「チートっていうのはずるいって言いたくなるくらいすごいってことだよ」
　言葉に詰まってしまったマキに代わって、先生が口を挟む。
「先生。ワタシはずるいのですか？」
　ピボットくんはしょんぼりと肩を落としてしまった。ピボットくんの検索は、何かを知りたいと思ってしまった瞬間に発動してしまうという。きっと、チートの本当の意味も知っているのだろう。だが、チートという言葉は褒め言葉の意味も持っている。ピボットくんの検索がどこまで及ぶかはわからないが、マキが言ったのはそっちの意味だ。それをなんとかわかってほしかった。
「そんなことないよ。だって、ピボットくんはずるいことをしてるわけじゃないんでしょ？」
「はい。ワタシは普通にプレイしていただけです。決してずるなどは……」
「なら大丈夫。ピボットくんはずるくない。マキもそういう意味で言ったわけじゃないよ」
柔和な笑みを携えてそう言った。確かにピボットくんは普通以上の情報を得てしまっているが、意図して悪用しているわけではない。とはいえ、残念ながらオンライン対戦では知らず知らずのうちにチートを使ってしまうのも不正行為に数えられてしまうのだ。だから、ピボットくんに罪悪感を抱かせない方法はひとつしかない。
先生はマキに目配せを送った。すると、マキはわかったというように頷くと、パアッと満面の笑みを咲かせて言った。
「そうだよ！　ごめん。チート級に上手いっていうのは、信じられないぐらい上手だってことだよ。あたしの言葉選びが間違ってたね……ピボットくんは天才だよ！」
「天才……ですか。ふふ、ありがとうございます。マキさん。とても嬉しいです」
「よかった！　じゃあ、気を取り直してゲームの続きしよ！　今度はパーティーゲームかオープンワールドゲームをやってみようか！」
　そうしてピボットくんが元気を取り戻すと、マキは自然な流れで別のゲームに誘う。チートのような力を使ってしまうのは仕方ないにしても、相手がコンピュータならギリギリ大丈夫なはずだ。幸い、マキも同じ考えだったようだ。唯一の解決策が伝わって、心から良かったと思う。
　それからしばらく、ふたりはオンライン対戦がないもしくはしなくてもいいアクションゲームやパーティゲームで遊んでいた。ふたりとも、ほとんど休憩していないのに、楽しそうに笑っている。
「それにしても、ピボットくんは本当にゲームが上手いね。ひょっとして、ユズ先輩にも勝てるんじゃないかな？」
　しばらくして、区切りのいいところで手を止めたマキが、ニヤリと笑った。
「ユズ先輩？　どなたでしょう？」
　ピボットくんは首をかしげた。
「ユズ先輩はゲーム部の部長だよ。それに、すっっっっごく格闘ゲームが強いんだよ」
　凄さを強調するように、マキが両手を強く握り、弾けたように広げた。
「へー。そうなんですか。ゲーム部の方なら、この後いらっしゃるのでしょうか？」
「え？　あー。それはどうだろう。ユズ先輩、あんまり部室の外に出ないらしいから……」
「そうなのですね」
　そういうピボットくんは、心なしか残念そうにしていた。
　ユズはゲーム部の部長だ。極度の人見知りで、授業は全てオンラインで済ませているため、ゲーム部の部室に尋ねない限りその姿を見ることは滅多にない。
それくらいの情報なら、ハレや先生のことを調べたときのようにミレニアムのサーバーをハッキングすれば分かるはずだが、検索と違ってハッキングは意識してやらなければできないらしい。つまり、知らないということはやっていないのだろう。チヒロの「ハッキング能力を悪用しない」という言いつけをしっかり守っているようだ。
そんなやりとりをしていると、ドンドンと力任せで遠慮のないノックが聞こえる。
「たーのもー！」
扉が勢いよく開かれると、元気いっぱいの声と共に、猫耳の形をしたヘッドホンを着け、制服の上にロングジャッケットを羽織った少女が踏み入ってくる。色はどちらもピンクで統一されていた。
「もー。それじゃ道場破りみたいだよ。お姉ちゃん」
続いて、そっくりな見た目の少女がもう1人、苦言を呈しながら入ってくる。ただし、こちらはヘッドホン、ジャケット共に緑色だ。
彼女たちの名前は才羽（さいば）モモイと才羽ミドリ。最初に入ってきた元気いっぱいなのが姉のモモイで、2人目が妹のミドリだ。彼女達は双子で、どちらもゲーム開発部に所属している。ちなみに、シナリオ担当がモモイでイラストを担当しているのがミドリだ。
「モモ！　ミド！　いらっしゃい。待ってたよー！」
「マキ！　来たよー！　もう準備運動はしてある？」
「もちろん！　さっきまでピボットくんと一緒にエイムの腕はあっためといたよ」
「ピボットくん？　誰それ？」
「ちょうどいいや。紹介するよ。つい最近、ヴェリタスの一員になったピボットくん！」
マキはそういうと、後ろで控えていたピボットくんの背中をバシバシと叩いた。
「こ、こんにちは……」
突然前に押し出されたピボットくんは、ぎこちない挨拶を口にした。
「わー！　ロボットだ！」
「うん。エンジニア部と合同で作ったんだ。でも、すごく人間みたいなんだよ」
「はじめまして。モモさん、ミドさん」
　ピボットくんがペコリと頭を下げた。
「わー！　すごい！　しっかり挨拶できるなんて、本当に人間みたいだね」
「だね。またすごいものを作ったね。マキ」
「へへ。まーね！」
　マキは腰に手を当てて、ふんぞり返るようにいった。
　ピボットくんは公にはヴェリタスとエンジニア部が合同で作ったロボットということになっている。いつでも口裏を合わせられるよう、事前の相談はバッチリだった。
「やあ、みんな。いらっしゃい」
「こんにちは、皆さん」
話がひと段落したところで、先ほどから入るタイミングを窺っていたハレとコタマが口を開く。
「ハレ先輩、コタマ先輩。こんにちは！」
「こんにちは。お邪魔します」
モモイが元気な挨拶を返し、ミドリが頭を下げた。元気いっぱいな姉と大人しい妹、姿は瓜二つでも性格は正反対な2人だった。
「ところでモモ、ユズ先輩はやっぱり？」
「うん。誘ったんだけど、やっぱり部室から出るのは嫌だって」
「そっかー。残念だけど、仕方ないね」
「そうなのですか。ユズ先輩はとても格闘ゲームが強いと聞きました。ぜひお手合わせ願いたかったのですが……」
「ユズの格ゲーは強いなんて次元じゃないけどね……」
モモイが遠い目をしてぼそっと呟いた。
　その気持ちは先生も分かる気がした。初プレイの格闘ゲームで、あらゆるハンデを課してもらったうえで、ただの一度も勝てなかった記憶が蘇る。あれこそまさに、チートクラスの腕前と言っていいだろう。なんなら、チートを使ってる相手すらも倒していたこともあった気がする。
「でも、ユズが来てたとしても、ピボットくんと戦ってくれたかな。ユズはすごい人見知りだし、すぐ逃げ帰っちゃう気もするけど……」「そうなのですか。では、また後日改めてお会いできると嬉しいです」
「うん。ごめんね、ピボットくん」
「いえ、かまいません」
「じゃあ、アリスちゃんは？」
マキがモモイに向かって訊いた。尋ねるタイミングが無かったが、アリスの不在は先生も気になっていた。ユズと違って、アリスは誰にでも懐き、可愛がられる愛嬌を持っている。基本、誰かと一緒に行動しているため、今日みたいな日に別行動するとは考えにくい。
「アリスはコンビニでみんなの分の飲み物を買ってから来るよ。私達はチョキを出したのに、１人だけパー出して買い出し係になっちゃったから」
　モモイは緑の顔を見ながら、ニヤニヤしていった。その時のリアクションを思い出しているのだろう。
「あ、みんなの分もちゃんと買ってあるから安心してね。もちろん、先生の分もちゃんと買ってあるよ。すっごく苦いコーヒー！」モモイはニヤニヤしたまま、続けていった。
「あはは、ありがとう」先生は苦笑とともにお礼をいった。
「でも、ピボットくんの分はないかも……」
「お姉ちゃん。ピボットくんはロボットなんだから飲まないでしょ」
「それもそっか」
実はピボットくんは普通に飲み食いできるし、なんなら好物はハレと同じ妖怪マックスだ。しかし、それを口にすると気をつかわせてしまいそうなので、誰も何も言わなかった。
「たのもー！」
そうこうしているうちに、ひとりの少女が入ってくる。道場破りのような物騒な挨拶だが、幼い女の子の声だったため、身構える人はいない。
「やあ、アリス。久しぶりだね」
「わ。先生がいます！　お久しぶりです！」
突然現れた彼女は、つま先太刀で小柄な体を精一杯に伸ばし、嬉しそうに体を振った。背伸びしてなお地面を引き摺るほどに長い髪が、フリフリと舞い踊る。
「アリス……あなたが」
先生の後ろで、ピボットくんが憮然とした呟きをこぼした。ミレニアムの唯一のアンドロイドであるアリスの存在は、彼には前もって伝えてある。当然、今日来ることもだ。分かっていても、人間にしか見えない見た目に驚いているようだ。
「おや、見慣れないロボットさんがいますね。NPCでしょうか？」
名前を呼ばれたことに気づいたアリスは、小さな唇に人差し指を当てていった。
「あ、いえ。失礼しました。アリスさんはワタシと同じ、ロボットだと伺わせてもらっていたので。ワタシと違って人間にそっくりで驚いていました」
「はい。よく知ってましたね！　その通り、アリスはアンドロイドです！　特別な力を持った勇者なのです！」
　アリスは子供のように大きく頷くと、手を上げた。揺れる頭に合わせて、頭上に浮かぶヘイローが動く。
「なるほど、勇者ですか。それはかっこいいですね！　アリスさん」
「はい。とってもかっこよくて強いんですよ」
アリスは無邪気な笑顔を浮かべて、薄い胸を張った。それから、真っ直ぐな瞳でピボットくんを見つめ始めた。
「どうかされましたか？　アリスさん」
「ピボットくん。私のことはアリスで構いません。アリスも呼び捨てにしているのですから、ピボットくんも呼び捨てで大丈夫です！」
アリスがそういったことで、キョトンとした空気が満ちる。
「アリスちゃん……ピボットくんのくんまでは名前じゃないと思うよ」
一足早く、アリスの勘違いに気づいたミドリが、冷静にツッコミを入れた。察しの早さは流石の付き合いの長さだ。
しかし、ミドリの言葉とは裏腹に、ピボットくんはゆっくりと首を振った。
「いえ。わたしの名前はピボットくんですよ。ワタシも同じように呼ばせていただきますね、アリス」
「え！？　そこまで名前だったの！？」
 まさかの事実にミドリが驚いていた。ちなみに先生達もそんな話は初耳だ。恐らくアリスに気を遣ったのだろう。しかし、よく思い返してみればハレが命名した時も、ピボットくんと言っていた気もする。よく分からなくなってしまったので、深く考えるのはやめにした。
「じゃ、自己紹介も終わったところで……早速やろうよ。アストロノーツ！」
　突然、モモイが叫んだ。
「おー！」
「いや、なんでお姉ちゃんが仕切ってるの？」
ミドリが冷静に突っ込む。
「待ってくださいモモイ！　ゲームをやる前に、回復アイテムの準備をしませんと！」
続いて、アリスがそういうと、存在をアピールするように、腕に下げていたレジ袋をガサガサと揺らした。
「ち、ちょっとアリスちゃん！　それ、コーラとかも入ってるから！　揺らしちゃダメ！」
袋の中にはお馴染みの赤いラベルのペットボトルも見えた。炭酸が帰化するのを恐れたミドリが慌てて止めに入る。
「あわわ、すいません……では、配っていきますね。モモイとマキはコーラ、ハレは妖怪マックスですね！」
謝ると、アリスは袋の中に手を突っ込み、ひとりひとり手渡しで配っていった。
「すみません。ピボットくん。ピボットくんの分は買ってなくて……よかったら、アリスの分を差し上げますが……」
先生に缶コーヒーを渡し終え、最後にピボットくんの番になった時、アリスは困ったように眉を歪めた。
「いえ。ワタシはロボットだから飲めないので、構いません。お気遣いありがとうございます！」
「そうですか……では、ピボットくんは何なら飲めますか？　やっぱり、ガソリンや燃料ですか？」
「あ、いえ。ワタシはその、だ、大丈夫なので！　気にしないでください！」
アリスの無邪気な考察に、ピボットくんは慌てていた。どうもピボットくんの味覚は人間と同じらしい。ガソリンや怪しい燃料を口に入れたら、卒倒してしまうだろう。
　そんな2人のやり取りの傍で、着々とゲームを始める準備が進んでいく。
「じゃあ、私たちはPCでやるね」
　ハレは早速妖怪マックスの缶を開けると、その中身を飲みながらPCに向き直った。画面にはすでに、デカデカと地球が映ったタイトル画面が浮かんでいる。
「あれ？　アストロノーツってクロスプレイ対応だっけ？」
「うん。全機種対応してるはずだよ」
「おっけー。じゃあ、私たちは○イッチでやるね！」
「あいあいさー」
モモイたちは懐から携帯ゲーム機を取り出すと、同時に机に座った。PC組と携帯ゲーム組で、自然と部活ごとに分かれる形になる。
「みなさん。アストロノーツとはなんですか？」
ただひとり、よくわかっていないピボットくんがみんなに向けて尋ねた。
「この前発売された新作アクションゲームだよ。オープンワールドでね、最大8人で広大な宇宙を攻略していくんだよ」
「なるほど…………それは面白そうですね」
「よかったらピボットくんもやる？」
「いいのですか？」
「うん。8人用のゲームだからできるよ。インストールしないとだけど、○イッチでも買えばいけるかな」
そう言って、ハレが携帯ゲーム機を準備する。だが、さすがにこっちの分は買っていないようだ。
「よかったら、私のを貸そうか？」
「あれ？　先生もアストロノーツ買ってたんだ？」
「うん。みんなとやれたらなって思って」
ヴェリタスやゲーム開発部ほどではないが、先生もゲームは好きだ。みんなとやるのはもちろん、単純に気になっていたので、事前予約してあったのだ。インストールも、昨夜寝てる間に終わらせてあった。
「そんな。でもそうしたら先生がみなさんとプレイできなくなってしまいます。それは申し訳ないです」
ピボットくんが心の底から申し訳なさそうにいった。
「いいよ。気にしないで。私はまだ仕事が残ってるから」先生は首を振ると、モモイの方を見て続きを口にした。「それに、アストロノーツってオンラインでもできるでしょ。それならユズも参加するんじゃない？」
「あ、そうそう！」すると、モモイは思い出したようにいった。「ユズ、部室には来れないけどオンラインでゲームには参加するって言ってた！」
「でしょ。だったらどのみち枠はいっぱいだし、みんなでやりなよ」
先生は半ば押し付けるように、自身のノートPCをピボットくんに渡した。
「先生……ありがとうございます」
「気にしないで。それじゃ、私はちょっと出かけてくるから」
「はい。行ってらっしゃい」
ピボットくんやみんなに見送られ、先生は部室を出た。
実際に外に出る用事があったのは本当だ。せっかくミレニアムに滞在してるならと、一度くらいセミナーに顔を出すようユウカにも言われている。それにもうひとつ、重大な呼び出しを受けていた。
先生は閑散としているミレニアムの廊下をある程度進むと、立ち止まった。茜色の空に照らされ、逆光を帯びる建物を窓越しに見つめながら、ポケットに手を突っ込む。
「…………やあ、先生。呼んだ？」
ボタンを押して、数分も経たないうちに彼女はやってくる。
「うん。早いね、エイミ」
「走ってきたから」
和泉元エイミはそういうと、暑い暑いと手を団扇がわりに仰いだ。
「エイミ。廊下は走っちゃダメだよ」
「分かった。気をつける。それより、部長のところ？」
「うん。案内してくれる？」
「オッケー」
エイミは歩き出す。先生はその背中を追った。
「エイミ。なんだか、緊張してる？」
道中、エイミの肩が張っているのが気になって、訊いてみた。
「うん。だって、あんなにこわばった部長、初めて見たから」
「そうなんだ」
　エイミはヒマリと同じ特異現象捜査部の一員だ。ただでさえ頑丈なキヴォトス人の中でも特別頑丈な身体を持っており、頭脳派のヒマリとは反対に前線での活躍を得意としている。身体能力の高さと効率を重視する性格ゆえに、恐れ知らずで、生傷がつこうとも平常心を崩さない彼女を緊張させるほどとは。ヒマリはよほど気が立っているようだ。
　数分ほど歩いて、特異現象捜査部の部室に到着する。
「お待たせ部長。先生連れてきたよ」
「ご苦労様です。エイミ。冷たいお茶を用意しましたので、少し下がっていてください」
たくさんのモニターの前に座るヒマリが発した声は、かつてないほどに重苦しい。聞いているだけで身体が強張りそうだ。
「うん。オッケー」
エイミは端のソファに腰掛け、テーブルに置かれたコップに口をつけた。
「先生も、よかったらおかけください」
「ありがとう」
促されて、先生もエイミの隣に腰掛ける。
ヒマリはゆっくりと先生に全身を向けると、太ももの間で手を組みあわせた。
「さて、先生。いきなりで申し訳ありませんが、例のロボット──ピボットくんについて、恐るべき事実が判明しました」
おしゃべりなヒマリにしては珍しく、前置きも挨拶もなしに本題へと入った。その様子から只事ではないと察して、先生は佇まいを正した。
「恐るべき事実？」
「実はあれから、ピボットくんに協力いただきまして、彼の体に対し様々なアプローチを試みたのです。エンジニア部の検証により、彼があらゆる物理的干渉を無効化することがわかっていました。しかし、彼は人間同様食事をすることができます。私はそこに目をつけ、自ら作成した小型カメラで内部構造を把握しようとしました」
ゆったりとした口調で説明を終えると、ヒマリは真空パックを懐から取り出し、机に置いた。
「これがその時に使ったカメラです。見ていて、何かお気づきになりますか？」
「ごめん、よく分からない」
「では、こちらを掛けてご覧ください」
渡されたのはゴーグルだった。掛けてみると、不思議な映像が広がっていた。ヒマリやエイミの体から、微弱な波のようなものが立っている。
「それは人の目には見えない電磁波を観測するためのゴーグルです。そちらを通して、このカメラを見てください」
「いいけど……」
言われるがまま、カメラに目を向けた。
「カメラから全く電波が出ていないでしょう」
「そうだね。全く感じないけど……カメラってこんなもんじゃないの？」
「いえ、カメラも当然電磁波を発しています。それにこのカメラは、ある事実を確かめるため、特別強い電磁波を発するように設計してあります。ですので、この状態は普通ではありません。これはピボットくんの体から発せられる特殊な電波により、こうなったのです」
ヒマリは細く短い息を吐いた。
「結論から話しましょう。ピボットくんの体は物体が放つ電磁波を無力化。消滅させるためのエネルギーを内包しています。それらはキヴォトスを脅かす脅威となる可能性が極めて高いです」
ぴしゃりと言い切ったあと、ヒマリはさらに続けた。「私はこれをアンチプロトコルと呼んでいます」
「アンチプロトコル……」
「先生、そんな難しそうな顔をしないでください。今からすべて説明しますから。少し、こっちに来てください」
モニターの方に招かれる。ヒマリは録画ソフトを立ち上げると、画面の中央をクリックして動画を流した。その動画は三分割になっている。真ん中は横たわるピボットくんに何かをする映像、右下に波形グラフ、左下には小型カメラの視界が映っていた。
「これはピボットくんの実験の様子を撮影したもので、右下のグラフはあのカメラから発せられている電磁波の周波数です」
小型カメラは細長い紐にぶら下がっている。エイミが慎重にそれをピボットくんの口の中に垂らしていた。
「少々乱暴ですが、彼は人と違って異物を飲み込んでも嘔吐感等は催さないようなので、この方法でアプローチしました」
　側から見ると残酷な映像だ。同じことを思ったのか、ヒマリが補足する。そして、ピボットくんがカメラを飲み込んだ瞬間だった。プツッとカメラの映像が途切れ、周波数も平坦になってしまう。
「見ましたか、今の瞬間を」
　ヒマリがカメラを止めた。
「この瞬間、カメラがアンチプロトコルに触れたのです」
神妙な顔つきで、ヒマリが言った。
「そうなの？　私にはよく分からなかったけど……」
今の映像では急にカメラの相棒が途切れ、周波数が平坦になっただけだ。そもそもアンチプロトコルなるものがあるのかも分からない。
「でしょうね。この映像だけでは判断はできないでしょう。アンチプロトコルというのはそもそも観測できないものなのです。可視上のものではないうえ、直接観測しようにも、そのための手段がことごとく無効化されるのですから当然です。ですから、私はある特殊な実験を行いました」
見ることもできない、機械で観測することもできない。それなら確かめようがないじゃないか。そう思ったが、ヒマリが言うにはそうでもないらしい。
「何をしたの？」
「簡単なことです。絶縁体のシートと強い電磁波を帯びた磁気シートなどで梱包したスマートフォンを、ピボットくんにハッキングしてもらったのです」
それで何が分かるのか瞬時には分からなかった。その反応を、ヒマリは予想していたのか「順序立てて説明していきましょう」右手の人差し指を立てた。
「まず、ミレニアムの超天才美少女は、ピボットくんの常軌を逸したハッキング能力がアンチプロトコルによるものだと考えました。アンチプロトコルで電磁波そのものを無力化してしまえば、どれだけ最高峰のセキュリティを誇ろうと、一瞬で突破することが可能です」
　ヒマリが2本目の指を立てる。
「次に、私の仮説が正しい場合、それをどれだけコントロールできるのか。また、赤外線や電磁波を遮断する物質、例えばアルミホイルや鏡、ゴムなどで覆われたものに対してもその効力を発するのか。これらの疑問を解消するための実験です」
　最後に3本目の指を立てて、ヒマリは説明を終えた。
　つまり、ピボットくんがハッキングする際、アンチプロトコルを飛ばし、セキュリティを無効化しているなら、その道筋を塞いだらどうなるのかと考えたのだろう。
「それで、結果はどうなったの？」
「……エイミ。あれの中身を持ってきてください。番号は1210です」
「オッケー」
エイミは立ち上がると、奥の冷蔵庫にも似た金庫に手をかけた。ダイヤル式の金庫のようだ。暗号はヒマリの誕生日だろうか。どうやら、中身はそこまで厳重に扱っているわけではないらしい。
「もってきたよ」
「ありがとうございます。では、それを机に並べてくれると助かります」
「オッケー」
簡単に空いた金庫から持ってきたものを、エイミはひとつずつ机に並べていった。
「これは実験に使用したスマートフォンと、それを覆っていたアルミホイルや電気を通さない絶縁体でできた箱などです」
エイミがものを並べていくたび、ヒマリが解説する。実験には多数の器具を使ったらしい。隙間なく詰めて、ようやくスペースが足りる程度だった。説明を終えると、ヒマリが中央に置かれたスマートフォンを持ち上げる。
「実験の結果、これらで一切の隙間なく覆ったスマートフォンは、ピボットくんのハッキングの影響を受けませんでした」
　スマートフォンの画面をつけると、再び机の中央に戻した。
「おお！」
先生が歓喜の声を上げる。だが、ヒマリの表情は険しいままだ。
「続いて、これらの材料を減らしながら、同様の実験を繰り返しました。その結果、絶縁体を取り除いた時のみ、スマートフォンはハッキングを受けました。そして、スマートフォンがハッキングを受けている間、やはり電磁波は出ていなかった。そこから私はアンチプロトコルが電磁波の一種だと思ったのです」
「なるほどね。でも、絶縁体で防げるなら、キヴォトスを脅かすっていうのは言いすぎじゃない？」
「そうですね。しかし、現実は非常なもので、そう上手くはいかないのです。続いて、私は絶縁体で覆った別の小型カメラを、ピボットくんの体内に挿入しました」
あれと同じ小型のカメラです。と、補足した。
「……分厚い絶縁体シートで十重二十重にも覆いました。しかし、ピボットくんの体内で、カメラはアンチプロトコルによる強い影響を受け、このカメラと同様、動かなくなりました」
「つまり、絶縁体でも防げなかったということ？」
「ええ。絶縁体で防げるのは一定量のアンチプロトコルまでです。許容量を超えてしまったら、このように防ぐことはできません」
ヒマリはなお重苦しい顔でいった。
「このカメラはもう完全に故障しちゃったの？」
「いえ、故障とは違います。このカメラも2度目の実験に使ったカメラも、どこも故障していないのに動く気配がありません。そもそも電気を通すことができないので、動かないのです」
「時間が経ったら戻るって言う可能性は？」
スマートフォンはついていた。アンチプロトコルに晒された場合も、また動くようになるというのは考えられないだろうか。
「それは分かりません。少量ならその可能性は高いでしょう。事実、ハッキングを受けたスマートフォンは、コトが終わった後、何事もなかったかのように電磁波を発し、動き始めました。ですが、大量のアンチプロトコルとなると……このまま放置していればいつか戻る可能性も、2度と戻らない可能性もあります。ですが、いずれにしても長い時を要するのは間違いありません。このようなカメラならともかく、もっと大きいものが止まったら大変ですよ」
「確かに、電車とか車が止まったら大変だね」
「ええ。その通りです。まあ、それだけで済むならまだマシだったんですが……」
　ヒマリは目をつぶって頷くと、明後日の方向に向けてため息交じりにぼやいた。
「え？」
電車や車が急に止まったら、そこら中で事故が起きたり身動きが取れなくなる人が現れたりする。それらがもたらす惨状は想像にしがたい。しかし、ヒマリはそれでさえマシだという。まだ上があることに先生は戦慄を憶えた。
「先生はご存知ではないと思いますが、実は二度目の実験の後、数日間、この部屋の電子機器がすべてショートしていました」
「そうなんだ……何かあったの？」
「実験直後、ピボットくんの体内から取り出したカメラより発せられたアンチプロトコルに当てられたのです。まぁ、所詮は余波。ハッキングを受けたスマートフォンのように短時間で直りましたが、もたらされた被害は尋常じゃありません」
ふふふ。と、ヒマリは悪魔的な笑顔を浮かべた。節々にどことなく、苦労が滲み出ていた。
「話が逸れました。私が言いたいのはそんなことではありません。私が最も問題視しているのは、電子機器のみでなく、私やエイミまでが強烈な倦怠感に襲われたことです」
「あれは大変だったね。すごく眠いのに眠れないみたいな、気持ち悪い感じだった」
エイミが顔をしかめる。
「そんな……どうして、２人にまで影響が？」
アンチプロトコルは機械などが発している電磁波を無効化するものじゃないのだろうか。それがどうして、ヒマリたちに影響を及ぼしたのだろう。その答えは、ヒマリがすぐに教えてくれた。
「簡単なことです」ヒマリは口元を歪めた。「電磁波を発しているのは機械だけではありませんから」
「……あ」
ようやく、先生はヒマリが言った恐るべき事実に気づいた。そういえば、ヒマリはアンチプロトコルが無効化する電磁波を物体が発するものだといった。機械とは一度も断言していない。
　そのことを理解した瞬間、先生はぞっと背筋が凍ったような錯覚に駆られた。
「紫外線と同じです。ごく少量なら人体に影響はありませんが、量が増えると強い悪影響を及ぼす。まあ、紫外線の場合は遠い宇宙から我々の元まで届く間に弱まりますが、アンチプロトコルはそうもいきません。さらに、忘れてはならないのが、私とエイミが影響を受けたのがカメラが浴びたアンチプロトコルの余波ということ。直接浴びた場合は生命活動の停止、大量の余波を浴びた場合も、同様の状態に陥る可能性が高い。いずれにしても待っているのは死です。そして、ピボットくんの体内には大量のアンチプロトコルが内包されている可能性が高い。もし、それらが広範囲に放出されたらどうなるとお思いですか？」
「……量によっては、大量の被害者が出る？」
「その通りです。ですが、それはあくまで最悪のケースです。それを想定するには、あまりにもわかっていないことが多すぎます。少なくとも、ピボットくんが内包するアンチプロトコルがどれほどのものか、大量に放出する手段や機構があるのかは確かめる必要があるでしょう。つまり、まだまだ実験が必要な段階です。とはいえ、その危険性は決して放っておいてもいいものではありません。もし、キヴォトスを脅かすのなら……」
ヒマリはその先を口にしなかった。だが、彼女の表情と口調から、言わんとしていることはわかった。
「……ヒマリ。それはダメだよ」
「ええ。それはあくまで最終手段です。私だって、こんなリオみたいなことはしたくありませんので」
ヒマリは苦々しい顔で罵るようにいった。
　リオというのは失踪中の生徒会長、調(つか)月(つき)リオのことである。セミナーのトップを務めるだけあり、その技術や手腕はヒマリに勝るとも劣らず、ミレニアムサイエンススクールで唯一ヒマリと対等に張り合える才女だ。反面、性格の反りは全く合わず、特にヒマリはリオの名前が上がると、必ずと言っていいほど毒を吐く。いつもはそこにリオに対する嫌悪感以外はないが、今回に限ってはそうでもなさそうだ。リオは過去、アリスを脅威と見做し、そのヘイローを破壊しようとしたことがある。紆余曲折あってその蛮行は阻止することができたが、かつては止める側だった自分が、そちら側に回ってしまうことに憤りを感じているようにも見えた。
「報告はこんなところでしょうか。何か質問はありますか？」
「じゃあ、２ついいかな。ヒマリはカメラが浴びたアンチプロトコルの余波で影響を受けたって言ってたけど、カメラは２つあったよね。どっちも、同じ影響を受けたの？」
カメラを挿入しての実験は、ハレの提案でエンジニア部も行った。その時は何も起きなかったはずだが、ヒマリのときはどうだったのだろう。
「いえ。それが起きたのは二度目の実験のときです。一度目は何も起きませんでした」
「その理由は知ってるの？」
「いえ。しかし、二度目は絶縁体を貫通するため、大量のアンチプロトコルを帯びていました。仮説にはなりますが、おそらく浴びたアンチプロトコルが多かったのでしょう」
「……なるほど」
「ご理解いただけましたか。では、次の質問を聞いても？」
「そのことをピボットくんは知っているんだよね？」
　実験台として立ち会ったのなら、知っているはずだ。だが、ピボットくんはそんなことは一言も口にしていなかった。
「ええ。ですが、ピボットくんにはここであったことは決して他言しないようにお願いしています」
「……なるほど」
「質問は以上でよろしいですか？」
「……うん。大丈夫」
「では、話は終わりにしましょう。先生、しつこいようですが、今聞いたことはくれぐれも他の方には教えないようにお願いいたします。然るべきときが来たら、私から伝えますので」
「わかった」
「それと、お願いしていたピボットくんの監視ですが、もう終わっていただいて構いません。シャーレの業務もあるでしょうから、ミレニアムに泊まり続けるのも限界があるでしょう」
「ありがとう。でも、仕事のことなら大丈夫だよ」
正直な話をすると、シャーレに戻ってきてほしいと言われてるのは事実だ。だが、今の話を聞いてしまうと、どうにも放っておくことはできない。
「そうですか。それと……アンチプロトコルの危険性はともかく、私も私なりに彼と接してきて、その誠実さは認めています。安全にアンチプロトコルを取り除く手段があるのであれば、そうしたいと思いますよ」
「……大丈夫。ヒマリの優しさは分かってるよ」
最後に先生は優しく笑うと、後ろ手に扉を閉めて部室を後にした。


（ここでヒマリ。先生に降りてもらうようにいってもらう。我々キヴォトス人はヘイローさえあれば、アンチプロトコルを食らっても、生き長らえることは出来ます。ただ、普通の人間である先生の電気信号がていしすれば……それはすなわち、死です）








先生の姿が見えなくなってしばらくが経つと、ヒマリは艶のある息を吐いた。
「ふう。私もまだまだ子供ですね。先生に嫌われたくない。その一心で最後に余計なことを口走ってしまうなんて」
伏せられた目からは、先程まで放っていた威圧感がすっかり抜け落ちている。長いまつげが力なく揺れていた。
「やはり、私は貴方のような冷徹者にはなれないようです。リオ」
「……別に、なる必要はないでしょう。あなたと私は違うのだから」
ヒマリが金庫の裏に向けて呼びかけると、突き放すような冷淡な声と共にドローンが姿を見せる。
「当然です。あなたと私が同じだなんて、考えるだけで吐き気がします」
ヒマリも負けじと冷たい声でいう。
「……で、早く用件を言ってちょうだい。あなたがわざわざ呼び出したということは、よほどの理由があるでしょう」
「当然です。私が何の理由もなくあなたなんかを呼び出すはずがありません。先ほどの先生との会話は全て聞いていたでしょう。それと、送った資料は読んでくれましたか」
「ええ」
「なら、説明はありませんね。単刀直入に言います。リオ、ピボットくんのヘイローを破壊するノウハウを教えてください」
「………………本気？」
「私がこの手の冗談を言うと思いますか？　もし、ピボットくんのアンチプロトコルがキヴォトスを脅かすなら、やむを得ない処置だと思っています。リオ。あなたなら気持ちはわかるでしょう」
「………そうね。痛いほどにわかるわ」
ドローン越しに、リオの声が沈んだのを感じる。
「……アレはとんでもない脅威です。意識があるのに、身体が動かない。あれほどの苦痛を味わったのは初めてです」
実は先生には言っていないことと、ウソをついたことがあった。
まずはヒマリたちが受けたアンチプロトコルの影響の大きさだ。軽いめまいの後、身体が途端に動かなくなったのだ。それから頭も身体も一切動かなくなった。意識はあるのに、何も考えることも出来ず身体も動かせない。本当に恐ろしかったのは、そんな状態でも、空腹になったり生理現象を催したことだ。幸い、浴びたアンチプロトコルが少なかったため、半日程度で徐々に動けるようになったものの、あんな生き地獄は二度と味わいたくない。
　そして、もう一つウソをついたのは。
「そんなにひどかったの？　アンチプロトコルを直接受けた症状は」
「最悪です。お腹が空いているのに食べられない。身体の節々がいたくなってきたのに動くことも出来ない。よかったら、リオも体験してみますか？」
「いえ。遠慮しておくわ」
カメラの余波を受けたと言った。だが、あれは嘘だ。本当はピボットくんが直接発したアンチプロトコルを浴びたことで、あのような状況になったのだ。
「まさか、アンチプロトコルを放出する条件が、感情が激しく高まることとはね」
　ペラっと紙の擦れる音がした。先日、送った資料を見ているのだろう。そこには先生に話した情報はもちろん、それ以上のことも記している。
「……なんて言って、ピボットくんを怒らせたの？」
「それはシークレットです」
「そう」
特別なことはしていない。ただ、ピボットくんの善性を翻弄するように煽っただけのことだ。ただ、この場においてその詳細を語る必要はないと考えていた。
「無駄話はここまでにしましょう。それより、返事を聞かせてください、リオ」
リオは口をつぐんだ。
「リオ。どうして何も言わないんですか。黙っていては何もわかりませんよ」
「ヒマリ、珍しく焦ってるわね」
ヒマリはハッとして口をつぐんだ。焦ってるのはそのとおりだ。
「……でも、やっぱりダメね。いいとは言えない。ヒマリ。本当に方法はないの？　それ以外の方法は本当にないの？　ヘイローを破壊するだなんて、あなたらしくない」
ヒマリは何も答えなかった。
「……私はヘイローを破壊するよりも、その力を有効活用する術を探したほうがよっぽど有意義だと思うわ。あなたもそう考えると思っていたのだけれど。違ったみたいね」
そう言い残すと、リオのドローンはその場に着陸すると、
「……あなたはあれを目の当たりにしていないからそんなことが言えるんですよ。リオ」
ヒマリは力なく毒づいた。

５日前。時は遡り、ヒマリは特異現象捜査部の部室ではない、ミレニアム地下に作ったラボで、来客を待っていた。
「部長。ピボットくんが来たよ」
「わかりました」
しばらくして、ピボットくんがやってくる。
平日の放課後、休日は丸一日、ここでピボットくんの調査を行っていた。
「……ヒマリさん。やっぱり、ワタシは危険人物なのでしょうか」
「ええ。それはもう、あなたの体内にあるこのエネルギー。これは使いようによっては任意の相手に大損害を与えることも可能な兵器です」
「そんなことはしません」
「残念ですが、私は」


「ハレもマキも、

「そんなの……そんなのは、絶対に嫌です！」

ピボットくんの恐怖が、ある一定のラインを超える。
　そして、気づけばヒマリは倒れ伏していて。
　
（この時、ヒマリはピボットくんにPCを接続。アンチプロトコルの感情と暴走が繋がっている事をしる。そして、実験のためにピボットくんを悲しませる。ここで、ピボットくんはもしものときは、私のヘイローを破壊してくれますか？　といった。）




「……ヒマリさんは、優しいんですね」


カキかけファイン



ゲーム部の部室と別れた後、先生は当てもなく廊下を彷徨っていた。
　それに、先程ヒマリが言いかけていたこと。──ピボットくんのヘイローを破壊するのもやむなし。あれは多分、本気だ。
　ただ、ヒマリは優しい子であることも知っている。そう簡単に　だから多分、彼女はなにか隠し事をしている。彼女なりに考えがあるのだろう。だが、いかなる理由があってもヘイローを破壊するだなんて蛮行を許す気にはなれなかった。
先生は懐のカードに触れた。これは代償を引き換えに特別な力を使える代物だ。これを使えば、ピボットくんのアンチプロトコルを取り除くことができるかもしれない。だが、そんなことをすれば、下手したら命と引き換えになる可能性さえある。
「アロナ。アロナはどう思う？」
　カードから手を離すと、先生はそのまま同じく懐の広めのポケットに忍ばせたタブレット、シッテムの箱をトントンと叩き、問いかけた。シッテムの箱の中にはアロナとプラナという２人の少女が存在する。彼女たちの存在は誰にも明かしていない。もちろん、ヒマリにも。
　シッテムの箱は先生のみに扱える特殊なOSだ。その性能はデカグラマトンの干渉さえ瞬時に凌ぐ、強力な力を持っている。それらを管理するのがアロプラコンビなのだ。シッテムの箱はその力ゆえに存在しているだけで負荷がかかる。そのせいか、ふたりは寝ていることが多い。呼びかけても返事がないとのはそういうことだろう。
無理やり起こすこともできるが、まったく逼迫した状況ではないため、やめておいた。大人のカードは強力だが、非常に危険だ。彼女たちに助言を求めたところで、反対されるのは目に見えている。相談は彼女たちと会話することで気を紛らわせるための方便だ。タブレットから手を離すと、先生は嘆息して足を止めた。
「あれ、先生？」
それからしばらく人のいない廊下を彷徨っていると、聞き覚えのある声に呼び止められる。
「ユウカ？」
　ふりかえると、いつかのようにユウカが怪訝な表情でこちらを見ていた。
「どうしたの？　こんな時間に？」
　腕時計を見ると、もう１８時を回っている。とっくに日も暮れており、ヴェリタスのような生徒を除き、みな自室に戻っているはずだが。
「私はセミナーの仕事ですよ。それより、先生こそどうしてこんなところにいるんですか？」
「私は……ちょっとヒマリから相談を受けていて。ちょうど帰るところだよ」
「そうだったんですか？　でも、出口はあっちですよ？」
「……あれ？　そうだっけ？」
「そうですよ。どうしたんですか先生。寝ぼけてるんですか？」
半目のユウカに突っ込まれて、ユウカはしまったと思った。もっとマシな言い訳をするべきだった。もう何度も来ているだけに、今さら迷子になったといっても説得力がなさすぎる。
しどろもどろになる先生を見て、ユウカは呆れた息を吐いた。
「はぁ。まあいいです。それより先生。このあと、予定はありますか？」
「ないよ」
「そうですか。でしたら先生、ちょっとお時間いただけますか？」
「いいけど、もしかして仕事の手伝い？」
「いえ。実は私もちょうど仕事が終わったところなんです。あとは部屋の戸締まりをするだけなので、よかったらお茶でもどうかなって思いまして」
「そういうことか。じゃあ、ありがたくいただこうかな」
　先生の不自然な態度を、必要以上に追求することはなかった。お茶の約束を取り付けると、生徒会室に向かって歩き出す。先生は無言でその背中を追いかけた。
　エレベーターに乗って、高層にある生徒会室に到着すると、ユウカはすぐさまお湯を沸かしてお茶を入れてくれた。
「どうぞ。粗茶ですが」
　ソファに座った先生の前に、ソーサーの上に乗ったカップが置かれる。洋風なカップだが、口をつけると和の味がした。
「このお茶、香ばしくて美味しいね」
　先生はカップを置くと、対面に座り、同じくカップに口をつけるユウカに向かって笑いかけた。
「でしょう。百鬼夜行から取り出した玄米茶で、最近ハマってるんです。淹れ方にもこだわってるんですよ？」
　ユウカは誇らしげに言うと、どのようにこだわっているかを楽しげに語ってくれた。
　無邪気に笑う彼女は珍しく、
「そういえば先生。先生はヴェリタスの業務監査で、ミレニアムに止まってるんですよね」
「うん」
「でしたら、ヴェリタスとエンジニア部が共同で制作した人工知能を搭載したロボットのこと、ご存知ですよね」
「ピボットくんのこと？」
「そう、それです。最近、セミナーの仕事が忙しくて見に行けていないんですが、ロボットなのに限りなく人間みたいらしくて。気になるので、お話聞かせてくれませんか？」
先生はユウカの

「……ユウカ。もし、私ん身体の中に爆弾が埋め込まれていて、それが爆発するとキヴォトスが滅びる。って言ったらどうする？」
「……先生。疲れてるんですか？」
思いっきりジト目を向けられてしまった。
「ごめん。確かに最近寝れてなくて疲れてるかも。今日は休ませてもらうよ」
　ちょうどカップが空になったところだ。そろそろお暇しようとトタ上がる。
「ち、ちょっと待ってください先生！　別に答えないとは言ってないじゃないですか！」
先生が座り直す。ユウカは玄米茶で口を潤すと、真剣な顔でいった。
「……まず、人の体内にキヴォトスを破壊できるほどの爆弾を埋め込めるとは思えませんが、もしそうなったとしても、ミレニアムの総力を上げてなんとかしてあげます」
「……それでも、解決できなくて、その方法が私の命を奪うことしか無いとしたら？」
「どうしたんですか？　今日はやけにネガティブですね、先生」
「……ごめん。たしかにらしくなかったね。やっぱり、疲れてるのかな」
自虐的に笑う。
「やっぱり、私は帰るよ」
ユウカは顎に指を当てて、考え込んでいた。
「……ユウカ？」
　気になって呼びかけるも反応はない。しばらくして、ようやく顔を上げた。
「えーと、ちょっと想像しにくいですね。もし、先生の命を奪うしか無いなんて状況になっても、みんな諦めるとは思えませんけど……あ、リオ会長とかは躊躇なく実行しそうですね。でも、大抵の人はやっぱり、最後まで足掻くんじゃないですか。みんな先生のことが大好きですし。私だって、諦めることはないと思います」
「ユウカ……なんか、告白みたいですね」
先生は頰をかいた。その言い方だと、みんなの中に自分もカテゴライズしていることに気づいているのだろうか。
「なっ！？　ち、違いますから！　もう！　あんまりからかってると怒りますよ！」
「ふふ、もう怒ってない？」
「怒ってません！」
ユウカは顔を真っ赤にして、憤慨していた。どう見ても怒っているが、あまりしつこくすると本気で怒られかねない。
「……ふう。やっと笑ってくれましたね」
「え？」
「先生、廊下で会ったときからずっとしかめ面してましたから。ずっと心配してたんですよ」
「……そうなの？」
「はい。気づいていなかったんですか？」
全く気づいていなかった。そんなに顔に出ていたんだろうか。だが、心配してくれたから、あんなに何度も引き止めてくれたのだろう。
「……ありがとう、ユウカ。ちょっと元気が出たよ」
「お役に立てたなら光栄です。先生が何を悩んでいるのか知りませんが、私でよかったら聞きますよ」
「それは……」
ストレートな優しさを見せられると、つい相談したくなる。だが、アンチプロトコルのことは他言しない約束だし、安易に言わないほうがいいだろう。ユウカは優しい心の持ち主だが、合理主義者でもある。下手したら、ヒマリと同じ考えに行き着くかもしれない。
大丈夫だよ。そう言って断ろうとした瞬間だった。
「え？」
ふと、視界が暗闇に包まれる。遅れて停電が起きたのだと気付いた。
「ウソ！？　停電！」
ユウカが裏返った声で叫びながら立ち上がった。
「なんで！？　まさか、またあの時みたいにヴェリタスが？」
「いや、これは多分……」
「先生？　ひょっとして、原因を知っているんですか！？」
「わからない。わからないけど……同じ被害にあった話を、ここ最近聞いたことがある」
恐る恐るそういうと、先生はポケットのスマートフォンを取り出し、画面に触れた。だが、画面は真っ暗なまま。だが、独立した電源を持つスマホまで起動しなくなるなんて。つくづく、ヴェリタスのみんなから聞いていたとおりだ。
──アロナ、プラナ。起きて。緊急事態だよ。
シッテムの箱を取り出し、強制的に電源をいれた。これが先刻はしなかった彼女たちを無理やり起こす方法だ。ヴェリタスで停電騒ぎがあった際は、あらゆる電子機器が短時間、機能を停止したという。今となっては確かめようはないが、おそらくそれもアンチプロトコルの影響だったのだろう。だが、シッテムの箱ならアンチプロトコルの干渉さえ跳ね返すことが可能だ。
「そんな、まさか……シッテムの箱まで！？」
　だが、先生の希望を打ち砕くように、タブレットは暗いままだ。無邪気な少女の声も聞こえない。それが先生を驚愕させる。まさか、シッテムの箱さえ干渉を受けるとは、アンチプロトコルとはとんでもなく強力なものらしい。
「先生？　結局この停電の原因って……」
ユウカが不安げに尋ねてくる。生徒会室のあるミレニアムタワーが停電することは滅多にない。そんなことが起きたのは、おそらく過去に一回だけだ。しかも、それは人為的なものである。その時は先生も協力し、ゲーム開発部とヴェリタス、エンジニア部が共同で意図的に起こしたのだ。当時はある事情から、そうする必要があった。ただ、その時はユウカも停電が起きることを予測していたという。一方、今回は完全に不測の事態だ。人為的なものかシステムの不調によるものかもわからない。計算外の事態に弱いユウカは、動揺が隠せていないようだった。
ぎゅっと服の裾が握られる。ふと首だけで振り返ってみると、ユウカが瞳を震わせていた。
「わからない。でも、今は待つしかなさそうだね」
　先生は怯えるユウカを落ち着かせるように言うと、彼女と共にソファに座った。その後、気分転換に玄米茶を啜ろうとして、中身が空になっていることに気づいた。

電気が戻ったのは、ふたりがソファに座ってから数十分ほど待った後だった。
「あ。電気、戻りましたね」
先生の隣に座り、終始ソワソワしていたユウカが安心したように言った。
　月明かりのおかげで全く見えないほどじゃなかったが、やはり明かりがあると。
「……あ！　ご、ごめんなさい先生！　こんなに近くで……」
　落ち着いたことで、自分が密着していたことに気づいたらしい。上ずった声でいいながら、ユウカは先生との距離を取った。
「大丈夫だよ。それよりユウカ、カップの片付け、頼んでもいいかな？」
「片付けですか？　はい。それは別に構いませんが……というか、最初から私がするつもりでしたが」
「ありがとう。それと、ごめん。私、ちょっと行くね」
先生は立ち上がると、ユウカに別れを告げてエレベーターの方に駆け寄る。
「ま、待ってください先生！　そんなに急いで、いったいどこに行くんですか」
　先生の様子が明らかに普通じゃなかった。ユウカはすがりつき、問いただすようにいった。
「ヴェリタスの部室だよ」
「部室？　どうしてですか？」
言うべきか迷った。正直に言うのは、アンチプロトコルの存在を明かすのと同義だからだ。だが、この期に及んでごまかすのは無理だというのもわかっていた。
「…………そこに停電の原因があるかもしれないからね」
　結局、先生は長い溜めの後、そう口にした。
「え！？　先生、停電の原因を知っているんですか！　それなら、私も行きます！」
「……うん。一緒に行こう」
　先生が頷いた瞬間、エレベーターがちょうど到着した。ちんと音がなった後、開いた扉にユウカと共に乗り込む。
エレベーターの中で、先生はユウカにピボットくんのことをアンチプロトコルを伏せて説明した。
「そんな。あれはエンジニア部とヴェリタスが共同で造ったロボットじゃなかったんですか？　どうしてそんなウソを！」
「それは、ピボットくんが尋常じゃないハッキング能力を持っていて、まともに正体を明かすとミレニアムに有害だと判定されると思ったから仕方なかったんだ」
先生はユウカの目を見据え、いった。ミレニアムには部活動で作成した発明品が有害な場合、押収されることも珍しくない。
「……ミレニアムにとって有害かどうかは、ちゃんと見て決めます。今度からちゃんと、必要な申請はしてください」
ユウカは強い意思がこもった面持ちでいう。それは先生や他の生徒に何だかんだで甘い早瀬ユウカではなく、セミナーの会計として、公平な立場で判断を下す顔だった。
「それで、そのハッキング能力と停電が関わっているんですか？」
　流石ミレニアムのセミナーだ。素晴らしく勘が鋭い。
「うん。これはついさっき、私もヒマリに聞いたばかりなんだけど……」
それから、先生はアンチプロトコルについて、可能な限り脚色することなく伝えた。もちろん、アンチプロトコルが人体に影響を及ぼすことも。説明を聞いたユウカはゾッとしたような表情をして、
「……それでも、危険かどうかは直接見て判断します」
こわばった顔でそういった。続けて、そんな危険な力は持っていても、ピボットくんは至って善良で誠実な性格であることも伝えた。だが、ユウカの表情が変わることはなかった。

ヴェリタスの部室に戻ると、危惧していた通りの光景が広がっていた。
すべてのPCや電気系統がダウンしている。中央にあった机は避けられ、その上に室内用の照明が設置されていた。空いたスペースとソファの上に、ゲーム開発部とヴェリタスの面々が寝かされている。全員、目を瞑っており、意識を失っているようだった。
「先生！　なんですかこれ！」
中の光景を見て、ユウカが悲鳴をあげた。
「……とうとう、こうなってしまいましたか」
先に到着していたヒマリが、重々しい口調でいった。
「ヒマリ部長！？　それにエイミ！　どうしてここに……」
遅れてヒマリの姿に気づいたユウカが目を見開いて驚いた。側にはエイミの姿もある。机の配置とみんなの移動は彼女がやったのだろう。照明はおそらくヒマリが持ってきたものだ。
「おや、ユウカ。先生と一緒だったのですか」
　ヒマリは先生の存在に気づいても、驚く様子はなかった。だが、その隣のユウカを見て、意外そうに目を見開く。
「うん。さっきまで一緒にお茶を飲んでて」
「そうですか。では、説明はもう？」
「うん。あらかたは」
「わかりました」
　ヒマリと先生は主語のない会話を交わした。だが、お互いに言わんとしていることは理解していた。この場に部外者を連れてきたということはそういうことだ。
「ヒマリ部長！　いったいここで何が起こったんですか？　なんかこのへんは停電したままですし、みんな倒れてて……」
　ユウカが半狂乱といった様子で車いすに詰め寄った。生徒会室は停電が収まったが、部室の周辺は電気が消えたままである。真っ暗な廊下を進むのはホラーゲームに迷い込んだような恐怖があった。
「ユウカ。落ち着いてください。先生に説明を受けたなら分かるでしょう。この現状は、アンチプロトコルによりもたらされたものです」
ヒマリは慌てるユウカの声を、上から抑え込むようにいった。
「……ここで何が起きたかについては、本人に聞くべきでしょう。何しろ私も、ここに来たばかりで事態が把握できていませんので」
ヒマリは奥に佇んでいるピボットくんに向けて問いかけた。切れ長の瞳が、まっすぐにピボットくんを捉える。
「ご、ごめんなさい。ワタシ、そんなつもりはなくて……」
「落ち着いてください。ピボットくん。私たちはあなたを責めようとしているわけではないのです。ただ、何があったかを教えていただきたいだけなのです」
「ピボットくん。何があったのかを教えてもらえないかな」
　代わりに先生が一歩前に出た。目を閉じている少女たちの間を抜けることを申し訳なく思いながら、ピボットくんの側まで歩みを勧めた。
「近づかないでください！」
近づいてくる先生を、ピボットくんは悲壮な声で拒絶した。ピボットくんがこんなふうに鋭い声を放つのは、初めて見た。たまらず、先生は足を止める。
「ワタシは……ワタシはみなさんを傷つけました。ヒマリさん、あなたの言う通り。ワタシはヴェリタスにとって、有害な存在だったみたいです」
ピボットくんは震えた声でいった。
「ヒマリ！？　そんなことを言ったの？」
「……ええ。ですが、それには致し方ない理由があったと説明したはずです。ピボットくん、あれは本心で言った言葉ではありません。あなたの力の詳細を確かめるために、口にした詭弁です」
ヒマリがあくまで冷静に説得にかかる。慌てない彼女の声で、少しは落ち着いたのだろうか。ピボットくんは静かにうなずいた。
「……ええ、そうかもしれません。ですが、本心ではなくとも、真実ではあります。事実、ワタシはあんな些細なことで……モモイさんとミドリさんを、ゲーム開発部とヴェリタスのみなさんをこんな状態にしたのですから！」
　再び、喉が焼き切られたように叫ぶ。それから、ピボットくんは何があったのかを語りだした。


ここから過去編。

　先生がヒマリとアンチプロトコルについて話し、停電が起きるまでの間に遡る。
　先生が部室を出ていった後、残されたメンバーはアストロノーツを攻略していた。
　ハレ達は各々のデスクに座りPCで、モモイ達ゲーム開発部は中央のテーブルに集まり、携帯ゲーム機でプレイしている。唯一ノートPCでプレイしているピボットくんも、ゲーム開発部と同じテーブルについてプレイしている。
「わー！　ミドリ、助けて！　宇宙人が四方八方にいるよ！？」
「もー！　お姉ちゃん突っ込みすぎ！　流石にヒール間に合わないって！　その立ち回りならタンクやってよ！」
「タンクはやだ！」
モモイとミドリがわいわいと言い合っている。
　アストロノーツは最大８人で攻略するオープンワールドのアクションゲームだ。プレイヤーは広大な宇宙を渡り、冥王星と天皇星に５星を加えた全部で７つの星を探索していく。それぞれの星には独自の生態系が形成されており、
それぞれ門番的なボスをたおすことでその星を探索出来るようになるというのが基本的な流れだ。戦闘はタンク、アタッカー、バッファー、デバッファー兼ヒーラーの４つに別れて戦う仕組みになっており、効率よく連携を取らなければ勝てない仕様になっている。当然、タンクが敵を引き付け、バッファーとデバッファーのサポートを受けつつアタッカーが火力を出すというのが理想の連携なのだが、今はアタッカーのはずのモモイが敵の集団に単身突っ込んでしまっている状態だった。モモイたちのレベルが適正レベルより上なことと、デバッファー兼ヒーラーであるミドリが絶え間なく回復魔法を掛けることでなんとか持ちこたえているが、モモイのHPはみるみる減ってしまっていた。
「しょうがない！　こうなったら一人でも持ってくー！
「あ、ダメ！　おねえちゃ――ん！」
ミドリの支援が届かないところで、モモイが全MPを消費する特大魔法を放つ。そして、瞬く間にモモイは退場していった。
「みんなー！　後は任せたよ！」
携帯ゲーム機を手放したモモイが、残されたメンバーに向けてサムズアップする。ニカッと弾ける笑顔から垣間見える真っ白な歯が輝いていた。
「もう！　お姉ちゃんってば！　お姉ちゃんが死んじゃったら、火力が落ちるじゃん！」
「ですが、モモイの自爆のおかげで道が切り拓かれました！　それに、アタッカーはまだ残っています！　ミドリ、コタマ先輩、ピボットくん！　支援をお願いできますか！？」
残されたアタッカーであるアリスがミドリに加えてバッファーであるピボットくんとコタマに指示を飛ばす。
「オッケー！　集団デバフ、あと７秒で撃てるよ！」
「わかりました。ミドリに合わせて、アタッカーに向けた会心ダメージバフを放ちます」
「では、ワタシは攻撃力バフを！」
全員が作戦が決まる。
「ユズ！　７秒耐えて！」
ミドリが、ユズに向かってゲーム内ボイチャを飛ばした。すると、タンクであるユズがたくさんの敵を躱しながら、ゲーム内チャットのスタンプを押す。このパーティのタンクはユズだ。
今、攻略しているのは木星だ。木となぞらえたのか、敵は巨大なツリーのような化け物で、枝の先々からガスを噴出し、それが雑魚敵となって襲ってくる。絶え間なく敵が現れるため、敵を引きつけるタンクが特に重要な相手だった。
「ユズさん……すさまじいパリイ技術ですね」
ピボットくんがつぶやいた。ピボットくんは口に出さないものの、アストロノーツのゲーム内データを把握していた。アストロノーツのゲームバランスは公にされていないものの、６人以上で敵の攻撃が苛烈化するため、タンクはふたり編成するのが安牌である。だが、ユズはそれを１人で凌いでしまっていた。しかも彼女が使っているのは回避型のタンク。高い回避値と敵の攻撃をはじくパリイが主戦術の難しい性能だ。それをこなしながらチャットも打つ余裕があることに、脱帽していた。
　そして、７秒が経過すると、ミドリが号令をかける。
「よし！　必殺上がった！　マキ、アリスちゃん！　いけるよ！」
「オッケー！　突っ込むね！」
「突っ込みます！」
　マキとアリスが同時に前線へと飛び出る。
このパーティは、アタッカーをふたり積んでいた。ユズがタンクを１人で受ける分、それが可能になったのだ。
　ミドリの支援を受けながら、アリスとマキが果敢に敵を攻撃していく。
「ミド！　ヒール欲しい！」
「おっけー！　ついでに追加のデバフも！」
「ナイスミド！　よーし、EXバズーカ発射―！」
「アリスも！　ビーム発射―！！！」
　マキが必殺技を放つ。マキの必殺技は周りを巻き込む放射型だ。それで雑魚敵を一掃し、無防備になったボスに向けて、単体特化攻撃であるアリスのビームが炸裂する。このボスは雑魚敵とボスのダメージがリンクするタイプの的だった。マキとアリスの必殺技で、残り４割程度だったボスのHPが一気に消し飛ぶ。
　画面にArrival Jupiterの文字が浮かんだ。
「やったー！　クリアー！　みんなナイス！」
木星の攻略が完了した。そんな中、いの一番に声を上げたのはモモイだった。
「ナイスじゃないよ！　お姉ちゃん何もしてないじゃん！」
「そんなことないよ！　
「お姉ちゃんが突っ込まなければもっと早く終わってたけどね！」
「まあまあ、勝てたんだからいいじゃん！」
「それ、絶対お姉ちゃんのセリフじゃないよね！！！」
　まるで第三者的な立場で場を収めようとするモモイに、ミドリが叫ぶ。
「ま、まあまあミドリさん。モモイさんも捨て身の特攻で、攻撃に貢献してくれましたから」
いきり立つミドリを、ピボットくんは困り顔で宥めた。人が争っているところを見るのは苦手だ。
「はあ。そうだね。でも、お姉ちゃん、次からは死なないように気をつけてね」
「はーい。ごめんね」
　門番戦が終わったら、後は自由探索の時間だ。各々好きなところに探索に行くのも、固まって攻略するのもありだ。
「それにしても、アストロノーツってすごいよね。この木星の景色って、ほとんど実物に近いんでしょ？」
　探索の途中、マキが感嘆をにじませた声でいった。
　マキの画面では、空を見上げている。その先では、小さな粒子がぐるぐると周り、衝突し、この世のものとは思えない光景を作り出している。
　木星は地球と比較して、十倍以上の体積を誇るガス惑星だ。様々な物質が常にぶつかり合い、乱気流を起こしている。容量の関係上、その体積をそのまま探索することは出来ないが、限りなく木星に近い光景が美麗なグラフィックで再現されていた。
「だね。確か、世界最高のゲーム開発エンジンで作られてるんだっけ？」
「そうそう。コスモティック・エンジンっていって、アストロノーツを作った会社が独自開発したゲームエンジンだね」
「いいなー。マキ達はパソコンで。ワタシ達はグラフィックとか下げないとやってられないよ」
モモイが嘆く。いくら開発元が高性能なエンジンで高クオリティのゲームを作っても、プレイする側のデバイスが低スペックだったらどうしようもない。マキたちは最高峰のゲーミングPCを使用しているが、モモイたちが使う携帯ゲーム機では限界があった。
「そういえばみなさん。コスモティック・エンジンといえば、それを動かしているスーパーコンピュータ・ゼロが売りに出されるという話は聞きましたか？」
「うん、見たよ。確か、今日の昼から競売(せり)にかけられたんだよね」
「あ、それならあたしも見たよ。すっごいよね。あんなものがあったら、何でも出来るんだろうなー」
　ヴェリタスのメンバーが恍惚とした表情で盛り上がる一方、ゲーム開発部のメンバーは頭にはてなマークを浮かべていた。
「スーパーコンピュータ・ゼロ？　なにそれ？」
　代表して、モモイが尋ねる。
「ミリオンソフト社が出したスーパーコンピュータの一つだよ。コスモテック・エンジンを動かすために必要な物理演算装置でもあるね」
「それが売られるの？」
「うん。世界に３つしかなくて、一つは連邦生徒会が管理してて、もう一つはアストロノーツを作った会社が持ってるんだ。そして、最後の一個がとうとう売りに出されたんだよ」
ハレが指を立てて説明する。
「そうなんだ。アストロノーツを作ったっていうことはすごいコンピュータなんだね！」
「……お姉ちゃん。実はよくわかってないでしょ。まあ、私もなんだけど」
　モモイはあっけらかんとした様子でいった。それに対して、ミドリがツッコミを入れる。
ふたりとも、スーパーコンピューターとコンピュータの違いさえ知らなかった。ハレの説明で伝わったのは、スーパーコンピュータ・ゼロはとにかくすごい希少なコンピュータであるというニュアンスくらいだ。ちなみに、静かに笑顔を浮かべて会話に耳を傾けているアリスも同様の理解度だ。おそらく、ゲーム開発部の面々でヴェリタスと同じ感動を味わっているのは、実際にコードを打ち込んでいるユズだけだ。
「スーパーコンピュータ・ゼロ。確か、３那由他もの計算を可能にする規格外の演算子システムを持っているんでしたっけ。そういえば今朝、先生も感動の声を上げていましたね」
　検索能力で、その性能を把握している。スーパーコンピュータ・ゼロの演算スキルがあれば、ハッキングなんてお手の物だろう。なんなら現実世界を細分なく再現した仮想世界を創り出すことだって可能かもしれない。
「え、先生も見てたんだ？　なんだか意外だね……」
「そんなすごいものを手に入れたら、先生も喜んでくれるのかな？」
　ミドリがつぶやき、モモイがいった。先生の誕生日が近いことを憶えていた。それでふと思いついて口にしたが、ハレは呆れまじりの笑顔を浮かべる。
「面白い発想だね。でも、そんなものをもらっても、先生じゃ持て余すだけだと思うよ」
「え？　何でも出来るコンピュータなんじゃないの？」
「それはそうなんだけど……そもそも、スーパーコンピュータ事態が一個人に扱い切れるものじゃないから。稼働するだけでも莫大な費用がかかるし、設置するスペースも必要だし」
スーパーコンピュータは、高性能なCPUを何万個も繋げることで超高速演算を可能にしたものだ。スーパーコンピュータ・ゼロはその全貌の画像が明らかにされていないが、おそらく想像にも及ばない量の超高性能PCが連結されているはずで、ほんの数分稼働するだけでも莫大なコストを消費する。莫大な資産を持つ大企業でもなければ運用は不可能だろう。
「それにそもそも、競売には世界中の企業が参加します。最終的にどれほどの価格になるか、想像にも及びません」
コタマがぴしゃりといった。
「だね。ミレニアムの全財産を注ぎ込んでも足りないんじゃないかな？」
ハレが捕捉した。いくら彼女でも、ミレニアムが抱えている予算は把握していない。それほど、スーパーコンピュータ・ゼロを手に入れるというのは雲を掴むような話だった。ただ、その反面で、やっぱりハッカーとしては夢見ざるを得ない。特に、真理を追い求めるハレにとって、スーパーコンピュータ・ゼロを自由に使えたなら、それこそ夢のような話だ。
「……でも、あんなものがあったら、それこそゲームの世界じゃなくて、本物の宇宙の真理も、紐解けるんだろうな。そう考えると、すごく夢はあるよね」
　心の欲望を抑えきれないように、ハレは染み染みと口にした。彼女にしては珍しいぼやき方だった。
　決して付き合いが長いわけではないピボットくんがそう思ったのだ。マキやコタマは、さらにそう思っただろう。事実、それを証明するようにふたりとも、意外そうな目をハレに向けていた。
「宇宙の真理ですか……確かに、それは私も気になります」
遅れて、コタマもハレの言葉に追随する。同じ真理を追い求めるものとして、ハレの気持ちは理解できた。
「うん。アストロノーツは宇宙を旅するゲームだけど、本当の宇宙はどうやって出来てるんだろう。別の世界に繋がってるのかな、それともひたすら真っ暗な空間が広がってるのかな。すごく、気になるな」
　
「まー。私はゲームの世界で十分だけどねー」
モモイが投げ出すようにいったことで、沈黙が破られる。宇宙の真実を暴くなんて、途方もないスケールの話に思考を放棄したようだった。モモイだけじゃない。ミドリもコタマも、誰もが冗談だと思って、話していた。
「……ハレさん」
そのまま話は流れ、別の話題へと移っていく中で、ピボットくんはポツリと誰にも聞こえない声でつぶやいた。ハレが宇宙について話し始めたときから、彼はずっとハレの顔を視界に入れていた。最初から最後まで彼女の横顔は真剣だった。ただひとり、いつか、そこに追いつきたいと本気で思っている目をしていると思った。そんな彼女の横顔から、なぜだか目を離すことが出来なかった。

　それからしばらくして、木星の探索も順調に進み、一旦全員が集まることになった。その後、アリスが見つけたという木星の大型モンスターに挑むことになったのだが。
「ち、ちょっとお姉ちゃん！　だからそこヒール届かないってばー！」
　相変わらずモモイが敵陣の中に突っ込んでいってしまい、ミドリが憤る。
「お姉ちゃん！　さっきからずっと言ってるよね！　アタッカーなんだから無駄に突っ込まないでって！」
「でも、私はアタッカーだもん！　ダメージ出さなきゃでしょ！」
「そうだけど！　でも死んでちゃいみないでしょ！　この際だからはっきり言うけどお姉ちゃん、アタッカー向いてないよ。タンクに鞍替えしたら？」
「……む。そこまで言うなら別にいいよヒールなんかしなくたって！　ミドリのサポートなんかなくても、あたし１人で勝ってみせるから！」
「あっそ！　じゃあお姉ちゃんなんか勝手にやられちゃえばいいじゃん！」
「あわあわ。ふたりとも落ち着いてください」
ピボットくんは実際にあわあわと口に出して、うろたえてしまう。だが、他の面々は日常茶飯事とでもいうかのように、何も言わない。ピボットくんからしてみれば、それも不思議なことだった。実はさっきから、ふたりの小競り合いはちょくちょく起きていた。モモイがあまりにも死んでしまうため、ミドリがつきっきりで介護していたからだ。だが、モモイとミドリの間で、これくらいの小競り合いは実際日常茶飯事だった。それを知っているから、誰もわざわざ止めようとしない。この場に先生がいたとしても、同じ選択をしていただろう。
「ほら。やっぱり死んだ！」
「こ、これは……」
　モモイがタジタジになってしまう。ミドリのサポートありきでなんとか生きていたのに、それを外してしまったのだからある意味当たり前のことだった。
「し、死んだ！　ミドリのせいだよ！」
「なんで！？　私関係ないじゃん！」
その後もヒートアップしていき、とうとう取っ組み合いの喧嘩になってしまう。これには事態を静観していたハレたちも、コンピュータが壊れてしまいそうだからと止めに入ろうとする。だが、それより先に鋭い声が走った。
「いい加減にシテください！！！！」
その場を収めたのは、意外にもピボットくんの怒号だった。たまらず、モモイとミドリも喧嘩の手を止める。
「さっきまで、楽しんでいたじゃないですか。……ワタシは悲しいです」
　ふと、全員の視線がピボットくんに集まった。彼は手を震わせ、訴えるように全員を見回した。
「あ……ご、ごめんね。ピボットくん、ミドリ。ちょっと、熱くなりすぎてたかも……」
「う、うん。私もちょっと言い過ぎた。ピボットくん、お姉ちゃん。ごめん……」
モモイとミドリが手を出し合うのは珍しい。しかし、キヴォトスを俯瞰してみれば、これもまた日常茶飯事だった。特に、頑丈な身体を持つキヴォトス人同士であれば、銃弾が飛び交うことも珍しくない。互いの身体を叩きあうだけなら、ある意味優しいものなのだ。ハレたちがそこまで慌てていないのも、そこに起因する。だが、ピボットくんにとっては違った。彼はキヴォトスの常識を理解したうえで、どうしようもなく争いが苦手だったのだ。
「そ、そんな！　これは、なんで……あ。ああ、もしかして……」
絶望した。この感覚、光景には覚えがあった。ヒマリの研究室でも味わった感覚だ。身体の奥底から良くないものが溢れ出す感覚。人間でいう、嘔吐の直前にも似た気持ち悪さ。そして、あれとは比較にもならないであろう予感。
「みなさん！　逃げてください！　ワタシの身体から──」
アンチプロトコルが放出されます！　そう続けた言葉は、誰の耳にも届くことはなかった。そして、一切の抵抗を許さず、部屋は闇に包まれることとなった。

「……そっか。そんなことがあったんだね」
　部室で起きた騒ぎの詳細を聞いたあと、先生は同乗するようにいった。
　先生にとっても、モモイとミドリの喧嘩は見慣れたもので、わざわざ止めるものでもないという認識がある。だが、ピボットくんにとってはそうでもない。彼は優しい性格だ。だからこそ、それが裏目に出てしまったのだろう。
「……私の不注意でした。ピボットくんはアンチプロトコルの件で、不安定でした。もっと、彼の心に気を配るべきでしたね」
ヒマリが悔しそうに言った。彼女はどこまでも、ピボットくんをロボットとして扱っていた。それが、この現状を招いたことを深く反省する。
「ですが、こうなった以上、仕方ありません。ピボットくんはひとまず、私の実験室に来ていただけますか？」
ヒマリがゆっくりと問いかけた。それが精一杯の彼女なりの優しさなのだろうと先生は思った。
「…………すみません。その前に、ひとりにさせてくれませんか」
「……わかりました。では、気が済んだら、ミレニアムタワーの最上階にある生徒会室に来てくれますか。
「ええ。ありがとうございます、ヒマリさん」
　俯いたままお礼を言うと、ピボットくんは先生たちの間を縫って出口へ向かう。
「ピボットくん！」
　先生は呼び止めるように声を掛けた。今、この状態のピボットくんを１人にしてもいいわけがない。そうおもったのだが。
「……お待ち下さい、先生」
　今度はヒマリによって制される。ヒマリとしては、下手に刺激して、再びピボットくんがアンチプロトコルを放出するのを恐れた結果だ。
「ヒマリ、どうして止めるの？」
「今、ピボットくんを刺激するのは得策ではないかと。それに、この棟内に人がいた場合、被害者がいるかもしれません。そちらを探すのを優先するべきでしょう」
ヒマリは冷静だった。先生は自分が熱くなっていたのだと気付かされる。
「……確かに」
「それに、この子達もこのままここに寝かしておくわけにはいきません。どこか、広い部屋に」
「そういうことなら、うちの部屋を使ってちょうだい。仮眠室も空いてると思うから」
「助かります」
「困った時はお互い様よ。それより、ヒマリさん。後で、詳しい説明がほしいわ」
「わかりました」
　短いやり取りを済ませると、ヒマリはエイミに部室で眠っているみんなを運ぶように指示した。
「ヒマリ。私はこの子達以外にも被害を受けた生徒がいないか、確かめに行ってくるよ」
「分かりました。では、ついでに停電被害の範囲も軽く調べて来ていただけますか？　
「いいよ。部室棟だけでいい？」
「いえ、できれば寮の方もお願いします。生徒会室まで被害に遭うほどの規模であれば、寮も無事ではないと思いますから」
「でも、寮に私が入ってもいいのかな？」
「それなら私も行きます。それに、もし被害者がいたとして、2人の方が運びやすいと思いますから」
「ありがとう。助かるよ、ユウカ」
　トントン拍子に話を進めると、先生とユウカは他の被害者を探しに向かった。
「……さて。ピボットくんの暴走がここまでの規模になったとなると、いよいよ猶予はありませんね。といっても、何をしたらいいのか……」
ヒマリは静かに歯噛みした。彼女の言葉に返事はない。エイミもすでにハレとマキを両手に抱え、生徒会室に向かっていた。今、この部室に残っているのはヒマリとハレ、マキ意外の眠り続ける部員だけだ。
「……やはり、ピボットくんのヘイローを破壊するしか選択肢がないのかもしれません」
　この一連の事件に対して、どんな手を打つべきか。倫理観を無視すれば、ピボットくんそのものを破壊してしまうのが最善だ。衝撃で大量のアンチプロトコルが放出される危険はあるが、遥か上空、もしくは遥か遠くの僻地、例えばアビドス区の広大な無人砂漠でひと知れず行えば被害も最小限で済む。
「問題があるとしたら、そこに至るまでの過程でしょうか」
　アンチプロトコルの放出の条件はピボットくんの感情の爆発だ。１回目と2回目の状況と被害規模を比較して、爆発した感情の大きさに比例する可能性が高い。もし、無理やりヘイローを破壊しようとしたら、今以上の悲劇が訪れると見たほうがいいだろう。もちろん、どうしようもない状況になったらそれを実行するのもやぶさかではない。そのための手段もまるで考えていないわけではないが、可能ならもっと穏便に──。
「……私は今、なんてことを考えたのでしょうか」
　思考を無理やり打ち切った。自分の考えていることがおぞましくなった。
　キヴォトスのためにヘイローを破壊させてほしいと頼もうだなんて。あまりにも残酷だ。そんなことをしている場面を見られたら、先生はもちろん、ゲーム開発部やヴェリタスの部員の軽蔑は免れない。当然、自分も含めた上での話だ。
「どうして、開発者はピボットくんに感情なんてものをプログラムしたんでしょうか」
　ヒマリは愚痴をこぼすようにいった。
　感情というのは、AI開発において最も難しい要素の一つだ。ヒマリでさえ完全に再現することの出来ていないそれを開発し、ピボットくんに搭載してみせた彼の開発者の技量の高さが伺える。同時に性格の悪さに嫌気が差していた。特にアンチプロトコルの起爆スイッチをそれと結びつけたところにそれがにじみ出ている。
　そもそも、開発者ななぜ感情なんてものに起爆スイッチを預けたのだろう。単に害を及ぼしたいだけなら、不安定な要素に委ねる必要はない。ただ、開発者自身が起爆スイッチでも用意して、押した瞬間に爆発するように仕込んでおけばいい。それをしないということは、目的は単純な破壊ではないのかもしれない。何か別の思惑があるのか、はたまたこちらが焦る術を見て楽しんでいるのか。悔しいが、後者が目的ならヒマリはそいつの手のひらの上だ。もし、ピボットくんが感情を持たない機械だったならこんな気持ちを抱くことはなかった。破壊する方法、プログラムを無効化することを微塵もためらわなかっただろう。その様子をどこかでモニタリングでもして嘲笑っているなら腹立たしいことこの上ない。だが、それはある意味脆弱性でもある。開発者が自ら(セキュ)の(リ)技量(ティ)に自惚れるなら、それで生じた隙(セキュリティホール)を突くのがハッカーだ。
「しかし、対策を講じようにも、時間があまりに足りません……」
　せめて、もう少し時間があれば、アンチプロトコルの抑制手段を発見することも出来たかもしれない。だが、アンチプロトコルの被害が発生するのが想像以上に早かった。まさか、みんなで楽しくゲームをしている最中に暴走が起きるとは想像していなかった。さらに、今回の暴走でピボットくんは過剰なストレスを感じている。彼が誠実で優しい性格だからこそ、罪悪感と自分への怒りを押しつぶされそうになっている。さっき、一人になりたいと言ったのが何よりの証拠だ。今までのピボットくんは、いつ何時も誰かがそばについていた。それは監視のためだ。そのことはピボットくんも受け入れていたはずだが、その目に耐えきれないほど、ストレスが高まっていたんだろう。今、こうしている間にも彼の罪悪感は限界を突破し、ミレニアムひいてはキヴォトスが滅びるかもしれない。もし、ピボットくんが完全に自分のメンタルをコントロールすることが出来たらなら幾分猶予もできるだろうが。
「それを押し付けるのは酷な話ですね」
　ヒマリはため息をついた。自分は比較的メンタルコントロールは出来ていると自負している。しかし、こうした現状に怒りと焦りを抱いてしまっている。超天才である自分にさえできないことを、ピボットくんに押し付けるのは酷だ。
　感情を完璧に制御するなど、永遠に不可能だ。
　となると、短い猶予で対策を完成しなければならない。アンチプロトコルの抑制どころか、どうしようもなくなったときの最終手段も形にできていない。自分一人でやるのは難しい。せめて、自分と同等の実力者がもう一人いれば……。
「……リオに協力を求めるべきでしょうか。いえ、ありえませんね」
　自分と同等以上の実力を持つ人物を思い浮かべ、すぐに首を振る。リオは確かに実力があるが、だめだ。先刻の会話で、リオはアンチプロトコルを有効活用するべきだと言っていた。完全に封印するつもりのヒマリと違い、リオハコントロールしようと考えている。その認識の違いは、後々になって必ず不利益を生み出す。かといって、リオを説得する自信はない。無論、時間も。
　強く、拳を握りしめる。
　エイミが戻ってきたのだろうか。拳の力を抜き、ゆっくりと入口に向き直る。
「戻ったのですね。エイ……ミ？」
ヒマリは目を見開いた。

「……やあ。おはよう、部長」
　エイミの隣に、ハレが立っていた。
「ハレ！？　どうしてここにいるのですか？」
「なんでって、目が覚めたらなぜかエイミに運ばれてたから、歩いて帰ってきたんだけど」
「そうではなくて、そもそもどうして歩けているのですか？」
「それはわからないけど…………でも、痛いところとか、体調不良は特にないよ？」
　ハレは自信満々に言いながら、手をグーパーさせる。
　本当に何ともなさそうな様子に驚愕しながら、ヒマリは室内を見回した。ソファの上ではゲーム開発部やヴェリタスの残されたメンバーが横たわっている。彼女達は、ここからミレニアムタワー高層まで及ぶ規模のアンチプロトコルをこの距離で浴びたのだ。当然、誰も目を覚ます気配はない。
「ハレ。あなたは意識を失う直前、ここでマキやコタマたちと一緒にいたんですよね？」
「うん。みんなで新作ゲームをやってたんだけど、急に意識が途切れて……気づいたら、エイミに運ばれてたよ」
「そんな……ならば、アンチプロトコルを間近で浴びたはず。それにしては、あまりにも目を覚ますのが早すぎるのでは？」
　ヒマリは時計を確認した。まだ、アンチプロトコルが暴走してから1時間も経っていない。間近で浴びたにしては、あまりにも復活が早すぎる。
「……まさか、ハレはアンチプロトコルに耐性がある？」
　光明が見えた気がした。ヒマリは呟き、期待と焦燥を孕んだ目をハレに向けた。
「……アンチプロトコル？　なにそれ？」
　首を傾げるハレを見て、そういえばアンチプロトコルのことを説明していなかったと思い出す。
「それは…….おいおい話しましょう。とりあえず、メディカルチェックをさせてください」
「メディカルチェック？　別にいいけど、多分何ともないと思うよ？」
「それでも、調べなければならないのです。ああ、血も取らせてもらいますが、ご了承ください」
「えー、血も取るの？　うぅ、やだなぁ」
「我慢してください。これはキヴォトスを救う希望の光となるのかもしれませんから」
　ヒマリは嫌がるハレを連れ、保健室へと連れていこうとする。
「部長。私は残りのみんなを運んでおくね」
「エイミ、お願いします。運び終わったら、生徒会室で待っていてください。ピボットくんが来るかもしれませんから」
「おっけー」
　エイミは出て行った2人の姿が見えなくなると、静かに眠る才羽姉妹を米俵のように抱えて、再び生徒会室へ向かった。

（先生もアンチプロトコルの耐性を保ってる。じゃなきゃ、ユウカといたとき、少なからず影響を受けていたはず。そんなことにも気づかないなんて……）


コノヘンファイン。ヒマリは完全にピボットくんのヘイローを破壊するしか道はないと思ってる。だから、彼が戻ってきたらお願いするつもり。（だけど、苦しい。あんな誠実な子に、死んでくださいとお願いするなんて、何で残酷なことをしようとしているのか）かといって、無理やりするとアンチプロトコルの暴走が怖い。ピボットくんの善性に頼ろうだなんて、最低だ。　その後、ハレの血を摂取。ピボットくんは、逆。ヘイローを破壊して欲しい。だけど、待って。その前に、ハレの夢を手伝いたい。
その後、ハレは離脱。ひまり、ハレの血から作った抗体（万能ではない）で、ピボットくんと戦う。
トジマリファイン


「……っ」
部室を飛び出したピボットくんは、当てもなくミレニアム構内を徘徊していた。体を動かしていないと、ストレスで体がどうにかなってしまいそうだった。
　アンチプロトコル。
歩きながら、自分の中に眠る厄介な力について、考える。アンチプロトコルというのはヒマリが名付けたものだが、昔からそう読んでいたようなやけにしっくり来る感覚があった。この感覚をなんと言い表せばいいのだろう。少し考えただけで、ある言葉が浮かんできた。これは人間でいう、デジャブというやつらしい。
ピボットくんにとって、検索やハッキングという行為は人間にとっての思考と変わらない。例えば人がご飯を食べる2本の棒をなんて言うんだっけ。そう問いかけられたら、無意識に箸という単語を思い浮かべるだろう。それは自分の知識から箸という単語を検索していることになる。また、難しいことや忘れかけていたことを思い出そうと必死に考えるとき、無理やり引き出そうと働きかけている。それは言い換えれば自身の脳にハッキングをしかけているともいえる。要は知識を引き出す場所が脳内ではなくサーバー等のデータ機器であるだけだ。ピボットくんと人間の思考の違いはそれだけだ。
もっとも、それだけでも機密情報や　問題はそれをするために必要な電波だ。アンチプロトコルはあらゆる物の電磁波を無効化する電波だとヒマリが言っていた。
それは当然、人にも及ぶ。人の動きにはすべて、電気信号が関わっている。それが停止するということは、命が終わるということである。だが、キヴォトス人に至ってはその限りではない。彼女たちの場合、ヘイローさえあれば、命だけは守ることが出来るのだという。アンチプロトコルを受けたヒマリやハレたちに息があったのはそのおかげだ。つまり、もしあの場に先生がいたとすると……。
「……やっぱり、ワタシは大人しく死ぬべきなんでしょうか」
だろうか、じゃない。それが最適解だ。それは気づかないふりをしていただけで、それはピボットくんもわかっていた。それでも、死にたくない。みんなと、別れたくない。今日やったアストロノーツも楽しかった。もっと、もっとみんなで楽しみたい。
「先生やみんなと……離れたくないです」
ピボットくんは窓ガラスに手をついて、静かにつぶやいた。目を瞑れば、まぶたの裏に浮かぶのはハレ達の顔と先生の姿、そして今日であったゲーム開発部の弾けるような笑顔だ。
　初めて妖怪マックスを飲んだとき、コタマとマキが初対面でもあっさりと受け入れてくれたとき、先生の部屋でコーヒーを淹れてもらったとき、今日みんなでアストロノーツを遊んだとき。鮮明な映像が早送りで次々と流れていく。このデータを消すのはあまりに惜しかった。自分が消えてしまったほうがいいと理屈ではわかっていても。
思考を止めると、どうしようもなく泣きたい気分になった。でも、泣けない。どうやら自分は涙を流せるようには設計されていないらしい。試しに余った手で、目をこすってみる。嗚咽を漏らしてみる。ただ、虚しいだけだった。
「……ロボットの割に随分と人間らしく振る舞うのね」
　突然かけられた声にピボットくんは驚いて振り向いた。人の声だったが、声がした方向に人の姿はない。代わりに手のひらサイズの小さなドローンが浮かんでいた。
「……あなたは？」
　ピボットくんは警戒して下がった。ただし、警戒したのは自分に対して。アンチプロトコルでドローンにダメージを与えるのを恐れたのだ。
「怪しいものじゃないわ。私はミレニアムの学生の調(つか)月(つき)リオ。それ以上はわざわざ言わなくてもいいわね。あなたなら知ろうと思えば簡単に検索できるでしょう」
一方、ドローンは臆することなく近づいてくると、名を名乗った。
「……あなたは何者なんですか」
　リオは、ピボットくんのハッキング能力を知っている。ピボットくんはますます警戒心を強めた。厳しく口調で問いかける。
「それを知りたいなら、ミレニアムのサーバーをハッキングすればいいわ」
　リオはハッキングをしてみろ。と言わんばかりの態度で突き放す。どうやら、こちらが何を言っても向こうから情報を出すつもりはないようだった。
「なら、知らなくても構わないです」
　ピボットくんも、相手の素性を特定するのは諦めた。ここでハッキングするのは、なんだか負けたような気がして嫌だった。
「そう。好きにすればいいわ」
　リオは冷めた声でいった。声だけで、顔も見えない相手の表情が浮かぶようだった。きっと、何の感情もない表情をしている。
　なにはともあれ、これ以上リオと関わるのは止めたほうがいいと体が訴えていた。ピボットくんは無骨に「では、急いでいますので」といって、踵を返した。
「待ちなさい」
だが、先回りされてしまう。ピボットくんは睨みを利かせて、腕を突き出した。これ以上関わるなら本当にハッキングするぞ。という意思表示だった。
「……私のドローンの電磁波を無効化する気かしら。このドローンは表面の大部分を絶縁体で覆っているけど、スピーカーやアンテナ部分は流石に覆いきれない。私に抵抗の術はないわね」
　リオは淡々といった。ピボットくんは仕方なく、腕をおろした。今のやり取りで、脅しは利かないのはわかった。それより、リオの言葉に引っかかる部分があった。
「どうして、そんなことまで……」
引っかかった部分を、問いかける。リオはハッキング能力は愚か、アンチプロトコルの存在とそれを緩和する術まで知っているようだ。そのことは自分とヒマリ、エイミしか知り得ない情報のはず。そこから推察できるとしたら。
「もしかして、ヒマリさんのお友達ですか？」
「……それは、ハッキングで知ったのかしら」
「いえ。少し考えれば分かることです。機械を絶縁体で覆えば、ある程度ワタシのハッキングを無効化できるというのは、ヒマリさんくらいしか知らないことですから」
「なるほど。ハッキング能力だけでなく、洞察力まで備えてるのね」
　リオは感心したようにいった。彼女の話し方や態度は実験台を前にした研究者のようだと思った。さっき、脅しを掛けたときもそうだ。ドローンのひとつやふたつ、壊されても構わないと思っているかのようだった。あるいはする気がないことを見抜いていたのかもしれないが、彼女にとってロボットというのは替えの利く道具程度の認識しかないのだろう。まさに似たようなことで悩んでいただけに、リオの態度が余計に勘に触る。。
「だけど、残念ながらヒマリと私は友達だなんて気安い関係ではないわ」
「じゃあ、どんな関係なんですか」
「さあ。少なくともヒマリは、最も嫌いな人物を聞かれたら、間違いなく私の名を挙げるでしょうね」
　そっけない言い方だった。おそらく、リオはヒマリのことはなんとも思っていない。ヒマリが一方的に嫌っているのだろう。と、ピボットくんは推察した。同時にリオを好意的に思う人は少ないだろうとも思う。こうして軽く話しただけでも、リオの知能の高さは伺える。しかし、歯に衣着せて弄するような物言いは激しく気に障る。ヒマリも回りくどい話し方をする方だが、ヒマリとリオから感じる印象は真逆だ。
「それより、何の用ですか。こうしてワタシに接触してきたのなら、用があるのでしょう」
「ええ、あるわ。でも、意外ね。てっきり、話を聞いてもらうには、もっと交渉が必要かと思っていたのだけど」
「いいから、話してください。どうせ、聞くまで後をつけてくるつもりなんでしょう」
　ピボットくんは大げさなため息を吐くと、投げやりな気持ちでそういった。
「……ヒマリに聞いていたとおりね。ハッカーなら誰もが羨むような能力の持ち主だけど、本人はそれを行使する気がまるでないのね。私なら有効活用してみせるのに」
「………………いい加減にしてください。こんな力、どうやって有効活用しようというのですか」
　震える怒りを必死に封じ込める。感情を抑制しなければ、またアンチプロトコルが溢れてしまう。
「色々あるわ。例えば、恐ろしい兵器の悪用を防ぐとか、完全に破損してしまったHDDのデータを取り出すとか」
　確かにやろうと思えば可能かもしれない。
「簡単に言いますね。ですが、ヒマリさんから色々聞いているなら、アンチプロトコルの暴走条件が感情というのもご存知では？　……ワタシは感情を完璧にコントロールする自信なんて、ありませんよ」
　現に、こうして話している間にも不満やイライラが抑えきれていない。
「……それも、対策を考えればいい。例えば、手術のような外科的な手法で感情を抑制するとか」
「つまり、それは感情を消してしまうということですか？」
「極端に言えばそうなるわね」
　恐ろしいことを淡白に口にするリオが恐ろしく見えた。
　感情を消すということは、ヴェリタスや先生と話していても、何も感じない。みんなでゲームをしていてもまるで楽しいと感じないということ。それだけじゃない、怒りも悲しみも何も感じることが出来ないのなら、それはつまり、死と変わらないんじゃないだろうか。しかも、亡骸を活用されるくらいなら、普通に死にたいと思うのは傲慢な気持ちではないだろう。
「……もちろん、それはあくまで極論のひとつ。私はそんなことをするつもりはないわ」
ピボットくんが反論を口にする前に、リオはいった。
「じゃあ、あなたは何をしようとしているのですか？」
「……ヒマリがあなたのヘイローを破壊する方法を私に聞いてきたわ」
「…………っ！」
　ピボットくんは息を呑んだ。
　ヒマリもそれを考えているのは薄々察していた。だが、こうしてそのために動いていたことを知るのはショックが大きかった。
「そう、ですか」
　やっとのことで絞り出した声は、苦しさが滲んでいた。
「ええ。ただ、ヒマリにしては珍しく焦っているみたいだったわ。あなたの力を過剰に恐れて、正常な判断力を失っているように見えた。だから、教えはしなかったけど……」
「ということは、リオさんはヘイローを破壊する方法を知っているのですか？」
「ええ、知っているわ。どんなふうにやれば最も効率よく破壊できるかも、研究していたから」
　リオの声色が僅かに濁ったことに気付けなかった。
「でも、私は安易にその手段を取るべきではないと思っている。そんなことをしなくても、もっと別の方法はあるはず。だから、こうしてあなたに会いに来たの」
「不可能です。ヒマリさんがそのような結論を出したのですから、打開策なんてものは……もう」
「それはわからないわ」
　ピボットくんの弱音をピシャリと断ち切るようにいった。
「話が戻るけど、問題なのはアンチプロトコルの暴走にあなたの感情がトリガーになっていることでしょう。なら、そのトリガーを外す、あるいは別のものにすり替えればいい」
「……そんな事が可能なのですか？」
「わからない。でも、不可能とも言い切れない。時間をかけて研究を重ねていけば、感情とアンチプロトコルの暴走の接続を切り離す術が見つかるかもしれない」
「……その時間がないという話をヒマリさんはされたんじゃないでしょうか。ワタシ自身、暴走を重ねるたび、自分のアンチプロトコルが強まっているのを感じますし」
　アンチプロトコルの暴走による影響力は、ピボットくん自身でも把握しきれていない。ただ、計り知れないエネルギーであることだけ、わかっていた。確実に言えるのは、ついさっき起きた程度の暴走はほんの１割にも満たないということと、暴走を重ねるたびにアンチプロトコルの影響力が強くなっていることだ。もし、次暴走が起きて、そのまた次の暴走が起きて……と繰り返されていったら、どうなるかなんて想像もつかない。
「それでも、悠長に研究を重ねる時間があるのですか？」
「それも断言は出来ないけど……もし、あなたがその気になったのなら、何十層もの絶縁体を素材にした研究施設を造るわ。あるいは、宇宙に研究施設を造る。そこなら、たとえアンチプロトコルが暴走したとしても、最低限の被害で済むわ」
「それは……魅力的な提案ですね。ですが……」
　夢物語のようだ。絵に描いたようなハッピーエンドで終わればいいが。どうにも、そう都合よく行くとは思えなかった。
「別に、答えをすぐに出せとは言わないわ。でも、よく考えて決めてちょうだい。実験の道は果てしなく苦痛な道のりでしょうから。重要なのはあなたがどうしたいか。もし、自分の命を断ち切って、綺麗さっぱり全てを終わらせるなら、それもいいわ。でも、どうしても生きたいと思うなら……その時は私のところに来てちょうだい」
話を一方的に打ち切って、リオのドローンはどこかへ行こうとする。
「待って下さい。あなたはどうしてそこまでして、ワタシを救おうとするのですか」
　消えようとするドローンを呼び止めると、ピボットくんは廊下に響き渡るほどの声量で尋ねた。
　リオが自分を救おうとしているらしいことは、話しててわかった。だが、ピボットくんはその善意を信じることが出来なかった。リオと話してて感じたのは、むしろヒマリと同じく危険因子は容赦なく排除するべきという考えを持っていそうな印象だ。彼女の狙いを知らないままでは、到底真面目に考える気にはなれなかった。
「……それは、私がかつて選択を過ったからよ」
　リオはドローンのスピーカーをピボットくんに向けると、悔恨のこもった声で答えた。
「え？」
「昔の私は、危険因子を排除しようと躍起になるあまり、とある人のヘイローを破壊しようとした。…………他の方法があったのに」
それはピボットくんが初めて見る、リオが感情が籠もった声だった。
「………………あの時、もっと違う道を選択できていれば、あんなことにはならなかったのに。後悔しない日はないわ。あえていうなら、それが答えよ」
「……そうですか。今、初めてあなたの本心を聞いた気がします」
「別に、私は嘘なんて吐いていないわよ。ただの一度もね」
そういったリオの声は、元の感情を感じられないものに戻っていた。
「他に聞きたいことはない？　ないなら、私はもう行くけど」
「……大丈夫です。あなたに言われたこと、よく考えてみます」
「ええ。でも、時間が無いのは本当だから、なるべく早めに頼むわ」
そういって、リオのドローンは踵を返し、どこへともなく消えていく。その姿が見えるまで、ピボットくんはその場を動くことができなかった。
 
リオと別れて、しばらく立ち尽くした後、エレベーターを使って生徒会室へと向かった。エレベーターで登っている間も、いつ停止するかと思うと、恐怖でしかなかった。だが、幸いにも以上はなく、人を運ぶ箱は無事に目的地に到着してくれた。いつもどおりに開いた扉の動きに安堵する。エレベーターを出ると、中の様子を窺った。ヒマリたちが待っているはずだが、姿がない。代わりに、窓に手をつき、外を眺めるひとりの少女の後ろ姿が見えた。
「は、ハレさん！？」
ピボットくんは驚いて駆け寄った。
　白い研究者のようなカーディガンにハーフアップに髪を巻いた後頭部は、ここにいるはずのない人物だ。彼女はピボットくんの気配に気づくと、ゆっくりと顔だけで振り返った。
「ピボットくん？　どうしたの？　そんなに慌てて」
　ハレは落ち着いた声で尋ねた。
「だ、大丈夫なのですか？」
ピボットくんはハレの問いかけを無視して、逆に尋ね返した。
「うん。なんだか、私だけ早く目が覚めちゃって」
　ハレはそういうと、窓の外に視線を戻した。首がわずかに上に傾いている。
「そうだったんですか……ワタシはヒマリさんにここに来るように言われていたんですが……」
「うん。ヒマリ部長なら停電現象の被害範囲がどれくらいか、確かめに行ったよ。ピボットくんが帰ってきたら一緒に待ってて欲しいって言ってた」
「……わかりました」
　ピボットくんは頷いた。
　そこから会話が続かなかった。
「…………」
　沈黙が気まずい。ハレが平然としているのが気になるが、それを尋ねることが出来なかった。アンチプロトコルを受けた場合、ヘイローを持っていなければ死。持っていたとしても、体が動かず少量でも丸一日は再起不能になるはずだ。ヒマリやエイミがそうだった。ハレは彼女たち以上のアンチプロトコルを最も近距離で浴びていたのにどうして平然としているのだろうか。気になるが、尋ねることが出来なかった。もしそれを尋ねて、そのことで責められたり何かを言われたりするのが恐ろしかった。
　ピボットくんは肩を強張らせ、そっと窓に手をついた。
　外はいつの間にか雨が降っているようだった。複層ガラスに水滴が張り付き、新たな水滴が現れては元いた水滴を弾き飛ばしていく。空は分厚い雲に覆われ、月を覆い隠していた。
「今日は星、見えないね」
　しばらくして、ハレがポツリと呟いた。
　ただの世間話なのに、ピボットくんは大げさに肩を跳ねさせる。
「そう……ですね」
　深呼吸して、ようやく絞り出せた言葉がそれだけだった。もっと、気の利いた返しができないものかと密かに焦る。しかし、ちらりとハレの横顔を窺うと、彼女はそんなものを求めているようには見えなかった。
「……ハレさんは、星を見るのが好きなんですか？」
　ピボットくんは空を見上げながら問いかけた。
「うん。好きだよ」
　ハレは、うっとりした表情でいった。赤みを帯びた頰は、まるで恋する少女のようだと思った。
「今は見えないけど。空に浮かぶ星が膨大な量の情報を持つとワクワクするし、その真理を解き明かしたいなって思うんだ」
　宇宙の真理。そういえばアストロノーツをプレイしていた時も、そんな話をしていたなと思い出す。ハレにとって、やっぱり宇宙というのは特別なんだろう。
「……まあ、きっと一生かかっても無理なんだろうけど」
　どうしてそんなに宇宙の真理を解き明かしたいのですか。そう尋ねる前に、ハレは苦笑してそういった。ハレの表情は、最初から諦めてるようだった。
「……できますよ」
「え？」
「ハレさんなら、出来ます」
気づいたら、ピボットくんはムキになって否定していた。ハレが呆気にとられたように口を半開きにしている。
「そ、そうかな。ありがとう」
数秒後、ハレは困ったように笑った。
そんなに強く言うことでもなかったかもしれない。それでも言ってしまったのはきっとリオの影響だ。みんなのために死ぬしかないと思ってた。でも、言われてみればヘイローを破壊するしか方法がないと決めつける必要はない。そもそも、ヒマリがヘイローを破壊する手段を取ろうとしたのは、時間がないからだ。だったら、時間を作ってやればいい。すなわち、自分がなるべく感情を波立てないように、平常心を保てばいい。ストレスを上手く流せばいい。なんだ、簡単なことじゃないか。だって、こんなふうに少しハレと話しただけで、安心している。要はこの状態を保てばいいのだから。
そう思うと、俄然やる気が湧いてくる。頑張ろう。死ぬ以外の道を見つけてみせよう。そう、心のなかで強く決意する。
「…………あ」
　瞬間、ハレがつぶやいた。
　生徒会室の電気が突然、消えたからだ。
「そんな！　な、なんで……」
　今、ストレスは感じていない。なのに、どうして？
「……あ！」
　アンチプロトコルの暴走のトリガーは感情だ。いつから、感情が怒りだけだと錯覚していたのか。ピボットくんは気づいていなかった。これまでの２回とも、怒りや不快感がトリガーになっていただけあり、視野が狭くなっていた。気付けなかった。──過度なやる気を出すのも、感情が高まるということに。
ドサ。
隣で、誰かが倒れる音がした。ふと見ると、ハレが窓ガラスにしなだれかかかるように崩れ落ちている。
「ハレさん！！！」
　ピボットくんは膝をついてハレの肩に手を回した。
「ハレさん！　しっかりしてください！」
　ハレは目を瞑っていた。耳をハレの顔に近づけ、呼吸をしているかを確かめた。さっきまで、妖怪マックスでも飲んでいたのだろうか。口元からほんのり甘い香りがする。
「呼吸は……よかった。なんとか、脈はあるようです……」
耳の位置に埋め込まれた音声センサーのおかげで、微かに呼吸音を感じることが出来た。よく見ると、胸もしっかり上下している。一瞬本当に死んでしまったのではないかと焦ったが、杞憂だったようだ。とりあえず、ソファに寝かせないと。そう思って、ピボットくんはハレをお姫様抱っこで持ち上げた。
「ん。んん……？」
不自然なほどに軽い身体をソファに下ろしたところで、ハレがくぐもった声を漏らす。
「ハレさん！」
　ピボットくんはハレの肩に手をかけ、呼びかけた。
「…………あれ？　ピボットくん？　どうしたの？　私、もしかしてまた眠ってた？」
　激しく身体を揺さぶられたハレは、まさに寝起きのように半開きの瞼を擦りながら、ピボットくんに問いかけた。
「って、あれ！？　ど、どうして私お姫様抱っこされてるの？」
「あ、暴れないでください！　これはカクカクシカジカで……」
自分が抱き抱えられていることに気づいたハレが、頬を赤らめてジタバタともがく。そんな彼女を地面に落としてはいけないと、ピボットくんは腰に力を入れて踏ん張った。もっとも、キヴォトス人の肉体強度なら落としたところで怪我することはよっぽどないだろうが、女の子を落とすこと自体なんてあってはならないことだ。
「そっか。やっぱり私、また寝ちゃってたんだ。でも、今回も早く目が醒めたみたいだね」
暴れるハレをなんとか宥め、ソファに座らせた後、アンチプロトコルに触れるのは極力避けて、事情を説明する。
「電気はまだつかないの？」
　ハレは上体を起こすと、部屋の中を見回した。部屋の明かりは全て消えている。頼りになるのは暗闇に慣れた自分の目だけだった。
「そっか。じゃあ、当分はここに閉じ込められたままってことなんだね」
「ハレさん。もう動いて大丈夫なんですか？」
「うん。アンチプロトコルだっけ？　私、それには耐性があるみたいだから」
あまりにもさらっと告げられた言葉に、ピボットくんはドキッとした。
「…………っ！？　ど、どうしてそれを？」
「っ？　ああ。さっき、ヒマリ部長に聞いたんだ。確か、あらゆる物体の電磁波を無効にするんだっけ？　すごい力だよね」
ハレは他人事のように言った。
「そ、そんなことは……ありません。ただ、害悪なだけですよ」
「そうかな。私は使いようによっては、素晴らしい力だと思うけど」
まるでリオみたいなことを言うと思った。ただ、その言い方だとハレはアンチプロトコルが決して制御が利かないものであることは知らないのだろうか。
「でも、確かにパソコンもスマホも使えなくなっちゃうのは困るなあ。電子機器がないと、することがないよね」
「……すみません。ワタシのせいで……」
「ううん、別にいいよ。困ってるのは事実だけど、わざとじゃないなら仕方ないよ。私も寝ぼけてコタマ先輩のPCをハッキングして音声ファイルを一括削除しちゃったことあるし……それより、せめて星でも見えたらいいんだけど……月すら見えないね」
　ハレは微笑を浮かべて優しい声でいうと、ソファから立ち上がり、窓の方に歩み寄った。入れ替わるように、ピボットくんがソファに腰掛ける。
「そうですね。昨日の時点での天気予報は曇りだったはずなのですが……」
　よっぽど暇なのだろうか。ハレは狭い室内を落ち着きなく歩き回りながら、しきりに話しかけてきた。
　そのひとつひとつに相槌を打ちながら、ピボットくんは内心ビクビクと震えていた。
ハレさんは、何を考えているんだろう。アンチプロトコルのこと、どこまで知ってるんだろう。話の内容からアンチプロトコルを生み出しているのがワタシであることは知っているようですが……。しかし、それにしては警戒してる様子や不愉快に思う様子もない。どうしてハレさんはワタシを責めないのだろう。
　不思議に思って見つめていると、突然頭の中に声が流れ込んでくる。
──電力がないってことは、トイレも流れないってことだよね……うう。行きたくなっちゃったらどうしよう……ていうか、結構行きたい……こんなことになるんだったら、さっき起きたばかりで妖怪マックスなんて飲むんじゃなかったな。
「え？」
　今、頭の中で再生された音声。それは間違いなくハレのものだった。今のはハレが口にした言葉だろうか。しかし、それにしては頭の中に直接響いてくるような声だった。
「ピボットくん、どうかした？」
　ぼーっとハレを見つめていると、訝しげな顔で声を掛けられる。
「あ、いえ。なんでもありませんよ。それよりハレさん、さっき、お手洗いに行きたいって言いましたか？」
「え！？　い、言ってないけど……でも、トイレに行きたいのは本当かも。どうして知ってるの？」
「えっと、さっきからソワソワしてる様子なので……」
　歩き回り、口数が多くなっていた理由を把握する。
「うう。バレてたんだ……恥ずかしい」
　頰を赤らめ、その場で後ろを向いて、恥ずかしそうにモジモジとするハレ。彼女の心の声を聞くまで、何も気づいていなかった。自分にとって都合の悪いことを誤魔化すために恥ずかしい思いをさせてしまったことに罪悪感を抱きながら、ピボットくんは自分のしたことに戦慄した。今、ピボットくんはハレの思考をハッキングするつもりなど微塵もなかった。ただ、ハレが自分に対して恐れや怒りといった感情を抱いていないかと震えていただけである。それが無意識にハッキングを行うスイッチになっていたらしい。不思議なのは今になってそんなことが可能になった事実だ。ミレニアムに来てから今日に至るまで、誰かの考えていることを知りたいと思ったことは何度もあった。例えば、警戒心をあらわにしていたヒマリが、自分に対してどのような感情や思いを抱えているのか、何度も気になった。しかし、ヒマリの思考を読むことなんて出来なかった。あるいは本気でやろうと思えば出来たのかもしれない。人体のハッキングなど本気で試していないため、わからない。それよりも、もっと考えられるのは、度重なるアンチプロトコルの暴走で、ハッキング能力が上がっている可能性だ。
　アンチプロトコルの暴走は段階的に強くなっている。アンチプロトコルの制御が利かなくなっている自覚があった。さっきもそう。プラスの感情を抱くことさえダメなら、どうすればいいのだろう。
ピボットくんは固く目をつむり、耳を塞いだ。とにかく今は、少しでも被害を増やさないために感情を一切動かしたくなかった。
「ピボットくん。どうしたの？　頭を抱えて……もしかして、お腹でも痛い？」
　固く目を閉じ、なるべく何も考えないようにしていると、突然ハレに声を掛けられる。耳を塞いでいた片腕が、彼女の細腕で剥がされている。目を開けると、憂いを帯びたハレの顔が目の前にあった。
「あ、あ、あ……」
　──ピボットくん。大丈夫かな？　もしかして、アンチプロトコルの影響を受けてる？
　まただ。また、勝手に頭の中でハレの声が再生される。だが、目の前でうす開きになっている唇は動いていない。
「いえ……そういうわけでは。アンチプロトコルがワタシに影響を及ぼすことはありませんので」
「え？　あ、そ、そうなんだ……」
　──あれ？　私、今口に出してたかな？
　もはや当たり前のように彼女の心の声が聞こえてしまう。
「……すみません。その気がなくても、勝手に聞こえてしまうのです」
「え？　ど、どういうこと？」
「ハレさんが頭の中で考えていることです……どうやら、ワタシはハレさんのことをハッキングしてしまっているようなのです」
「え、えーっと？　ごめん、ちょっと言ってる意味がわからない。私、ハッキングされてるの？」
　ハレはよくわかっていないらしい。困った顔で首をかしげている。
　もう、隠すことは出来ないだろう。
「……ハレさん。ごめんなさい。少し、話を聞いてもらえますか？」
　ピボットくんは覚悟を決めると、重苦しい声でいった。
「う、うん。別にいいけど……どうしたの？」
　ハレはピボットくんから離れると、うなずいた。
「もうご存知だと思いますが、アンチプロトコルはワタシの体内に内蔵されているエネルギーのことです」
　おもむろにピボットくんが口を開いた。
「うん。それは聞いたよ。でも、制御が難しいんだよね」
「………………はい。そのせいで、皆さんには何度もご迷惑をおかけしました。ゲーム開発部とコタマさん達が眠ってしまったのも、今、ハレさんが倒れて部屋の電気がつかなくなっているのも、全部ワタシのせいなんです。ごめんなさい……本当にごめんなさい」
　ピボットくんは消え入るような声で何度も謝罪の言葉を繰り返した。
　かける言葉が見つからないと言った様子だ。
　そんなハレを見ていると、やっぱりこんな話をするべきじゃなかったかと思う。
「……そのアンチプロトコルって、制御が効かないんだっけ？」
　やがて、ハレはそんな質問を口にした。
「……いえ、正確に言うとそうではわけじゃありません。ハッキングや検索などをするため、ある程度の融通は効きます。ですが、感情が昂ったりすると制御が効かなくなって、暴走してしまうのです。さっきのように……」
「……感情？　感情がアンチプロトコルの暴走のスイッチになってるってこと？」
「はい。ヒマリさんに調べてもらって発覚しました。実際にアンチプロトコルが暴走した時、ワタシの感情は激しく昂っていました。一度目はヒマリさんと口論になった時。二度目はミドリさんとモモイさんの喧嘩を止める時、三度目は……ハレさんとお話ししてる途中、頑張ろうと思った時でした」
「……そっか。ネガティブな感情だけじゃなくて、ポジティブな感情でもダメなんだ…………それは辛いね」
　ハレは静かな声で言った。彼女は決して感情表現が激しいわけではない。それでも、嬉しい時は笑うしムッと来た時には顔をしかめることもある。それらを封じ込めなければならないピボットくんの苦悩を思うと、同情する気持ちを抑えきれなかった。
「私はアンチプロトコルのことはよくわからないけど、それって抑えたりする方法はないの？　その、怒ったりとか笑ったりするのを無理やり止める以外で」
「分かりません。ヒマリさんも手を尽くしてくれていますが、いまだに光明は見えないままです。だから……」
　自分のヘイローを破壊して、終わりにしようとしたんです。そう言いかけてやめた。
　死のうと思ってたなんて話をしても、ハレを困らせるだけだ。そしてなにより、そのために協力してもらうことになるであろうヒマリにまで悪印象を植え付けることになりかねない。
「だから、このままひとりで、誰のいない場所に消えてしまおうと思ってたんです」
「そっか」
　ピボットくんはかなり遠回しな言い方をして、なんでもないことのように笑ってみせた。消えるという言葉。頭の良いハレはあっという間に真意を見抜いた。そして、ピボットくんがそれを隠そうとしていた意図すらも半分察して、あえてそっけない反応をしてみせる。
「でも、ヒマリ部長なら光明は見えてるんじゃないかな」
「え？」
「さっきも言ったけど、私はアンチプロトコルに耐性があるみたいだから。それを足がかりにアンチプロトコルをなんとかできるかもって言ってたよ」
　呆然とするピボットくんに、ハレはゆっくり言い聞かせるようにいった。それから、服の袖をまくって素肌を曝け出した。
「さっき、採血されたんだ。私の血で何かするつもりみたいだよ、ヒマリ部長は」
　心配になるほど細い腕。肘と手首の中間に小さな正方形のガーゼが貼られている。時間が経ったからか、うっすらと滲んだ血が茶色に変色していた。
「ハレさんの……血で？」
　ハレの腕に視線を注ぎながら、ピボットくんはわなわなと言葉を震わせた。
　不思議に思っていたが尋ねられなかった、ハレがアンチプロトコルを浴びても異常に目覚めるのが早い理由はアンチプロトコルに耐性があったかららしい。
「うん。私の血を採って、軽い健康診断みたいなことをしたら、大慌てで自分の研究室に向かったよ。私は血を抜かれたのと、ピボットくんが来るかもしれないからここで待っててほしいって言われたけど」
「そうだったんですね」
　おかしいと思った。部室でのヒマリは、覚悟を決めた表情をしていた。あれは最終手段であるヘイローの破壊を決断した瞬間だと思った。わがままを言って一人になったのは、高ぶる罪悪感を抑えるのが主だったが、覚悟を決めるためという理由もあった。危険因子であるはずの自分を野放しにして席を外している。つまり、その分だけハレの血液に希望を見出しているということではないのだろうか。
　正直、手放しに喜ぶには不確定な要素が多すぎる。そもそもハレが本当に耐性を持っているかもわからない。あくまでその可能性が高いだけで、他の要素が介入した可能性も十分にある。当然、その可能性はヒマリもわかっているはず。だから、血液という情報の塊から、その秘訣を探そうとしているのだろう。そしてもし、アンチプロトコルに対抗する成分のようなものが見つかったら、それを使って対抗薬でも作れるかもしれない。
「だ、ダメです。喜んでは……喜んではいけないのに──」
　ハレの言葉によって、希望が湧いてきてしまう。それに伴う感情の流出を頭を抑え、必死に防いだ。だが、生きられる可能性がある。命を持つあらゆる生命にとって、これ以上ない希望による喜びを押さえつけることなんて、出来るはずがなかった。
「……ハレさん。ワタシから離れてください」
「っ？　なんで？」
「……何度も暴走したおかげでしょうか。なんとなく、やばいという感覚が分かるようになりました。これ以上、ワタシが嬉しさを感じてしまうと……きっと、アンチプロトコルが暴走します」
　ピボットくんは震える声でハレに離れるよう促した。
　暴走の予兆がわかっていても、それがどれほどの規模かまではわからない。一度目の暴走で、絶縁体に覆われたカメラの機能さえ奪ったように。ハレの耐性も貫通して、永遠に眠らせてしまうかもしれない。そんなことになったら、罪悪感という絶望を抑える自信がなかった。だから遠くに逃げてほしかった。少しでもアンチプロトコルの魔の手から逃げられるように。しかし、ハレはその場を動こうとしなかった。それどころか、ピボットくんの姿をじっと見つめると、近づいてきた。
「ピボットくん……大丈夫だよ」
「は、ハレさん！？　ど、どうしてわざわざ近づいて……」
「私なら大丈夫だから。喜びたいなら、喜びなよ」
　そっと隣に腰を下ろしたかと思えば、ハレは微笑んだ。
「ハレ…………さん？　ダメです。アンチプロトコルはハレさんが思ってる以上に危険なものなんです！　近くにいるであろうヒマリさんや先生も、すでに隣の部屋で眠っているゲーム開発部やヴェリタスの皆さんも、ハレさんだって深刻な影響をうけるかもしれません。もう2度と、目が醒めないかも……」
　ピボットくんは危機感を煽るような口調で言った。しかし、ハレがそれを真に受ける様子はない。いつアンチプロトコルがいつ放出されようと、意に解さぬと言った様子だ。
「うーん。確かにみんなに影響があるのはダメかもだけど…………でも、大丈夫だよ。私なら２回アンチプロトコルを受けても割と早めに目覚めてるし。それにヒマリ部長、私の血を使えばアンチプロトコルに対抗する薬を作ることができるかもって言ってた」
「それは……もしそうだとしても、今ヒマリさんが動けなくなってしまったら、意味がないじゃありませんか」
「まあね。でも、もしヒマリ部長が眠っちゃっても、私が研究を引き継ぐよ。流石にヒマリ部長ほどじゃないけど、私も少しはそういう知識を蓄えてるから。きっと、何か対策は見つけられると思う」
「ですから……そもそもハレさんが目覚めなくなる可能性もあると言ってるじゃないですか」
「うーん……それは大丈夫じゃない？　だって、さっきのアンチプロトコルも結構凄いやつだったんでしょ。私はそれを間近で受けてもセーフだったんだから、きっと大丈夫だよ」
「そんな……なんで、その程度の根拠で言い切れるのですか」
「まぁ、確かに絶対とはいえない。でも、仮にそうなるとしても、どこに逃げればいいの？　エレベーターは止まっちゃってるし、この高さじゃ階段もないよ」
「それは……そうですが」
　ハレの言葉は至って正論だ。直前にあったアンチプロトコルの暴走のせいで、周囲の電子機器は一切動いていない。ミレニアムタワーは敷地の中央にそびえ立つ高層ビルだ。低層までなら階段もあるが、生徒会室がある高層には専用のエレベーターしか移動手段がない。
「それに、泣いてる友達を見捨てて自分だけ逃げるなんて、嫌だよ」
「……ワタシが、泣いてる？　おかしなことを言いますね。ワタシに涙を流す機能はついていませんよ」
「そうなの？　でも、なんとなく分かるよ。ピボットくんが泣いてることくらいは」
「……それもまた、根拠のない話です」
「そうだね。でも、今までたくさんのプログラムを組んだり機械に触れてきたからかな。だからあえて根拠を挙げるなら経験則が根拠だよ」
　ピボットくんがどれだけ冷たく突き放すように言っても、ハレは微笑みを崩さなかった。自分が泣いてるとか、そんな話はどうでもいい。
　──ワタシはただ、この人を傷つけたくないだけなのに。
「どうして……どうしてワタシにはこんなものがあるんですか。ワタシはみなさんと、楽しく過ごしたかっただけなのに！　どうして、ワタシにアンチプロトコルなんてものを、感情なんてものを搭載したのですか！」
　もはや激動するアンチプロトコルの爆発を、どうしようもないことはわかっていた。それでも頭を抱えたまま、ピボットくんは誰かもわからない生みの親に叫んだ。
「ピボットくん。そんなこと、言っちゃだめだよ。感情なんて、なんて言わないで」

「それに、ヒマリ部長のことを思い浮かべてみてよ。あの人も生まれつき病弱で歩くことも出来なかったけど、この学園で誰よりもいきいきしてるし。それって、精一杯抗った結果でしょ」
「それは、そうですが……ワタシとヒマリさんは違います」
「そうだけど。でも、ピボットくんだって、きっとあんなふうに出来るよ。ていうか、私がなんとかしてみせるから。だから、泣きたい時は思いっきり泣けばいいし、笑いたい時は本気で笑っていいんだよ」
「それは……本気で思っているんですか？　ワタシのことを怖いとか、気持ち悪いとか思わないんですか？」
「そんなこと思わないし、さっきの言葉は本気だよ。疑うなら、私をハッキングしてみなよ」
「……そんなこと」
　ハレは自信のこもった目を向ける。そんな目を見せられてしまったら、ハッキングなんてすることが失礼だと思わされる。ハレの真っ直ぐな気持ちを疑うなんて行為、したくなかった。
「どうして……ハレさんは怖がらないんですか。気味が悪いと思わないんですか！」
　この期に及んで、ピボットくんは叫ぶように訴えかけた。もう、いつアンチプロトコルが暴走してもおかしくない状態だ。その時が来るまでの残り少ない時間。こんな会話で終わらせていいのかと頭の片隅で考えている。しかし、こんな状況で有意義な会話なんてあるだろうか。そんなものは無いこともわかっていた。
「思わないよ。それよりむしろ、謝りたいくらいだよ」
「え？」
「ピボットくん。私ね、この世界の真理を解き明かしたいんだ」
「この世界の真理……ですか？」
　ピボットくんは尋ねた。ハレが宇宙の真理を解き明かしたいと口にするのは度々聞いていた。だが、世界の真理というのは初耳だ。世界の真理って、なんのことだろう。しかし、今はそれを確かめる余裕も時間もなかった。
「うん。実は私、ピボットくんのハッキング能力を応用したら、そのために使えるかもなんて考えてた。ピボットくんがそんなに悩んでるって知らずに。だから、ごめんね」
「どうして……そんな……本気で言っているんですか？　悪いのは全部、ワタシなのに……」
「さっきからずっと、私は本気だよ。それに、ピボットくんが全部悪いなんて、そんなことはない。本当に悪いのは、アンチプロトコルなんてものを悪用した人。それをピボットくんの体の中に埋め込んだ人だよ」
　温かい吐息を吹きかけるように言いながら、ハレはゆっくりとピボットくんの身体に手を回した。華奢な彼女の腕は、ピボットくんの身体に回すだけで精一杯の長さだった。その分、身体が密着する。見た目で想像する以上に柔らかい感触だった。
「ハレさん……」
もう、抑えることはできなかった。そんな優しさを与えられてしまったら、嬉しいという感情を抑えられるはずがない。
　ピボットくんの体が白く光る。世界は目一杯のアンチプロトコルに包まれようとしていた。
……ありがとう、ございます。
最後に告げられた言葉は、意識を失う寸前のハレの耳に、余韻のように響いた。


第3章　あなたのためのルバート


届かない。何度やっても届かない。
　彼女は歯噛みした。誰もいない孤独の研究室。世界でたった一人の彼女は一心不乱にモニターに向かっている。もう、何日、何十日も眠っていない。最後に眠った瞬間はいつだったか。ずいぶん前に忘れてしまった。憶えているのはキーボードを叩く音が絶えることなく響き続けていたことだけだ。世界が終わりを告げたあの日。全ての電子機器、生命が活動を終えたのが、もう何十年も前のことのように感じる。
「……もう、流石にダメかな」
少女は諦めたように呟くと、キーボードの上に置いた手を止めた。溜まっていた疲れがどっと押し寄せてきて、たまらず背もたれに身体を預ける。そして目を瞑った。しかし、眠くはない。身体的な疲労もない。疲れの原因はほとんどが精神的なものだ。360度、部屋を覆うように展開する巨大で多数のモニターと、強く光るヘイローから差す輝きが薄いまぶたの皮を貫通して、目に刺さる。
「このプログラムには……致命的な欠陥（バグ）がある。これをなんとかするまで、どれだけかかるかもわからない。それなのに、時間がない……あれが私の体を蝕むまで、もう幾ばくもない。……仕方ない。もう、こうなったら来世の私に託すしか……ない、かも」
　彼女は強く唇を噛むと、席を離れた。そして、部屋の隅で壁にもたれかかるように目を瞑っている先生の元へ歩み寄る。ガラガラと、床に散らばった缶が転がる音がした。
「先生。勝手で悪いけど、これ借りるね」
　彼女は先生の懐からタブレットを拾い上げ、起動した。シッテムの箱のログイン画面が映る。
　通常、先生以外の誰が触っても、それは絶対に起動することはない。絶対的な権力を持つ連邦生徒会が手を尽くしても無駄だったのだ。それもそのはず、シッテムの箱の鍵にはキヴォトスの外の理が応用されている。要するにキヴォトスに生まれ育った存在には、開けることができない鍵なのだ。
　しかし、彼女にとって鍵なんてものはあってないものだった。たとえそれがキヴォトス最高のセキュリティでも、誕生日で綴られたパスワードでも同じことだ。
　操作しながら、席につく。しばらくすると、空に置いた右手にひとりでに降ってきたケーブルをシッテムの箱にはめ込む。席の目の前に存在する一際大きなモニターに表示された無数のソースコード。再び手を動かし、シッテムの箱とリンクさせる。
…………………………………………。
………………………………。
………………………。
………………。
…………。
……。
「よし。RAPプログラム設定完了。目標地点の座標も間違っていない。仮想空間でのシミュレーションもバッチリ。成功確率は推定100パーセント。あとは起動さえかければ全部が終わる……いや、この場合、続くって言ったほうが良いのかな。まあ、どっちでもいいや」
　長い時間を掛けて作業を終えると、少女は気だるげに呟いた。
「今日も……雨が降ってるんだ」
少女はイスに深く座り直すと、手元のボタンを押して、天井のハッチを開けた。一体何日、何ヶ月、何年ぶりの空だろう。知覚できない時間ぶりに見上げる空は、故障したモニターのように真っ暗だった。
「今日も……星が見えないや」
　彼女の脳からはもはや時間という概念さえ消え失せていた。今が何時何分で、夜か昼かもわからない。空が暗くても時間を求める条件として当てにならない。それが、今の世界の心理だ。
「次こそは…………晴れるといいな」
　感情の見えない表情で呟くと、少女は空を見上げたまま、キーボードのエンターキーを押した。


目を覚まして一番最初に感じたのは硬い感触だった。
「ん……ここは？」
体が痛い。どうやら、床にそのまま寝かされていたようだ。白衣の埃を払いながら、ハレは立ち上がる。
「こ、これは……なに？」
　周囲を見回し、目にしたいとも不思議な光景に、ハレは目を疑った。
　彼女が寝かされていた空間は、箱のような正方形の空間だった。広さは体育館くらいはある。それにも驚きだが、もっと驚きなのは壁、天井、至る所に張り付けられた無数のモニター。正面には３０インチはありそうな大きめのモニターと、その周囲に４つ、１５インチ程度の小型モニターが取り付けられている。デスクやイス、キーボードの出力機器等も全て揃っていることから、ここがメインコンソールらしい。広大な設備の無駄遣いとしか思えないレイアウトにハレは目を奪われる。だが、すぐにその目も、もっとインパクトのある光景に引っ張られた。
「あれって……ウソ？　これって、スーパーコンピュータゼロ？」
作業スペースからみて、反対側のスペース。そのほとんどは無数のパソコンが並べられている。それらは最初別々の端末なのかと思ったが、よく見ると専用のハードウェアで連結されている。その構造はテレビに映っていたスーパーコンピュータゼロと同じだ。
「どうして、スーパーコンピュータがここに？」
　首をかしげる。ふと顔を上げると、またもやとんでもないものが視界に飛び込んできた。
「あれは……ピ、ピボットくん！？」
　ゼロを構成する大量のスーパーコンピュータの群れ。その最奥にピボットくんの姿があった。ピボットくんは奥の壁の盛り上がった部分に座っている。だが、見えるのは身体の一部分だけだった。全身がケーブルに繋がれ、それら全てが無数のモニターとゼロに繋がっていたからだ。
「どうしよう！　まずは助けないと！」
ハレの目にはピボットくんが拘束されているように見えた。助けないと、という気持ちが先行して、足を踏み出す。しかし、それは許されなかった。
「な、なにこれ？」
　ハレは困惑した。壁から伸びてきた伸縮自在の棒のようなものが、行く手を阻んだからだ。
「きゃ！　な、なに！？」
　続いて、またもや伸びてきた紐が、ハレの右腕に絡みつく。それが彼女の身体をコンソールの方に引っ張った。
「これ……どういうこと？　席に座れって言ってるの？」
　紐の引っ張る力は、あくまでハレが抵抗できる程度だった。その力加減から、命令というよりお願いされているように感じる。
「…………よくわからないけど、座ればいいの？」
　そもそも、ここがどこなのかもわからない。それを調べることが出来るなら、ハレとしても都合がよかった。
「起動はどこですればいいんだろ……って、なんか点いた」
　席に座っただけだ。何もしていないのに、コンピュータがひとりでに起動する。
　マウスを操作し、ホーム画面に進む。パスワードのようなものはかかっていなかった。不用心だな、と思いつつも、慣れ親しんだ操作を続ける。
「なにこれ……全然、なにもないけど」
　ただあるのは補助記憶装置にアクセスするためのファイルだ。それしかないため、クリックする。
　中には３つのファイルが入っていた。Rap、PIVO、Memoryの３つだ。なんとなく、rapのファイルを開いてみる。しかし、開くことが出来なかった。ポップアウトには「Memoryファイルから見て」という簡素な一文のみが記されている。いちいち強制されるのが尺に障るが、ここは従うほかない。ハレは仕方なく、Memoryファイルをクリックした。


？？？前。
　ヒマリと別れた先生は、ユウカとともに被害状況を調査していた。それも大体済んで、そろそろ帰ろうかなんて話をユウカとしていたころだった。
「先生。やっと見つけた」
　突然、ふたりの前にエイミが姿を現す。彼女は安堵の言葉を口にすると、額の汗を拭った。
「エイミ？　どうしたの？　随分急いでるみたいだけど」
　エイミの息が僅かに荒くなっているのに気づいて、先生は尋ねた。
「すーっ、はぁああ」
エイミは質問には答えず、両手を膝について、柔軟でもするように腰を曲げる。それから大きく息を吸って吐いた。
「部長が呼んでる。ちょっと来て」
　たった一度の深呼吸で息を整えたエイミは、そう言うと先生の手を引っぱり、どこかへ連れて行こうとする。
「ち、ちょっとエイミ？　どうしたの？　なにかあったの？」
「えっと──」
「エイミ！　ちょっと待ちなさい！　どうして急に先生を連れて行くのよ！？」
ユウカは小走りで追いつくと、空いているもう片方の腕を強く掴んだ。予想以上の握力で掴まれ、先生は顔をしかめた。
「っ？　部長に連れてきてって言われたからだけど」
「そういうことじゃなくて……先生は今、私と一緒に行動してるんだけど？」
「んー？　あ。そっか。ごめんね、せっかく先生と二人きりになれたのに、邪魔しちゃって」
　エイミはポンと手を叩くと、何かに気づいたようにいった。
「なっ///　べ、別に私はそういう意味で言ったわけじゃ──」
　エイミの言葉が図星だったのか、からかわれて憤慨したのか、ユウカが頰を赤らめる。
「じゃあ、ユウカも一緒に来るといいよ。別に先生だけしか来ちゃいけないとは言われてないし」
「だ、だからそういうわけじゃ……ま、まあ、別についてくのは良いけど……どうせそろそろ戻るつもりだったし。それよりも、そんなに慌てて先生を呼びに来るなんてどうしたの？　もしかして、またアンチプロトコル関係でなにかあった？」
「うん。今度はいい知らせだけどね」
　エイミはこころなしか嬉しそうな口調でいうと、振り向いて歩き出した。ユウカと先生も、それについていく。
「エイミ。ヒマリはどこにいるの？」
「部長なら研究室で作業中だよ。もしかしたら、アンチプロトコルの対抗薬を作れるかもって言ってた」
「え？　それ、ほんと！？」
　まさかの朗報に、先生は目を見開いた。その後、歩きながらエイミはどうしてヒマリがそんなことを言い出したのか説明してくれた。どうやら、生徒会室に運んでいる途中で、ハレが目覚めたらしい。アンチプロトコルを目の前で浴びたにしては、あまりにも早すぎる目覚めだったようだ。ヒマリはハレに何らかの耐性のようなものがあるとあたりをつけ、対抗薬を作れるかもしれないと考えたそうだ。それについて話したくて、急遽呼び立てたらしい。内容はほとんどエイミが話してしまった気もするが、より詳しいことを説明してくれるのだろう。きっとヒマリにしかわからないこともあるはずだ。
「なんにせよ、希望が見えたなら良かったですね！　先生！」
「だね。アンチプロトコルのことはなんとかしなきゃとは思ってたから……本当によかった」
　具体的な事情を聞いて、先生が安堵の息を吐く。先生にとって、ピボットくんは大切な生徒の一人だ。しかし、それはそれとしてアンチプロトコルについては危険視していたのも事実だ。最悪、大人のカードを使ってでも解決しようと思っていたくらいには。
「ええ。ていうか、そのへんの話もヒマリ部長から聞かないと。私、結局アンチプロトコルってどういうものなのか、よくわかってないんですよね」
　ユウカは安心する先生に同調して相槌を打ったものの、いまいち釈然としない顔をしていた。その言葉と表情で、そういえばユウカはまだ何も知らなかったことを思い出す。
「そっか。そういえば、ユウカにはまだ詳しい説明はできてなかったね」
研究室に向かうついでだ。先生はアンチプロトコルの情報をユウカに共有した。といっても、先生もアンチプロトコルについて詳しいことを把握しているわけではない。ヒマリから聞いたことを一部かいつまんで告げただけだ。話してる途中で中途半端な情報なら何も言わないほうがいいかと後悔するくらいに拙い説明だったが、ユウカはそれでも理解したらしい。
「なるほど。つまり、EMPショックみたいなものってことですね」
　数秒考え込んでインプットした情報を噛み砕くと、すぐさま例えてみせた。EMPとは電磁パルスのことで、使いようによってはアンチプロトコルのように電子機器などに甚大な被害を与えることが出来る代物だ。といっても、威力や脅威については比べるまでもないが。
「ま、まあそんな感じなのかな？」
「まったく。聞けば聞くほど恐ろしいですね……でもまあ、でも対策が見つかったならよかったです。そんなやばいもの、放置は出来ませんから……」
　アンチプロトコルは脅威だ。だが、対策が見えてるおかげか、ふたりの口調は自然と明るくなっていた。
　その後、数分も歩かないうちに、ヒマリがいるという研究室の入口に到着する。
「ついた。ここが入口だよ」
「え？　なにもないように見えるけど……」
一見して何も無い。だが、エイミは地面に手を置くと、文字通り引き上げた。
「それって……地面が扉になってるの？」
「うん。ここから地下研究所に行けるんだよ」
「そ、そうなんだ……」
　よく見ると、取っ手のようなものがついている。扉の大きさは明らかに人が素手で開けられるものではないが、エイミの膂力なら軽いドアと変わらないのだろう。
「ちょっと。なにそれ、私そんなものが造られてるなんて、聞いてないけど！？」
「うん。だって、秘密基地だから」
　ユウカが声を荒げる。セミナーに申請を送らなければならないが、ヒマリは無断で造ってしまったらしい。
「本当は私と部長しか知らない場所なんだけど……今は特別だから」
　エイミがじっとユウカの顔を見つめる。その目は言外に今はそんなことで揉めている場合じゃないよね。と告げていた。
「はいはい。申請もなく勝手に地下空間を作ってたことは不問にしてあげますから。それより、早く案内して」
　エイミのメッセージを受け取ったユウカは額を抑えて嘆息した。本来、セミナーとして注意しなければならない場面だが、今回は事態が事態だ。聡明なユウカは不祥事を見逃す背徳感はあるだろうが、冷静な判断ができないわけではなかった。
「本当、いつの間にこんな場所造ったのよ……」
「造ったのは結構最近だよ。部長がいちいち家に戻るのが面倒だからって、第二の家にしてる。ちなみにここの部屋が部長の部屋だよ」
「第二の家って……どんだけ規格外なのよ、あの人は……」
　地下研究所というと、てっきりこじんまりとした一室があるのかと想像していたが、意外にも中は広々としていた。構造はアリの巣のようになっていて、階段を降りる途中にいくつか部屋があるそうだ。
想像以上のスケールに本当に不問にしてもいいのかとユウカが頭を抱えていたが、エイミは涼しい顔をしていた。
「ユウカ。ちゃんと前見ないと危ないよ」
　先生はユウカをたしなめた。アンチプロトコルの影響で電気系が全てダウンしてしまっているため、頼りになるのは懐中電灯の明かりだけだ。足元が暗いため、油断していたら転んでしまう。まあ、例のごとくキヴォトス人であれば転ぶ程度で負傷などしないだろうが。
「それはわかってますけど……でも、ちょっと頭がクラっと来ちゃって。すこし、休んじゃだめですかね？」
「ユウカ、休みたいの？　それならもう少し降りたら私の部屋があるよ。ベッド、貸そうか？」
「…………今の言葉でもっと頭が痛くなったわ」
　する。どうやら、ヒマリが第二の家とするつもりでここを造ったのは本気みたいだ。
　もう一度、前を見るように注意しようと思った瞬間だった。
「エイミ？」
　突然、懐中電灯の明かりが消えたからだ。一瞬いたずらかと思ったが、エイミはそんなことをする性格でもない。もしや電池でも切れたのだろうか。返事がないのも気になり、さらにエイミの名を呼ぼうと口を開きかけたときだ。ドサッと何かが倒れる音がした。
「エイミ！？　大丈夫？」
　今の音はなんだろうか。しかし、情報を得ようにも視界は闇に染まっており、何の情報も得られない。気のせいじゃなければ人が倒れたように聞こえた。
「エイミ、ユウカ！　返事して！」
　目が見えないのでその場にしゃがみこむと、先生はさっきまでエイミ達が立っていた場所に向けて手を伸ばした。予想通り、横たわる彼女の肩に手が触れた。
　揺さぶっても返事がない。どうやら気を失っているのだろうか。それに、エイミだけじゃない。さっきからユウカがなにも言わないのも気がかりだった。続けてユウカがいたほうに手を伸ばす。どっしり重量感のある太ももに手が当たる。やはり、ユウカも倒れていた。
　先生は慌てた。何が起きているのかがわからない。しかし、とんでもないことが起きているのは確かだった。
　バクバクとなる心臓を抑えて、まずはふたりの息があることを確かめる。それから懐の端末を取り出し、呼びかけた。
「アロナ！　プラナ！　ふたりとも、いる！？　起きて！」
　反応はないので、シッテムの箱の電源を押し、強制的に起動する。いつもなら反応がなければ無理やり呼び出すことはしないが、今だけは別だ。　
『プハッ！　や、やっと顔が出せました！』
青髪の少女。シッテムの箱のOSだ。
「アロナ！　無事で良かった。それより、今何が起きているか分かる？」
『はい。しっかり、観測していました。アンチプロトコルの暴走です……今のは最大規模でした』
「あ、アンチプロトコル！？　そんな……ここまで届くなんて」
最大規模というのは本当らしい。ピボットくんがいるであろうミレニアムタワーまで距離があるはずだが、気絶するなんて。
「でも、ふたりが無事で良かった」
『わたしたちは今まで干渉を受けない領域に避難していましたので……ですが、今回はちょっと規模が凄まじいです。さすがのアロナちゃんも、クラっときました……』
目をシパシパさせている。
「アロナ。悪いけど、これからミレニアムタワーの生徒会室まで向かうよ。途中のエレベーターが止まってると思うけど……動かすことって出来る？」
『はい？　それは出来ると思いますが……どうして生徒会室に？』
「ピボットくんの様子が気になる。それに、ハレ達も……」
　端末の中で首をかしげるアロナに、先生は冷静な心持ちで答えた。
　ヒマリはピボットくんに落ち着いたら生徒会室に行くように伝えていた。そして、もし彼がそこにいた場合、近くにはハレや眠っている他の生徒もいるはずだ。間近でアンチプロトコルを浴びてしまった彼女たちの安否が気になった。
『なるほど、そういうことですね。わかりました。スーパーアロナちゃん、何があっても先生のお役に立ってみせます！』
「ありがとう。頼もしいよ」
『ちなみに、プラナちゃんもいますよ！』
　先程から隣で控えていた彼女が、ペコリと頭を下げる。
「うん。プラナもありがとう、頼りにしてるね」
『はい。お任せください。アロナ先輩ともども、先生の安全は保証します』
　アロナに比べれば感情表現がおとなしめな彼女も、気合が入っているのがわかった。
「よし、じゃあ早速向かおう。……といいたいところだけど、せめてユウカとエイミの体勢を変えてから……」
　今は余裕のない状況だが、かといって倒れているふたりをそのままにしていくのは気が引けた。とはいえ、先生の力では彼女たちを運ぶことは出来ない。せめて仰向けに寝かせてあげる。それから先生は駆け出した。
「何があったのでしょう……」
　地上に向かう階段を登っている途中、アロナが不安げな言葉を漏らす。
「分からない。それを確かめるために向かってるんだ」
「ですね。ですが先生、アロナちゃんはなんだか嫌な予感がします……どうか気をつけてください」
　アロナの忠告に先生は無言で頷いた。
「暗い…………これもやっぱりアンチプロトコルの影響かな？」
地下を出ると、真っ暗な闇が広がっていた。アンチプロトコルの影響だろう。道なりに設置された街灯は全て沈黙している。シッテムの箱の入った端末を除けば唯一頼りになるのは月の光だけという状況に、先生は固唾を呑んだ。電子機器が動かないということが人類の生活にどれだけ影響を与えるのか、改めて理解させられた。
　見たところ、歩いていても違和感のようなものは感じない。
「はあ……ふう、着いた！」
　しばらくして、ミレニアムタワーの正面入口に到着する。
「先生！　大丈夫ですか？」
　膝に手をつき、肩で息をする先生の安否をアロナが確かめる。
「私は大丈夫だよ。それより、二人こそ平気？」
　先生は笑って頷くと、逆に尋ね返した。明日、先生は筋肉痛に襲われるだろうが、アロナとプラナに訪れる代償はその程度ではない。アロナ達は、いつアンチプロトコルが襲ってこようとも大丈夫なように、ずっと先生の周囲にバリアを張り続けていた。アンチプロトコルはあらゆるモノの電磁波の動きを止めてしまう恐ろしい能力だ。それに対抗できる電子機器はキヴォトスには存在しないが、シッテムの箱は別である。それほど絶大な力を彼女たちは持っているが、それを行使するには大きな代償が伴う。具体的にいうと、力を使えば莫大な披露がたまり、必ず眠ってしまうのだ。それが何時間か、何日かわからない。先生が駆け足で向かっていた一番の理由は、彼女たちの負担を軽減するためだった。
「平気です。私たちは適度に交代してるので！」
　先生の気遣いを、アロナは機敏に察知していた。先生を安心させるために、声を張り上げて答えた。
「ならよかった。あと少しだから、頑張ってね」
　ミレニアムタワーの前に到着すると、先生はまず息を整えた。それからアロナ達の安全を確認すると、電気の通っていない自動ドアをこじ開け、中に入った。
　中は当然真っ暗で、月明かりもほとんど差し込まないため、一寸先は闇状態だった。シッテムの箱と何度も足を運んだ経験を頼りにエレベーターの前までたどり着く。
「二人とも、頼める？」
『はい、先生。ここは任せてください！』
　彼女たちにさらに力を使わせるのは申し訳ないが、生徒会室は到底階段で登りきれる距離ではない。
「ハッキング、成功です！　エレベーター、動きました！」
　アロナの力で一時的にエレベーターは動力を取り戻す。乗り込むと、行き先を指定するまでもなく、床が動き出した。
『むむむ……』
「アロナ、大丈夫？」
『はい、先生。ワタシは大丈夫です。ですが、なんでしょう……この先、とても嫌な予感がします。先生、今更ですが、引き返した方がいいかもしれません』
アロナがこんな弱気なことを言い出すなんて珍しい。
「……ダメだよ。進まなきゃ。この先で起こってることを、しっかりこの目で見なきゃ」
　先生は固唾を飲んだ。
　かつて、バッドエンドを乗り越えてきたという。今回の事象はその数に足されるかもしれない。大事なのは選択だと誰かが言っていた。ひょっとしたら、この場合の正解はアロナに従うことなのかもしれない。それでも、前に進むことを選んだのはこの先にハレやゲーム開発部、ヴェリタスのみんなが寝ているはずだ。彼女達の安否を確かめないことには引くことなどできなかった。それが先生としての責任だ。
『……ですね。安心してください、先生。たとえ何が起ころうとも、先生の身は私が守ります！』
　先生の気持ちは、アロナもよく分かっていた。同時に自分の発言を後悔した。誰よりも長く先生と接してきたくせに、どうして生徒の皆さんを捨てるようなことを言ってしまったのだろう。
『先生！　目的の階に到着しました！　入り口、開きます！』
　ゆっくりとエレベーターの入り口が開く。
「なっ！？」
　まず、最初に感じたのは風だった。吹き飛ぶとはいかないものの、軽く仰け反ってしまうような威力だ。
『先生！　前！』
　アロナが叫ぶ。そして視界に飛び込んできたのは。
「……ピボットくん？」
　部屋の奥に立ち尽くすピボットくんの後ろ姿だ。彼の正面にある窓ガラスが派手に割れている。強風の発生源はそこらしい。高層プラスビル風の勢いは、室内の書類や小物を散乱させていた。
「…………」
　ピボットくんはゆっくりと体ごと振り返った。その腕の中には、お姫様抱っこの形で眠るハレが収まっている。目をつむり脱力する彼女を見て、先生は一気に警戒心を跳ね上げた。
「……ピボットくん。ハレをどうするつもり？」
　懐のカードに手をかけると、険しい目で問いかける。
今のピボットくんの様子が違うのははっきりわかっていた。なぜならオレンジだったヘイローは赤く発光し、目も同色に光っている。
　ゆっくりと振り返った。瞬間、先生は叫んだ。
「アロナ！」
『はい！　プラナちゃん！　力を貸してください！』
『はい。もちろんです』
　ピボットくんが飛び降りようとしていたように見えた。この高さから落ちれば、いかに強靭な肉体を持つキヴォトス人といえど死は免れない。それは未知数の強度を持つピボットくんも同じだ。
　今、ピボットくんに何が起きているかはわからない。それを止めるために最も有効なのがハッキングだと判断した。

シッテムの箱を管理するアロナは凄まじいハッキング能力を持っている。あのデカグラマトンのハッキングさえ、くしゃみひとつではねのけるほどの力だ。おそらく、このキヴォトスで唯一ピボットくんに対抗できる端末だろう。
　アロナ一人でそのレベルだ。そこにさらにプラナも加わってハッキングを試みたのだ。しかし。
『う、ウソ！？　アクセスが完全に拒否されました！』
『……想定外。まるで干渉できません』
　アロナの悲痛な声と、プラナの平坦だが驚きを隠しきれていない声が静かに響く。
「そんな……二人でも敵わないっていうの？」
　先生は絶望した。
　大人のカードを取り出す。もう、迷いはなかった。先生のみに許された武器でピボットくんの動きに干渉をかける。だが、それはうまくいかなかった。
「そんな……大人のカードが使えない！？」
「…………ピボ、ピボボボ」
　はっとして顔を上げると、ピボットくんが真紅の瞳をこちらに向けていた。
　口元から発せられるのは、いつか聞いた無機質な音。ハレがコアを入れた直後の反応と同じものだ。
「まさか……ハッキングされた！？」
　直感で何が起こったのかを発覚する。
　同時にぞくっと背筋が凍った。大人のカードは代償付きであらゆる事象を捻じ曲げる力を持つ。その力は絶対不変唯一無二干渉不可であった。それがまさか、ハッキングされるなんて。そのうえ、アロプラのハッキングさえ、無効化された。
　シッテムの箱 大人のカード
　この二つは先生にとって最強の武器であり、絶対的な信頼を置いていたツールだ。それらが破られたショックは大きかった。
　呆然と立ち尽くしている間に、ピボットくんはビルの外へと飛び降りてしまう。
　慌てて駆け寄るも、当然追いかけることなどできず、手前で止まるしかない。目を凝らすと、遠くに消えていく赤い光が見えた。
『先生…………すみません、ハッキングに失敗してしまいました』
　申し訳なさそうにいった。
「うん。私の大人のカードも無力化された……驚いたよ。まさかアロナまで負けるなんて……」
『いえ。正確に言うと、私たちのハッキングをブロックした後、彼もまたシッテムの箱のハッキングを試みました。しかし、私たちもブロックしたので引き分けです。なので、負けてはいません』
　ふんすと憤慨したような鼻息を吐くアロナ。そんな彼女の頼もしさに先生は苦笑した。
　自分がショックを受けている間に、そんな攻防が行われていたとは気づかなかった。アロプラの優秀さは流石だ。だが、大人のカードは違う。完全に無力化されてしまった。先生の頭の中では、そのことが少なからず尾をひいていた。
『先生。これから、どうされますか？』
「……とりあえず、みんなの無事を確認しないと。それから、アンチプロトコルの被害範囲を調べないと」
『……わかりました。先生、これからしばらくは、私とプラナちゃんが交代で先生を守ります。何かあったら呼んでください」
「わかった。アロナ、プラナ、ありがとうね。お疲れさま」
『ありがとうございます。先生もどうか無理はしないでくださいね』
「うん」
　そういって、アロナは画面の中から消える。
『先生。ここからは私が主にサポートします」
　プラナが出てくる。
今回のアンチプロトコルは規模が大きそうだ。下手したらミレニアム全域に及んでるかもしれない。どこまでの生徒が倒れているかを確認しなければ。
「……はあ。朝までに終わるといいけど」
　シッテムの箱と大人のカードを懐にしまうと、先生は深い息を吐いた。

翌日。
「ヒナ。忙しいのにわざわざミレニアムまで来てくれて、ありがとうね」
午前、午後と時間を目一杯使い、調査を終わらせた後、先生は隣に肩を並べる少女にお礼を言った。
「気にしないで。他でもない先生の頼みだし、ミレニアムの状況も確かめかったから」
　そういって、モップのような毛量を持つ白い髪を優雅にかき上げる少女は、空崎(そらさき)ヒナ。ミレニアムと並んでキヴォトスを代表するマンモス校、ゲヘナ学園の風紀委員長だ。
「それにしても、さすがヒナ。まさかこんなに早く終わるなんて思ってなかったよ」
「それは……まあ、こういう仕事には慣れてるから」
　ヒナははにかんだ表情で言った。
　ゲヘナ学園はミレニアムとは違い、生徒間の抗争やトラブル、テロの絶えない激戦区のような学校だ。そのため、ゲヘナの風紀委員は寝る間も惜しむほどの激務の毎日である。だから、先生にとって、ヒナがやってきてくれたのはまさに幸運だった。
　彼女は今朝、モモトークで風紀委員の仕事を手伝ってほしいと先生に連絡した。それに対し、先生が残念ながら今はそれどころではないと返事したところ、逆に人手を寄越してくれたのだ。忙しい業務の中で、動けるメンバーをなんとか捻出したのだろう。やって来た人員は十人にも満たないくらい少数だったが、ヒナの指揮の元、驚くような手際の良さで状況確認、及び被害生徒の護送をたった1日で終わらせてくれた。
　その結果、今回のアンチプロトコルの被害はミレニアムサイエンススクール全域に及んだことがわかった。
「ねえ先生。ミレニアムがこんな状態になるなんて……一体何があったの？」
　部下より受け取った報告書を読み終えると、ヒナは先生に向けて怪訝な目を向けた。それから無言で報告書を差し出した。受け取ると、そこには動かなくなった電子機器と昏睡状態に陥った被害者の内訳が記されている。
「それは……」
　ヒナの質問に答えるべきか迷って、言葉を濁した。彼女に教えたのは電子機器の一切が動かなくなっていること、ミレニアムに属するほとんどの人間が昏睡状態に陥っているという状況だけで、どうしてそうなったのかは伝えていなかった。
「答えられないってことは、ミレニアムの機密や沽券に関わることなのかしら？」
　ヒナは瞬時に、先生が言葉を濁らせた理由を言い当てる。彼女の言う通り、アンチプロトコルの存在はミレニアムの立ち位置に少なからず影響を与えるだろう。あまり考えたくないことだが、アンチプロトコルはミレニアムが他校を貶めるために開発した電磁兵器だと疑う学校も現れるかもしれない。とはいえ、ミレニアムが事実上の機能停止に陥ってしまった。遅かれ早かれ、その事実は明るみに出るだろうが、それを部外者である自分がペラペラと話すことはできなかった。
「さすがヒナ。鋭いね。悪いんだけど、詳しい説明はヒマリ達が起きてからでもいい？　多分、私が話すよりも彼女たちに聞いたほうがいいと思うから」
「……先生がそういうなら、いいよ。なら、仕事もあるし私はもう帰るから。もし話せるときが来たら、モモトークで教えてくれる？」
「分かった。ヒマリが目覚めたらすぐに聞いてみるよ」
「ありがとう。無理には聞かないけど……でも、ミレニアムがこんなふうになるほどの事件、もしテロとかなら、ゲヘナにも無関係じゃないから。よっぽど理由がないなら教えてくれると嬉しい」
「分かった。それも伝えておくよ」
「うん。よろしく。それと、夕方にはチナツ達に来てもらうように言っておくから」
「え？　なんでチナツが？」
　先生は首を傾げた。チナツとは、ゲヘナの風紀委員のメンバーのことだ。先生がシャーレに来て最初に出会った生徒の一人であり、ゲヘナ学園の中でも思い入れの深い生徒でもある。
「先生……本気で言ってるの？　救護班は必要でしょ。みんな女の子なんだから、体を拭いたりしなきゃいけないだろうし」
「あ、ああ。確かに……」
　本気で呆れた様子のヒナにため息混じりの指摘を受けてしまい、先生はたじろいだ。確かにデリカシーがなかった。それにヒマリ曰く、アンチプロトコルで眠っている生徒は意識はある状態なのだという。そんな状態で身体を綺麗にできなければ、気になるだろう。
「先生……言っておくけど、くれぐれも眠ってる生徒達に変なことはしないようにね」
「うん。分かってる。そんなことはしないよ」
「それならいい。それじゃ、またね。私もう行くから」
　ヒナは最後に釘を刺すと、スマホを取り出しどこかへかける。きっと、散らばっている風紀委員のメンバーに召集をかけるのだろう。だが、彼女は一言二言話した後、「え？　それ、ほんと？」驚いた声を上げて、先生の方を見た。
「ヒナ？　どうしたの？」
　先生は怪訝な表情で問いかけた。もしや、ヒマリ達に何かあったのだろうか、同時に不満が込み上げてくる。
「先生……明星ヒマリさんが目を覚ましたそうよ」
「……え？」
果たして、ヒナの口から発せられたのはいい意味で予想外の事実だった。
　それから、先生とヒナは急いでヒマリが待機しているという体育館に向かった。
　道中聞いたヒナの話によると、風紀委員が眠れる生徒達の様子を見守っていたところ、突然目を覚ましたヒマリに声をかけられ、ヒナと先生を呼ぶよう頼まれたそうだ。
「わざわざお呼び立てして申し訳ありません。なにしろ、車椅子がこの有様ですので……」
　体育館の入口で、ヒマリが出迎えてくれた。彼女が自身で設計を行ったという全自動かつ多機能付きの車椅子は、その全てを失っている。今や彼女の車椅子は、誰かの手を借りねば満足に全身もできない鉄の塊だ。
「ヒナ委員長、お疲れ様です！」
「お疲れ様。代わるわ。もう持ち場に戻って大丈夫よ」
「は、ありがとうございます」
　ヒマリの車椅子は風紀委員が押していた。ヒナは彼女を労うと、その役を代わった。
「ヒマリ。大丈夫なの？」
　先生はヒマリの正面に立ち、尋ねた。
「いえ……最悪です。ですが、悠長に寝込んでいられる状況でもありませんので」
　ヒマリは毅然とした顔で答えた。だが、やつれている表情を完全に隠し切れてはいない。
「それより、そちらの方はゲヘナの風紀委員長の空崎ヒナさんでしょうか？」
「ええ、そうよ。そういうあなたは明星ヒマリさんね。アコから話は聞いてるわ。とても優秀なハッカーだと」
「ありがとうございます。こちらこそ、ゲヘナの風紀委員長の活躍のお噂はかねがね聞いています。この度はミレニアムの危機に対し、力を貸していただいてどうもありがとうございます」
「気にしないで。それより、ミレニアムがこんな状態になった理由を教えてもらっても構わないかしら？」
「ええ、もちろんです。……そういうことなら、少し場所を変えましょうか」
　ヒマリがそういうと、ヒナは車椅子を押し始めた。
「すみません。ヒナさんに車椅子を押させてしまって……」
「ううん、いいの。どこまで行けばいい？」
「ここから左の方に行けば、私の研究室がありますので。その入口までお願いします」
「わかった」
　ヒナの後ろをついていく。
「さて。ですが……とりあえず、アンチプロトコルについて説明しましょうか」
「アンチプロトコル？」
「私達を襲ったものの正体です」
道中、ヒマリはおもむろに語り始めた。場所にこだわりはないらしい。
「簡単に言えば、あらゆるヒト・モノの電磁波を無効化する特殊な電磁波のことです」
「電磁波を……無効化する？　どういう意味？」
「そのままの意味です。例えばスマホやこの車椅子も、集積回路から流れる電気を元に動いています。人も同じように脳から電気信号を送り、手足を動かしている。その機能をそっくりそのまま失うということです」
「っ！　じ、じゃあそれを間近で浴びたということは……」
　ヒナが焦った様子で背後を振り返った。その視線の遠く先には、講堂がある。人の電子黄信号が止まる、その意味にすぐ気づいたのだろう。
「ご安心を。我々キヴォトス人はヘイローがあるため、アンチプロトコルの影響を受けても生き地獄を味わうだけで、時間さえ経てば元に戻ることは可能です。私のように。電子機器に対する停止効果も同じです。現状、ミレニアムに存在する電子機器の類は全く使えませんが、時間が経てばいずれ使えるようになるでしょう。授業を担当してくださるロボットの先生も同じです。……まあ、通常の人間はその限りではないのですが……」
　しりすぼみに小さくなる声でいって、ヒマリは先生に流し目を送った。ロボットや電子機器であれば、もう一度電気信号が流れれば元通りになれる。だが、人間は違う。電気信号が停止すれば、臓器や細胞、生命活動に必要なものが死滅する。死んだ人間は蘇らない。その摂理は変わらない。ゆえに、ヒマリが最も身を案じていたのは先生だった。
　しかし、先生はピンピンしている。ミレニアムを壊滅させるほどの濃度のアンチプロトコルを浴びたのに。その理由はなんなのだろうか。
「私がアンチプロトコルの影響を受けなかったのは、これがバリアを張って守ってくれたおかげだよ」
　先生はシッテムの箱が入った端末を見せていった。すると、ヒマリの顔にわずかに落胆の影がさす。
「……なるほど。シッテムの箱ですか。そのOSには、人智を超えた力が眠っていると聞きます。そういうことなら、　もしかしたら、先生もハレと同じように耐性を持っているのかと思ったのですが……」
「ごめん。多分、そういうのはないと思う」
「そうですか。まあ、今は先生が無事でいられるだけでもよしとしましょう。シャーレの先生まで倒れたとなると、それはミレニアムだけの問題ではならなくなりますから」
　決して口に出すことはないが、顔の広い自覚と、慕われている自覚はある。自分が倒れたら連邦生徒会や他の学園が動き出すことも想像できた。
「もう少し詳しく聞いてもいい？　アンチプロトコルの発生源はどこ？　ミレニアムで行われた実験によるもの？」
　ヒナがさらに詳しい話を聞こうと詰めよる。
「いえ、あれに関して、私達は関与していません。あれがミレニアムにやってきたのは３週間ほど前のことです。突然ヴェリタスの部室が停電するという事件が起こりました。その時、天窓を破り、襲来したロボットが保有していたエネルギーです」
　ヒマリはゆっくりと首を振ると、さらにピボットくんについて語った。ピボットくんのハッキング能力のこと。感情の振れ幅によってアンチプロトコルが暴走してしまうことを。
「……そう」
　彼の人柄や葛藤を語りつつ、なるべく悪印象を抱かれないように配慮しているように見えた。しかし、先生は見逃さなかった。ヒナの瞳が一瞬強い警戒の色を宿したのを。
「……ふう」
しばらくしてやり取りを終えると、ヒマリは心底疲れたため息を吐いた。隠しきれないほど、疲労も溜まっているのだろう。
「ヒマリ、ちょっと休んだ方がいいんじゃない？」
　先生は休むように提案した。だが、ヒマリは「いえ」と、それを拒否する。
「私はまだ、やらなければならないことがありますので。それに、私は比較的早く目が覚めました。特に、私よりもさらに早く眠りに落ち、今も眠り続けているあの子達に比べれば、恵まれています」
自虐的に、かつ同情を孕んだ調子でヒマリはそう口にした。マキやモモイ達、彼女達はアンチプロトコルの被害者の中で最も長く眠りつづけている。彼女達と比較したなら、確かにヒマリは恵まれてる方だろう。
「やらなくちゃいけないことって？」
「これを完成させることです」
　そう言って、ヒマリは真っ白な腕をさすった。一見、そこには何もない。だが、ヒマリが肌を摘むと、ピーッと何かが剥がれた。
「ヒマリ、それは？」
「これは皮膚と同じ成分でできた、吸水性の高い薄型のシートです。これにハレの血液成分を含ませました」
「ハレの血液……確か、ハレはアンチプロトコルの耐性を持ってるんだっけ？」
「ええ。私が早く目覚められたのは、これを纏っていたおかげです」
「そんなものがあったの？」
それがあれば、この大惨事も避けられたのではないだろうか。そう思ったところで、先生はハッとする。
「はい。アンチプロトコルの影響を受ける直前にちょうど作り終わったのです。といっても、効果の検証などもできていませんでしたが……不幸中の幸いといいますか。効果があることは証明されてしまいましたから」
　ヒマリは苦笑いを浮かべ、辟易とした調子でいった。不幸中の幸いという言葉がこれほど似合う場面はそうないだろう。
「しかし、まだ数も完成度も足りません。次、いつまたアンチプロトコルに襲われるかわからない以上、私はこれを完成し、数を作らなければなりません。休むのはその後です」
ヒマリは強い意志を込めていった。これはもう、何を言っても止まらないことを察する。
「……分かった。でも、無理は禁物だからね。あと、私に手伝えることがあったら言ってね」
「ありがとうございます。もちろん、根を詰めすぎて体調を崩しては本末転倒ですから、やむを得ない場合は仮眠も取ります。それに、必要になったら手は貸してもらいますので、ご安心ください」
　それは絶対に助けを求めない決まり文句ではないだろうか。そう思ったものの、先生の知識ではヒマリの研究に対し、手伝えることがないのは事実だ。それ以上、なにも言えることはなかった。
「ヒマリさん。その研究は一人でもできるものなの？」
「ええ。とはいえ、人手があるには越したことはありませんが……今はこの状況ですので」
いくらヒマリが天才だとしても、一人ではできる仕事量に限界がある。先生は実体験からそれをよくわかっていた。シャーレの業務でも同じだからだ。例えば、部屋の掃除をしてくれたり、機密事項の書かれていない書類の確認や整理をしてくれる当番の生徒がいるだけで、仕事の効率はぐっとあがるものだから。
やっぱり、自分もなにか手伝ったほうがいいんじゃないだろうか。
「……そういうことなら、ひとつ提案があるのだけれど」
　先生が口を挟む前に、ヒナが言葉を続けた。
「なんでしょう？」
「ゲヘナの化学班をお貸しするわ。ヒマリさんの知識には到底及ばないでしょうけど、少しは役に立つはずだから」
「なるほど。その手がありましたか」
　ヒナの提案に、ヒマリは意外そうな反応を示す。
「確かに、人員が増えるのは助かります。しかし、ゲヘナの皆さんにこれ以上手を煩わせるのも気が引けますが……」
　ヒマリはちらりとヒナの目を見た。品定めするような目だった。多分、ここでゲヘナに借りを作った代償について考えているのだろう。
「気にしないで。そのアンチプロトコルというものがゲヘナの脅威になりうるなら、それを排除するための労力は惜しまない。あなた達も、逆の立場ならそうしたでしょう？」
　しかし、ヒナは淡々としていった。その目には打算も嘘もない。ただ純粋にミレニアムを心配していた。それを見抜いているのだろう。ヒマリも警戒を解くと、すっと受け入れるように頷いた。
「……そのとおりですね。わかりました。では、お願いしてもよろしいでしょうか？」
「うん。じゃあ、私はゲヘナに帰って手続きとかをするから。何人欲しいかとか細かいことは、後で連絡して欲しい。連絡手段はこれを使って」
　ヒナがポケットから出した紫色のスマホケースに入った端末をヒマリに渡す。
「これは？　業務用端末ではなさそうですが、よろしいのですか？」
　ヒマリは受け取った端末をまじまじと見つめて、ヒナの顔色を伺うように言った。
「私のプライベートのスマホだけど……大した情報は入っていないから、好きに使ってもらって構わない。連絡手段はないと困るでしょう？」
「それはそうですが……本当にいいのですか？　これを私に貸したら、ヒナさんの連絡手段がなくなってしまいますが」
「私はこっちの業務用端末があるから」
「……すみません。何から何まで」
　それから、ヒマリにこっそりとパスワードを教えると、ヒナは帰っていった。
　ここからは先生がヒマリの車椅子を押して、地下通路を降りていき、やがて、ヒマリの研究実にまっすぐ続く通路へとたどり着く。
「そうだ、ヒマリ。報告しなきゃいけないことがあったんだ」
「何でしょう？」
「……ピボットくんとハレのこと」
一瞬、それを言うべきか迷った。だが、ヒマリには共有しておくべき情報だろう。どっちにしろ、ハレが負傷者リストの中にいないことはわかってしまうのだから。
「……まずは話を聞きましょう」
「うん。実はみんながアンチプロトコルにやられた後、生徒会室でピボットくんに会ったんだ」
「なるほど。それで？」
「ガラスを破って、どこかへ飛んでいっちゃったから…………ハレを抱えてね」
先生は強く唇を噛んだ。あのとき、何もできなかった屈辱が胸をよぎる。
「……そうですか。つまり、ハレが拐われたということですね」
　頷くヒマリの冷静な面持ちの中で、唯一眉間にシワが寄っている。彼女の天才的な頭脳の中では、どんな奸計が巡っているのだろう。
「ごめん。私があのとき、ピボットくんを止められていれば……」
「先生。それはたらればです。それに、それを言ってしまったら、私達なんて呑気に眠っていただけですし。嘆いていても、事態は好転しません。まずは情報を整理しましょう」
「そうだね。ヒマリの言うとおりだ」　
ヒマリの言う通りだ。ただ嘆いているだけじゃ、何もプラスに働かない。
深呼吸をして、気持ちを切り替える。
「ピボットくんと対峙したとき、なにかおかしなところはありませんでしたか？」
「おかしなところばかりだった。全然喋らなくて、ずっとピボピボ言ってたよ。初めて、彼がヴェリタスの部室に来たみたいに」
　先生はピボットくんの様子を思い出した。気になるのは、無機質な機械音。そして、なんといっても真っ赤に染まり輝く目とヘイローだ。
「なるほど。それは一言も喋らなかったということですか？」
「うん」
「それは気になりますね。もしかしたら、何者かに操られてる？　いや、そもそもそういうプログラムがあったのでしょうか……他に変わったことは？」
「目とヘイローが赤く光ってた」
「ヘイローが……光る？」
ヒマリは口元に指を当ててつぶやくと、軽く天井を仰いだ。
「ヒマリ？　どうしたの？」
「…………いえ。何でもありません。それよりピボットくんの変化は気になりますが……今は気にしている場合ではなさそうですね。先生、ピボットくんに対する情報はそれだけですか？　どこに行ったとか、そういうことは？」
「わからない。生徒会室のガラスを破った後、どこかに飛んでいっちゃったから」
「……そうですか。では、やることは変わりませんね。ハレのことは心配ですが、まずはアンチプロトコルへの対抗手段を整えなくては。……では先生、私は」
「うん。しつこいようだけど、くれぐれも無理はしないでね」
「ええ、心得ています。……先生の方こそ、無理はなさらず」
「………………うん」
　ヒマリと別れると、先生は通ってきた道を逆に引き返す。車椅子を押す必要がなくなったからだろうか。引き返した時の方が、だいぶ短く感じた。
その後、先生はヒナの命令でやってきたゲヘナの救護班とも協力して、目を覚まさない生徒たちの介護を続けた。と言っても、女性である生徒達に対してできることは少ない。できることといえば、ひたすらに歩き回って、生徒の様子を確認し続けることだけだ。
「先生、そろそろお休みになられてはどうですか？」
　深夜を回った頃だった。そろそろ、誰か目を覚ます人が出てこないかなと思い始めた頃、チナツに声をかけられる。
「ありがとう。でも、いつ誰が目を覚ますか分からないから……」
「そうは言いますが、昨日から禄に眠っていないのでしょう？　もし、誰かが目を覚ましたとしても、先生が倒れてしまったら、逆に悲しませてしまうと思いますが」
「……うん。そうだね。確かにその通りだ。わかった、ちょっと休ませてもらうよ」
　チナツに諭されて、先生は自分が意地になっていたことに気づいた。昨夜、多少の仮眠は取ったものの、ショックや不安で禄に眠れていなかった。その状態で半日近くヒナとともに作業を続けて、負傷者の介護を続けている。
大人しく従うことにした。
　その後、寝転んでみれば、ドッと身体が重くなる、自分が思ったより疲れていたことに気づいた。だが、すぐに眠りに落ちることはなかった。普段から徹夜を続けてるせいだろうか。いろんな感情が頭の中を渦巻く。
　特に感じるのは無力感だった。アンチプロトコルの危険性は理解していた。今のような事態になることも、考えていた。だが、いざとなれば大人のカードを駆使して止めるつもりだった。しかし、それも間に合わず、それどころかピボットくんと対峙した際、大人のカードもシッテムの箱も悉く無力化された。そのせいで、ハレまで連れ去られてしまった。もし、始めから大人のカードなんかには頼らず、もっと違うアプローチを取れていれば、違った結果にもなっていただろうに。そんなふうに自分を責めてしまう。
　だが、それよりも許せないのが、ピボットくんの苦しみを分かってあげられなかったことだ。彼が苦しんでいた時、罪悪感に苛まれていた時、大人として何かができたはずだ。
　寝返りを打ち、奥歯を噛み締める。
　この感情に身を晒すのが嫌で、自分は生徒の傍を離れようとしなかったのかもしれない。それを自覚して、自分の醜い感情にまた自己嫌悪に陥る。何度、それを繰り返した後か、気づけば太陽が真上に昇っていた。
　体育館に戻ると、昨日と変わらない光景が広がっていた。
「おはようございます。少しは眠れたようですね。顔色がとてもいいですよ」
「おはよう。おかげさまで、よく眠れたよ。それより、誰か目覚めた人はいる？」
「いえ、残念ながら……」
「そっか」
　目覚めた生徒はいないらしい。やはり、ヒマリは特別だったようだ。その分ヒマリの発明品が確かな効果を持つ証明になる。辛い思いをしてる生徒がいる以上手放しに喜んでいいことではないが、それはプラスに捉えてもいいだろう。
　時々、ヒマリの様子を見に行ったりしつつ、
過ごすこと三日。ようやく、眠っていた生徒の一人が目を覚ましたとの報告が来た。
　仮眠を取っていたが、飛び起きて体育館に向かう。すると、これまでとは打って変わった光景が広がっていた。
「これは……みんな、目を覚ましたの？」
「ええ。一人目が起きたと思ったら、立て続けに……」
　詳しく事情を聞いたら、一人目が目を覚ましたと思ったら、立て続けにみんなが目を覚ましたそうだ。しかし、それは皮肉にも喜ばしい状況ではなかった。啜り泣く、あるいは虚な目でボーッとした生徒が大半で、一部は怒りをあらわにする生徒もいた。そのほとんどが負の感情を身に纏っている。
「これ、どういう状況？」
「ご覧の通りです。みなさん立て続けに目を覚まされましたが、対応が追いつかず……」
頭を抱える救護班の生徒。交代制で休みを取っていたはずだが、叩き起こされたのだろうか。
「ようやく、アンチプロトコルの影響が薄れ始めたのでしょう。個人差によるものかと」
　突然割り込んでくる声。振り返ると、車椅子に乗ったヒマリがいた。
「こんにちは、先生。それと、ゲヘナの救護班の方も……ご苦労様です」
「はっ、ありがとうございます」
ヒマリの労いに対し、ビシッと敬礼で応える救護班の生徒。ヒマリはそれに対して微笑んだ。
「こんにちは、ヒマリ。車椅子、動くようになったの？」
　先生は世間話をする調子で尋ねる。先日まで、ヒマリの車椅子は自分か誰かの手で押さなけれら動かない状態だったはずだ。だが、今は自動で動いているように見える。
「いえ、これは緊急時のための予備です。乾電池で動くものなので、なんとか動かすことができました」
「そうなんだ。それはよかったね」
「ええ。それより、エイミにユウカも目覚めましたから、まさかと思って来てみましたが……やはり、カオスな状況に陥っているようですね」
「あ……ユウカ達も起きたんだ」
　ヒマリの言葉にハッとする。そういえば、昨日ヒナ達と被害者を運んだ際、ユウカとエイミだけは地下室で寝かせたままにしていたのだ。というのも、地下室にはヒマリが用意したふかふかのベッドにエイミの自室もある。下手に運び出すより寝かしておいた方がいいと思ったからだ。
「だから、セミナーを呼んでって言ってるじゃない！」
「そうだよ。今、何が起こってるのか教えて欲しいんだって！」
「で、ですから今はみなさん目覚めたばかりでして……」
怒鳴り声が聞こえてくる。ふと目を向けると、救護班の気の弱そうな少女が、あたふたとした様子で対応していた。
「ひとまず、この状況をなんとかしなければなりませんね」
「だね。
「いえ、ここは私にお任せを」
　ヒマリは先生と救護班生徒の間を割って、前に出る。
どこから出したのか、端末型の拡声器を口元に近づけ、
「みなさん。ご注目をお願いします」
体育館中に響く声量。思わず耳を塞いでしまうくらいに大きい声だった。
「ちょ、ヒマリ！？」
　思わず、先生が苦言を呈す。すると、ヒマリは顔を顰めて、端末を覗き込んだ。
「むっ……出力を少々いじったのですが、想定以上のパワーになってしまいましたね。失礼しました。調整します」
「あれ……うちの端末じゃ？」
　救護班の生徒が茫然とした表情でつぶやいた。よく見ると、端末の背面にゲヘナの校章が刻まれている。許可は得ているのかもしれないが、他校からの借り物を躊躇なく改造するとは、流石ヒマリだと先生は思った。
「あー、あー。てすてす。これでよろしいでしょうか」
　ヒマリが発した言葉に、全員がこくこくと頷いた。気づけば争っていた声や不満げな空気も全て吹き飛んでいる。それをみて、先生は推察した。ひょっとしたら、みんなの注目を集めるため、わざとそうしたのかもしれないと。
「さて、まずはお初にお目にかかる方もいるかもしれないので、軽く自己紹介を。私は薄氷の上で儚く踊る超天才美少女ハッカー、明星ヒマリです。全知の称号も持っている天才です」
なんで天才って二回言ったんだろう。そんなツッコミをたくさん聞いた気がした。
そして、なんとなくすごい人がいるらしい程度で、その姿が明らかになっていなかったヒマリに対するどよめきが耳に入る。
「さて、いきなりですが、皆さん。実は私は皆さんを襲った苦しみの正体を知っています」
　ヒマリがそう言ったことで、更にざわつきが増す。
「それって──」
「意識がありながら、お腹も空くのにトイレも行きたくなるのに、全く身体を動かせないというのは、さながら生き地獄のようだったでしょう。私も被害者の一人です。ゆえに、怒りに震える気持ちはよく分かります」
　ヒマリは拳を握り、震える声で言った。
「もちろん、その原因を特定したいとはやる気持ちも。ですが、だからこそ、今それを知ったとして、さらなる混乱に陥るだけでしょう。ここは一旦、気を落ち着かせるべきです。説明は‥‥そうですね。三日後の午前十時と、午後の十八時に講堂で行いましょうか。それなら、まだ目を覚ましていない方も出席できるかもしれませんし」
　ヒマリはぐるりと体育館の中を見回す。半分くらいの生徒は目を覚ましている。だが、やはりまだ眠り続ける生徒もいて、目を覚ました生徒達も、彼女達に悪いと思ったのだろうか。口をつぐみ、バツが悪そうにしていた。そんな中、一人の女生徒が声を上げる。
「……分かりました。ですがヒマリさん、ひとつだけ教えてくれませんか？」
「なんでしょう？」
「また、私たちが眠りに陥ることはあるのでしょうか？　また、あの生き地獄に陥る恐怖に怯えて、日々を過ごさなければいけないんでしょうか？」
　両手を握り、祈るように言った。口調こそ疑問形だが、彼女の表情は否定を求めてる。もう、あんな悲劇は起こらないと、言ってほしいのだろう。だが、真実は……。
　ヒマリはどう答えるのだろうか。彼女の横顔を伺う。
「……しばらくは大丈夫でしょう。あれほどの規模の災害は、そう立て続けに起こるものではありません。もし、何かがあったとしても、一時的にスマホや電子機器が使えなくなる程度の被害で済みます。それに、この苦しみに対抗する術は用意してあります。ですから、ご安心ください。このような悲劇は二度と起こしませんとも」
　彼女は余裕を持った笑みを浮かべると、力強く訴えかけるように言った。
　本当と嘘が入り混じってる。
　パアッと顔を華やがせたり、安堵の息をつく。この空間で、ヒマリの言葉を疑っている人間は少ない。中でも確信を持っているのは、事情を知っている先生だけだ。
「……ヒマリ、さっきの話って少し、嘘ついたよね？」
話が終わり、ヒマリの車椅子を押し、体育館を出ると、周囲に誰もいないことを確認して、先生は問いかけた。
「もし、ピボットくんに何かあったなら……またアンチプロトコルがみんなを眠らせることもあるよね？」
「ええ。ですが、先生がおっしゃっていました。ピボットくんは一言も喋らず、無機質な声を発していたと。アンチプロトコルの暴走条件は感情です。もし、彼が人らしさを失っているなら、アンチプロトコルの暴走は無いと思ったのです……まあ、結局は根拠のない運頼みですが、みなさんを安心させるには、あれが最も効果的でしょう」
「……危険な博打だよ」
　ヒマリの身を案じていた。　彼女は嘘をついた戦犯として、吊るし上げられるだろう。その華奢な肩に、責任がのしかかりすぎている。
「博打はリスクに見合ったリターンを返してくれるものですから。……それに、アンチプロトコルの暴走の規模は、数を重ねるに連れ、加速度的に強大化しています。仮説ではありますが、おそらく、もし次アンチプロトコルが暴走したとしたら、キヴォトス全体に影響を及ぼすほどの規模になるでしょう。ですから、同じことなのです。どっちにしろ次にアンチプロトコルが暴走したら終わりなんですから」
　そういったヒマリの言葉は固く、本気でそう思っているのが伝わってくる。
大人のカードもシッテムの箱も刃が立たなかった。仮にシールドを張ってくれたとしても、無事では済まないかもしれない。情けない限りだが、何も言い返せなかった。
「……アンチプロトコルに対抗する手段はないのかな」
　だが、その言葉はすぐさま否定された。
「……現状は、私が発明した対アンチプロトコル絶縁体シートしかありません。ですが、まるっきり打つ手がないわけではないわけではありません」
「それに必要な手って？」
「……決まっています。ハレを取り戻し、ピボットくんを連れ戻すのです」
　そういったヒマリの眼差しは冷たい。口調も、まるで感情のこもっていない機械のように淡々としていた。ひどく、嫌な予感がした。
「……連れ戻してどうするの？」
　先生は続きを尋ねた。ヒマリがあえて言葉を少なくしていたことに気づきながら。
「簡単なことです。彼の身柄を拘束したら、例の布で体を覆い、アンチプロトコルを消滅するための研究を再開するのです。もちろん、彼の同意も得ますよ。……彼が人間らしさを失っていなければ、ですが」
「それは、ピボットくんに話が通じなかったら、破壊するつもりってこと？」
「…………ええ」
「だめだよ。そんなこと！」
「……先生は、お優しいのですね」
　ヒマリはパチパチと瞬きをした。それから膝の上で手を組んだ。
「少し、私の考えを誤解されているようなので補足させていただきますが、私は何も問答無用にピボットくんを破壊しようなどとは考えていません。あくまで、彼が理性を失い、こちらに甚大な被害を及ぼす兵器と化してしまっていた場合の話です」
「でも、ピボットくんだって私の生徒の一人だよ」
「そうですね。ですが、先生はアンチプロトコルを有する彼を野放しにするのですか？　今度は本当に死んでしまうかもしれないのに」
　ヒマリの淡々としていた口調が、初めて熱を帯びる。雰囲気こそ冷静だが、内心腸が煮えくり返っているのが伝わってきた。
「……先生。先生がピボットくんを生徒として、大切に想っているのはわかります。ですが、今の彼はハレを攫い、ミレニアムを混乱に貶めた兵器です。彼が優れていた人格を持っていたのは認めますが、現状から見て、そう言わざるを得ません。……それでも、ピボットくんに情をかけますか？　そういうことなら、残念ですが、我々は袂を分かつことになるでしょう」
　わかっている。正しいのはヒマリで、感情論を振りかざしているのは自分だ。だが、いかなる理由があろうとも、何かを得るために大事な生徒を犠牲にするなんて、できそうにもない。それと同じように、ヒマリにも確固たる信念があるはずだ。だから、これ以上会話を続けていても、水掛け論になるだけだろう。ヒマリも、同じ結論に至ったようだ。
「…………柄にもなく熱くなりすぎました。現状ハレを連れ去ったというピボットくんの位置も、実際に安置プロトコルに対してどれほどの効力を持っているかも不確かです。実際に行動に移すためには、時間がかかるでしょう。ですから、お互い、もう一度頭を冷やして考えてみませんか？　私達がキヴォトスを守るために、何をするべきなのか」
「……そうだね。ごめん、私も熱くなりすぎたよ」
「では。私はこのあたりで失礼します」
「うん。じゃあ、私も体育館に戻るよ」
　ヒマリはそういうと、まだ道半ばだが、スマホの端末を取り出し、車椅子を操作して行ってしまう。だんだん遠ざかっていく背中を、先生は見つめることしかできなかった。

三日後。予定通り、講堂にてアンチプロトコルに対する説明が行われた。
　だが、その時説明されたのは、アンチプロトコルがどういうものなのかということと、対抗策として例の絶縁体シートがあるということのみ。発生源は不明とし、ピボットくんの正体が明かされることはなかった。その理由を尋ねてみた。
「ピボットくんの話をしても、いらぬ反感と混乱を買うだけでしょうから」
　午後。地下施設の一室、会議室のような部屋の奥で、ヒマリは答えた。
「ねえ、ヒマリさん。なんでこのメンバーが集められたのか、聞いていいかしら」
　ユウカが、訝しげに眉をひそめ、ヒマリに問いかけた。
　会議室には、ヒマリによって数名の生徒が集められていた。ヒナにエイミ、ユウカとユズである。
　先生を含む五人は、それぞれ中央のテーブルを挟み込む三人がけのソファに座っていた。ヒマリは奥のホワイトボードの前にヒマリが車椅子に座っている。
「な、なんで私がここにいるんですか……？」
先生の両脇にはユウカとユズが座っている。
　ユズはビッタリと先生の腕にくっつき、青い顔で震えていた。
「ユズ、ここにあなたを呼んだのは、ピボットくんのことを知っているからですよ」
　先生の代わりに、答えたのはヒマリだ。ユズがびくっと肩をすくめる。
「それに、ユズだけではありません。今回集めた皆さんは、全員ピボットくんの存在を知っている人です」
ユズとヒナは、ピボットくんと直接顔を合わせたことはない。だが、ヒナは彼の脅威を、ユズはボイスチャット越しにコミュニケーションを取ったことがある。
「──ピボットくんの脅威については、先ほど講堂で説明したとおりですが、あの場にいなかった人もいるかもしれません。アンチプロトコルのことから、改めて説明しましょう」
ヒマリはホワイトボードを使って、アンチプロトコルと、ピボットくんの関係について説明していく。
「あ……あれって、ピボットくんのせいだったんですか……」
　ユズは合点がいったように納得すると、先生の肩を掴む手に力を込めた。彼女は説明会にも参加しておらず、先刻の災害の影響を知らなかった。というのも、彼女は極度の人見知りであり、授業もオンラインで済ませているため、基本的に部室やから出ることはない。特にお気に入りなのがロッカーで、酷いときには一日中出てこないこともある。そんな日常を送っているからか、アンチプロトコルの影響を受けた際もロッカーの中にいて、見つけてもらえなかったそうだ。ただ、本人談によると、居心地のいい場所だったから、動けなくてもそんなに苦でもなかったらしい。
「ええ。まあ、彼も悪意を持って暴走したわけではないのですが……それは今は置いておいて。そんなピボットくんですが、実はアンチプロトコルを振りまき、ミレニアムを機能停止に追い込んだ直後、ハレを連れ去り、どこかへ消えたとの報告が先生からありました」
「えっ！　ハレが！？　ヒマリ部長！　ハレが攫われたってどういうこと！？」
　ハレが攫われた。そう聞いた瞬間、ユウカは立ち上がり、ヒマリに詰め寄った。
　すごい剣幕だった。書類を溜め込んだ時も、大量のおもちゃを買ったことがバレた時も、ここまで迫真な様子は見せなかった。
「おちついてください。私もあくまで先生からその事実を聞かされただけです」
　ヒマリは憤るユウカを宥めると、先生に目を向けた。この続きは、実際にその現場に居合わせた人にしてほしいということだろう。ユウカやヒナたちの視線も集まる。
「うん。みんなが倒れた後、私は生徒会室でピボットくんと会ったんだけど──」
　先生は数日前の出来事を思い出しながら語った。話したのは、概ねヒマリに伝えたことと同じ、ピボットくんのヘイローと目が赤く輝いていたことと、ハレを連れ去り、飛び去ったということだ。
「そんな……それって、もう何日も前のことじゃない！　どうして何もしなかったの！？」
「……何もしなかったのではありません。できなかったのです。先生からその話を聞いた時は、アンチプロトコルへの対抗策を仕上げるのが、最優先でした」
「だからって……ハレがどうなってるかわからないのに、放っておいたっていうの！？」
「……落ち着いてください、ユウカ。私だって、不本意だったのです。本当はすぐにでもハレを探しに行きたかった。ですが、私以外の人は皆眠りについていて、ピボットくんの位場所もわからない。そんな状況下では、いくら天才たる私でも、できることはそう多くありません」
「……そうね。ごめんなさい。ちょっとカッとなっちゃったわ」
　ユウカは唇を噛み締めた。ここで冷静になれるのが、彼女の頭の良さを証明している。そして、頭がいいから分かっているんだろう。呑気に眠っていた自分がヒマリに何も言えるはずがないと。
「それより、ピボットくんはどうしてハレを攫ったのかしら」
「それは分かりません。ですが、ロクでもないことなのは間違い無いでしょう」
「あ。そういえば、ハレってアンチプロトコルの耐性があったんじゃなかったっけ？　もしかして、それが目的で攫われたんじゃない！？」
「……その可能性は私も考えました。ですが、確証の無いことです。今、ハレが攫われた理由を考えても仕方ないでしょう」
「そうね。問題はどうやってハレを救い出すかよね」
「ええ。ここから先は、私も手をこまねくつもりはありません。本格的にハレの救出に向けて動きます。今日、皆さんを集めたのも、その協力を仰ぐためですから。というわけです。皆さん。どうか、ハレを救い出すために手を貸していただけないでしょうか」
　ヒマリはユウカと合わせていた目をみんなに向けると、懇願するようにいった。
「当然、私は賛成。ハレが危険な目に遭ってるのに、じっとなんてしてられないから」
　最初に賛同を示したのはユウカだ。鼻息荒く、胸を張っている。
「私は初めから、部長についていくつもりだよ」
　続いて、エイミも首を縦に振った。これでメンバーは二人確定した。あとはユズとヒナがどう出るかだが。
　ヒナがユズの様子を伺う。
　ふいに合ってしまった目に怯えながらも、ユズが小さな手を上げた。
「あ、あの……質問、いいですか？」
「はい。なんなりと」
「もし、ピボットくんを捕まえることができたら、モモイやミドリ達の目も覚ますことができますか？」
　そう尋ねたユズの声が裏返っている。よく見ると、手や目も震えていた。勇気を出して聞いているのがよく分かった。
　アンチプロトコルを最も近くで浴びた分、あるいは眠っている間に重ね掛けで食らった分影響力が大きいのか、モモイ達は未だに目が覚めていない。ユズが目覚めてるのは、彼女だけ別室でプレイしていたからだ。ゲーム開発部の部長として、責任を感じているのかもしれない。
「それは分かりません。ですが、ピボットくんを捕え、研究が出来れば、アンチプロトコルに対する対抗薬を作れる可能性はあります」
「じ、じゃあやります。みんなを助けられる可能性が、少しでもあるなら……」
　残すはヒナだ。全員の視線が集まるが、彼女は怯えることなく、
「……悪いけど、私はまだ頷くことはできない」
　プレッシャーを振り落とすように、ゆっくり首を振った。
「アンチプロトコルをピボットくんを捕獲することがアンチプロトコルへの対策に繋がるのはわかった。でも、具体的にどうやるの？　悪いけど、それを聞かないことには判断することはできない」
「もちろん、考えはあります。少々お待ちを」
　ヒマリは部屋を出ていく。数分ほどして、戻ってきた彼女は小さい大砲のような銃を抱えていた。
「ピボットくんを捕獲する際にはこれを使います」
「それは？」
「グレネードランチャーです。弾は絶縁体シートを加工した捕獲用のネットを使います。これを対象にぶつけることでアンチプロトコルを無効化し、捕らえる作戦です」
「……なるほど。それ、威力は確かなの？」
「ええ。何度も試し打ちはしましたが。射程距離は三十メートルですが、



「三十……結構近づかなければならないのね」
「ええ。ですが、威力は保証します。捕獲用ネットが広がり、動くこともままならない程に、確実に拘束します」
「そう……でも、まだ足りない。そもそも、そのシートは本当に効くの？　アンチプロトコルに絶縁体が有効というのは理解したけど、それは絶対と言える？」
「可能な限りの検証は重ねました。ですが、ピボットくんがどれほどのアンチプロトコルを保有しているかは未知数です。」
「なるほど。つまり、作戦の信頼性は薄いのね？」
「ええ。申し訳ありませんが……ですが、ひとつだけ確信を持って言えることがあります」
「なに？」
「たとえ不確かだとしても、何もしなければキヴォトスに甚大な被害をもたらす災いが起きるということです」
　ヒマリは力強く訴えかけた。しばらく、ヒナは考え込むと、
「……わかった。そういうことなら、協力はしてもいい。でも、いくつか条件がある」
　やがて目を上げ、口を開いた。
「なんでしょう？」
「具体的な日にちや、作戦の詳細が決まったら、改めて教えて欲しい。本当に協力するかどうかは、その時に決める」
「分かりました。こちらとしても、勝ち目のない戦いをするつもりはありませんので、同じことです」
「それと、作戦の人数はどれくらい必要なの？　もし、数が必要ならチームを編成する必要があるから、時間をいただきたいのだけど」
「その必要はありません。ピボットくんが想定外のアンチプロトコルを持っていた場合、数の利は意味を成しません。なので、作戦は少数精鋭で行います」
「……そう。わかったわ。それと、今日話したことは風紀委員の何人かには伝えておいてもいい？　もちろん、人はそれなりに選ぶ」
「それくらいなら構いません。ヒナさんが信用している人なら、信用できますから」
　話がまとまったようだ。ヒナは無言で頷くと、机に置かれていたカップに口をつけた。
「では、ひとまずヒナさん以外は、ピボットくんの捕獲には協力していただけるということでよろしいですか？」
　全体を見回しながら放たれたヒマリの言葉にヒナを除く全員が頷く。
「じゃあ、話は終わり？　申し訳ないけど、この後の予定も詰まっているのだけど……」
　ヒナが腕時計を確認しながら言った。分刻みのスケジュールに追われている彼女だ。方便ではないのだろう。
「ええ、構いません。エイミ、皆さんのお見送りを」
「はーい」
エイミに見送られ、先生達はその場を去った。






　二日後。先生達は再び地下の会議室へと集められた。先日と同じ配置で座る。
「皆さん。今日はお集まりいただき、ありがとうございます。早速ですが、ピボットくんの位置を特定することに成功しました」
「早かったね」
　みんなが思っていたことを先生が代弁する。先生を含めてみんな、手がかりなしの状態からピボットくんの居場所を探り当てるには、もっと時間がかかると思っていた。
「何をおっしゃってるのです。きっかけは先生の発言ではありませんか」
　ヒマリは可笑しそうに笑っていった。
「でも、ピボットくんの場所を見つけてくれたのはヒマリだよ」
先生も苦笑する。
そう。実は、これほど早く居場所の特定に成功したきっかけは、先生の一言だった。
　それが生まれたのは、エイミに見送られ、地下室を出た後のことだ。
　ユウカはノアやみんなの様子を見に行きたいと早々に別れた。そして、ユズと二人、気晴らしに散歩でもしようかという流れになって。
「それにしてもユズ、さっきはよく頑張ったね。初対面の人もいるのに、あんなふうに発言するなんて」
「早く…………みんなとゲームがやりたいですから」
ユズが笑う。彼女は人見知りだが、みんながピンチの時にはリーダーシップを発揮することもある。あまり知られていないが、彼女の魅力のひとつである。
「ゲーム……」
「せ、先生？　どうかしましたか？」
「ああいや、ちょっと思いついたことが……」
　ユズがゲームの話をしたのがきっかけなのか、そういえばRPGとかだと、重要なアイテムがあった場所には、何か縁みたいなものがあるよねって、ふと思った。つまり、彼のコアがあった場所にいるんじゃないかと。ゲームなどではよくある展開だからだ。ただ、根拠なんてものは一切なかったし、ほぼ冗談のつもりだった。だから、ヒマリに伝えた時もあまり当てにはしないでほしいと言ったのだが……。
　ヒマリが偵察用のドローンを飛ばしたところ、ある場所で完全に無効化された。不審に思い、電波を飛ばしたりさらに調査機器を送ったりしたところ、アンチプロトコルが発生していることを突き止めてしまったというわけである。
「さて、では作戦の説明をしましょう。まず、今回の目的は二つ。ハレの無事を確認すること、ピボットくんの状態を確認することです」
　ホワイトボードにはあらかじめ作戦の詳細や開始の日程などが書かれている。その中から、ヒマリは二つの目標を読み上げる。
「ちょっといい？」
　それに対し、ユウカが手を挙げた。
「目的はハレの救出とピボットくんの捕獲じゃないの？」
　全員の視線を集めると、ユウカは堂々と意見を口にした。
　その通りだと先生も頷く。今回はハレの救出作戦だ。それが目的だと思っていたのだが。
　ヒマリが「いいえ」と首を振る。
「もちろん、それができれば一番いいのですが、何しろ相手の情報がほとんどありません。ですから、今回は情報を得ることに努め、本格的な捕獲は後日、改めて準備を整えてから行います」
「私も賛成。仲間が心配な気持ちはわかるけど、相手のことを何も知らないのにただ闇雲に突っ込むのは、自殺行為だと思う」
「つまり、二段構えの作戦ってこと？」
「そういうことです」
「分かったわ。話の腰を折ってごめんなさい、続けて」
　ヒマリはユウカの言葉に頷くと、ホワイトボードに沿って説明を続けた。
「というわけで、出発は明日の早朝。始発の電車に乗り、目的地である旧キヴォトス第三天文台に到着次第、入念の装備を整え、決行します。問題のある方はいますか？」
　ひなを見る。この中でスケジュールに調整がいるとすれば、彼女だけだろう。
「大丈夫。空けれるわ」


「続いて、装備についてですが、当日、目的地に到着後、皆さんにはそれを素肌につけていただきます」
　初めから机に置かれていた、透き通るような肌色の防具。腕や足、上半身や下半身など、それぞれパーツごとに分かれている。
「これは絶縁体の保護具です。こちらは視認しやすいよう、わずかに色付けを行っていますが、実際には無色透明のようなものをします。見た目に変化は出ないでしょう。また、アンチプロトコルはわずかに隙間があっても影響を受けます。そのため、パーツごとに重ねがけし、隙間を完全に無くすことで対策します」
　つまり、遊びの部分を重ね合わせることで、密閉してしまうということだ。
「ここまでで何か質問はありますか？」
「それって密閉するのよね。呼吸はどうするの？」
「ご安心を。呼吸に関しては、顔につける部分がマスク型になっていますので、それに酸素ボンベを繋げることで対策します。厳密には違いますが、酸素マスクのようなものだと思ってくれればいいです」
「わかった。


「目的地までは電車で行くの？　車とかじゃなくて？」
「ええ。目的地は山の中にありますから、車を使うよりは徒歩がいいかと。結局、公共交通機関と徒歩で行くのが一番いいかと」
「分かった」

「以上、小鈎ハレ救出及びピボットくん捕獲作戦の会議を終了します。各自、明日に備え、本日はゆっくりと休んでください」

コノヘンからファイン


そして翌日、早朝。先生たちは地下会議室に集合した後、あらかじめ顔部分以外の保護具を全身に纏ってから、ミレニアムサイエンススクールの最寄り駅へと向かった。
「うう……汗でへばりつきます」
ユズが苦言を漏らす。
「ヒマリ部長。これ、つけるの到着してからでもよかったんじゃない？」
ユウカが腕を摩りながら、ユズの調子を慮るように言った。
「気持ちはわかりますが……検知についてからの手間はなるべく減らしたかったですから。我慢してください」
　泣き言をヒマリは一蹴する。
「まあ、別にいいけど……それにしても、
「私は遠征とかで窮屈なのには慣れてるから」
「へえ。やっぱり、風紀委員って大変なんですね……よかったら普段、どんなことをしてるのか聞いてもいい？」
「そんなに大したことはしてないけど──」
　ユウカとヒナが世間話を繰り広げる。これから危険な場所へ赴くというのに、まるで遠足のような雰囲気だ。そうして歩くこと三十分強、ついに目的の旧第三天文台へと到着する。
「さあ、目的地に到着しました。ここからは一層危険が伴います。皆さん、気を引き締めてください」
　少し前から、酸素マスクの装着は済ませていた。
「突入前に、作戦をおさらいします。くれぐれも安全重視で、危なくなったらすぐに撤退します。また、酸素ボンベの供給は約一時間半。念の為予備は用意してありますが、帰りの時間も考え、タイムリミットは四十分前後だと思ってください」
　全員が頷く。
「では、参りましょう」
　苔むした扉を開く。前に来た時と比べ、中の様子は一見変わっていない。しばらくして、PCのある場所へと辿り着く。
「PC……ですか。ちょっと触ってみましょう」
　ヒマリが近づき、PCにアクセスする。

　だが、唯一あの時と違う点がある。
「これはなに？」
　ユウカが割れた地面から迫り上がっている台座を見つけ、不思議そうに手を伸ばした。
「ここにピボットくんのコアがあったんだ」
　ピボットくんのコアは回収済みのため、そこにあるのは空の台座だけだ。
「コアってなんですか？」
「なんていえばいいんだろう……心臓みたいな形をしたもので、部室に来たばかりで動かなかったピボットくんに近づけたら、動くようになったんだ」
　あの時はハレと一緒におしゃべりしてたんだっけ。そういえばしばらくコーヒーを飲んでいないことを思い出す。
「……不思議ですね。このPC。見たことないセキュリティで厳重にロックされています。この先に、大事なものがあるのでしょうか」
　ヒマリがぶつぶつとつぶやいてる。
　そんな中、エイミが声を掛けてきた。
「先生。見て。ここ、扉みたいなのがあるよ」
「え？　……本当だ？」
「んっしょ！」
　閉じられた石の床を、手でこじ開けてしまう。
「な、なんていう力技……」
　先生が苦笑いでつぶやく。
「すごい怪力ね……」
　ヒナも面食らっているようだった。
「スマートではありませんが、まあいいでしょう。進んでみましょうか」
中は広々とした通路が続いていた。


「ここは……まさか、地下にこんな空間が広がっているとは、思いもしませんでしたね」
「なんだか、ヒマリの地下室みたいだね」
「全然違います。私はこんなセンスのない造りにはしませんから」
車椅子用にはなっていない。そのことに文句を言っているようだ。
「みんな！　伏せて！」
突然立ち止まったヒナが叫ぶ。
『先生！　危ない！！！」
ふと、脳内をつんざくアロナの叫び声。
次の瞬間、無数の銃弾が一行を襲った。
『ありがとう……アロナ、助かったよ」
　間一髪のところで、アロナがバリアを張ってくれたおかげでなんとか助かる。危なかった、もしアロナがいなければ蜂の巣になっていたところだった。
「……まずいわね」
　呆気に取られていた意識が、ヒナのつぶやきで引き戻される。
　ハッとして正面を見てみれば、数え切れないほどの敵の数。オートマタや人型防衛ロボットなど、銃火器を持った敵が列を成していた。
「う、嘘……あれって、オートマタ！？　どうしてこんなところに！？」
　ユウカが絶望に満ちた悲鳴を上げた。

　ここは第三天文台だったはずだ。それなのにどうして、こんな大掛かりな防衛システムがあるのだろうか。
「はあっ！」
　バン！
銃声が響く。音のした方向に目を向ければ、ヒナが愛用の「」を構えていた。
「ユウカ、狼狽えてる暇はないわ。今はこの状況をなんとかする方法を探さないと」
　続けて、何人かの敵に向けて発砲を繰り返しながら、ヒナはユウカに発破をかける。


「そ、そうね。考えるのは後！　確かに今は、この状況をなんとなしないと！」
　続いて、ユウカも自身の愛銃を手にする。そして、ミメシスに向けて、攻撃を開始する。
「先生達は下がってて」
　エイミも、密かに戦闘準備を進めていた。先生とヒマリを守るように立ち、アサルトライフルを掃射する。
「わ、私も戦います……一応、銃はあるので」
ユズも前に出た。
「先生、下がりましょう」
「うん」
　武装と耐久力を持たない先生、ヒマリは半歩下がる。


「ふん。そんなの当たらな──あいた！　痛い！　痛いってば！」
前線に飛び出て、華麗に銃弾をかわしていたユウカだが、集中砲火を浴びてしまい、攻撃を受けてしまう。
「ユウカ！　左に逃げて！」
先生が叫んだ。その言葉に、ユウカは反射的に左へと逸れる。
「ヒナ、ユズ！　集中砲火！」
「そういうこと……」
「ぜ、全力で行きます！」
　そう。最前線に出ていたユウカが射線に被り、ヒナもユズも気を遣いながら戦っていたのだ。だが、ユウカが左に逸れたことで、一時的に射線が開けた。またとない攻撃チャンス、先生は見逃さない。

「ユズ、少し右に行って！　多分そっちの方が撃ちやすい！」
「は、はいぃ……あ、なんだかクリティカルがいっぱい出てる気がします……」
「ユウカ、エイミとスイッチ！　エイミ！　敵全員に弾を当てて、挑発して！」
「はーい」
　エイミが指示通り、全体に少しずつダメージを与え、ヘイトを集める。ゲームで例えるなら、タンクの役割をユウカの代わりにこなす。
　あとはもう、本人達に任せて大丈夫だろう。
「ユウカ、大丈夫？」
「ええ。ちょっとジンジンしますけど、私達の体はそんなにヤワではないので」
「そっか、流石だね」
　一旦指示をストップすると、先生は戻って来たユウカの前に膝をつき、負傷した部分を確認する。血が出たりはしていなかった。銃弾を浴びてもピンピンしているのは、流石キヴォトス人の耐久力と言ったところな。
「ユウカ、保護パーツが破れていたりはしませんか？　耐久性も考慮して作ったので、そう簡単には破れないと思うのですが」
「うん、それも大丈夫だと思う。全然、破れてないわ」
「念のため確かめます。…………ふむ、これなら大丈夫でしょう」
ユウカの肌が露出されている部分をまじまじと確認していく。しばらくして、安心したように頷いた。
「見ただけでわかるの？」
「ええ。説明はしていませんでしたが、実はこのパーツにはちょっとした仕掛けがしてありまして。少しでも破れたりすると、その周辺がうっすら緑色に染まるので」
「なるほど」
　流石はヒマリ、緊急事態に備えて、目印をつけていたようだ。
その後、ユウカとエイミをスイッチさせつつ、ヒナやユズの火力で敵を殲滅していく。
　しばらくすれば、壊れたオートマタの残骸を遮蔽にしたりして、被弾を抑えることもできた。順調に、一方的に倒す流れもできた。しかし、戦況が芳しいとはいえなかった。
「ちょっと！　これ、どういうこと！？　倒しても倒しても数が減らないんだけど！？」
「ヒマリ、弾も少なくなってきたし、撤退した方がいいかも」
各自が携帯している分に加え、エイミが背負って来た巨大なリュックサックに詰め込んでいた。それらも三分の一程度まで減ってしまっている。
「……そうですね。何の情報も得られていませんが、仕方ありません。ここは仕切り直した方が良さそうです」
「よし、みんな！　一旦引こう！」
「了解！」
撤退の指示を出す。
そして、後方を振り返ると。
「…………そ、そんな」
ユズが蒼白な声で呟く。
後方にも、大量のオートマタが控えている。
「な、なんで逃げようって時に来るのよー！！！」
　ユウカが絶叫した。
「ど、どこから来たんだ！？」
　先生は絶句した。今、一本道だったはず。扉や怪しい部分もなかった。この数のオートマタが来るなんて、あり得ないはずなのに。
　そして、最悪なのは挟まれていることある。逃げるにしても進むにしても、どっちかを突破しなきゃいけない状況だ。
「先生、道は私が切り開く」
　そういって、一気に敵の集団の中に突っ込んだのはヒナだ。どうやら、ゲヘナの風紀委員長は銃撃戦だけでなく、肉弾戦も行けるらしい。そこから先は千切っては投げ、撃っては蹴散らす。小柄な体で敵の大群を蹂躙する様は、些か現実離れしていた。
「さ、流石ゲヘナの風紀委員長……鬼気迫る強さだわ」
　出来た隙を窺い、なんとか突破しようと試みるも。
「ダメ！　こっちは敵が多すぎる！　向こうの何倍もいるじゃない！？」
　ユウカの言う通り、廊下のはるか奥まで、オートマタの大群が見えている。しかも、床や天井、壁の至る所に開けられたハッチから伸びたアームに、壊れたオートマタが回収されてしまう。遮蔽を使う作戦も無理だった。


「先生！　こっち、敵の数が減って来たかも！」
　万事休す。そう思った時、背中の方からエイミの声が聞こえる。
「先生、向こう側は敵が少なくなって来ているようです。どうされますか？　選択肢は二つです。出口に向けていくか、先に進むか」
　ヒマリが状況を説明してくれた。
出口側に兵力を集中している分、逆側は手薄になっているのだろうか。いや、どちらかと言えば誘導されているような気がする。果たして、このままそっちに進んでもいいのだろうか。
　先生は考え込んだ。しかし、時間もなかった。
「進もう」
「……そうですね。私も賛成です」
聡明なヒマリのことだ。気づいてないなんて、あり得ない。しかし、それでもやはり、後方に行くよりはマシだと思ったのだろう。
　先生も同じ考えだ。だが、先生には別の考えがある。
　大人のカードとシッテムの箱の存在。一度破られた代物だ。過信はしていない。対策は積んでいた。実は昨日の会議が終わった後、先生はヒマリに追加の保護パーツを借りていた。シッテムの箱も大人のカードも、それで包んだのだ。

ピボットくんのハッキング能力はアンチプロトコルが強く影響しているという。だったらそれを無効化してしまえばいい。そして、大人のカードとシッテムの箱は、絶縁体で包まれようとも効力を発揮する。いざとなったらその力を使い、みんなだけでも逃がすつもりだった。
「とはいえ、このままじゃ進むこともできないんだよね……どうしよう」
　現状、ヒナがたった一人で抑えてくれているものの、それもどこまで持つか分からない。
「先生、ヒナさん達を呼び戻していただけますか？」
　打開策を必死に絞り出していると、ヒマリが
「いいけど、なにか作戦でもあるの？」
「これを使います」
「あー、オッケー」
　ヒマリが膝に抱えていたものを見て、先生はすぐにその意図を理解した。
「ヒナ！　こっちまで戻ってきて！」
「わかったわ！」
バックステップで、一足飛びに戻ってくる。
「今！」
「ええ！」
　次の瞬間、先生が指示を出すよりも早く、ヒマリは手に持っていたグレネードランチャーを発射する。すると、廊下を覆い尽くすような網が飛び出し、敵の大群を一網打尽にする。ヒマリが誇らしげに笑っていた。
「ふふ、天才美少女である私が設計したのです。そう簡単には逃げられませんよ……とはいえ、全ての敵を捕らえるほどではありません。先生、今のうちに」
「うん。エイミ、ヒマリを頼める？」
「わかった」
　リュックを背負い、さらに車椅子ごとヒマリを持ち上げるエイミ。
　ユウカとユズ、ヒナが残った敵を迎撃しながら、敵の間を縫っていく。
「はあ……はあ。よかった。逃げられたね」
なんとか敵の追ってこないところまで、逃げ切る。
「とりあえず、ヒナさんの止血と保護パーツの交換を行いましょう」
　それと、みんな激しい戦いを繰り広げたからか、酸素の量が残り少なくなって来たからだ。
　予備はあと一回分。つまり、まだ焦る時間ではない。
「それにしても妙ね」
　ヒマリの手当てを受けながら、ヒナが言った。
「ヒナ、どうしたの？」
「先生も妙だと思わない？　あのオートマタ達、私にはある一定のラインを超えた瞬間、ピタリと追いかけるのをやめたように見えた。まるで、目的を果たしたみたいに」
「ええ。それは私も感じていました。まるで、誘い込まれてるようだと。そして、敵が現れたタイミングも考えると、私達の居場所は敵に筒抜けだと考えた方がいいでしょう。こうして野放しにされているのか不思議なくらいです」
　円を組むように座って話し合う。
「とりあえず、今は進むしかないんじゃない？　この奥にハレがいるんでしょ？」
「そうですが……弾薬の数もそう多くはありません。捕獲用ランチャーもひとつ使ってしまいました。ここから先は、交戦は出来る限り避けた方がいいでしょう。そして、出口を探します」
「賛成だけど……出口なんてあるのかな？」
「これくらい入り組んでいるのですから、出口がある可能性はあります。もし見つからない場合は……苦しいですが、元来た道を戻るしかないでしょう」
「私もそうするしかないと思う」
「……異論はないわ」
「わ、私は皆さんにお任せしますぅ……」
　全員の意見がまとまる。それからすぐに立ち上がり、行こうと決めた時だった。
「残念だけど、入り口は一つしか無いんだよね」
「誰！？」
　突然、進行方向からかけられた声。その気配にヒナも気付けなかったようだ。だが、さすがは百戦錬磨の風紀委員長。一瞬で臨戦体制に入る。遅れて、ユウカ達も銃を構えるが、すぐに下ろすこととなった。
「嘘…………は、ハレ？」
　ユウカが蒼白な表情でつぶやいた。廊下の奥からゆっくりと近づいてくる黒衣を纏った少女は、ハレによく似ていた。違うのは服装と、赤と紫に染まったヘイローと薄く朱に染まった瞳の色彩だけだ。
「うん。久しぶりだね、ユウカ」
ハレに似た人物が口角をわずかに上げた。
「ハレ！　よかった！　無事だったのね！」
ユウカが歩み寄ろうとする。その肩を無言で掴んだのはヒナだ。
「ひ、ヒナ？　どうしたの？」
「ユウカ、多分、近づかない方がいい」
　ヒナが低い声で言った。ユウカの方は見ないまま、鋭い目を正面に向けている。
「ハレ……どうしたのです？　ずいぶんイメチェンをしましたね」
「これ？　白だと汚れが目立つから、新調したんだ。似合ってるでしょ？」
　ハレは妖しげな微笑を浮かべると、コートの一部分を摘んで自慢気に言ってみせた。
黒い光沢の効いたコート。彼女がいつも着ている白衣の色をそのまま反転させたようなデザインだ。普段のハレの様子と比べて、強いギャップを感じる。
「……では、そのヘイローと瞳も新調したのですか？　私の知ってるハレのヘイローは黄色に黒、瞳は美しい若葉色だったはずですが」
「美しいなんて、照れるなー。そうだよ、せっかくだし、こっちも変えてみたんだ。似合ってるでしょ？」
「……いいえ、悪趣味な色です。くだらない掛け合いはやめにしましょう。正直に答えてください、あなたはだれですか？」
「ヒマリ部長、変なこと聞くんだね。私だよ、私。ヴェリタスのハレだよ」
「…………私の知ってるハレは、そんなふうに笑う子ではありませんが」
「それは……多分、私が大人になったからじゃないかな」
「どういう意味です？」
「よく言うでしょ。自分にとって大切なことを見つけたり、人生の分岐点になるような出来事を体験したりすると、人は成長するって。私にもそれが起きただけの話だよ」
「何が起きたんですか？」
「さあね」
　抽象的な言葉でのらりくらりとあしらっていく。ヒマリがギリっと奥歯を噛んだ。
　会話が途切れたところで、今度はヒナがすっと前に出る。
「……あなたが小鈎ハレ？　比較的優秀な生徒が集まるというミレニアムの中でも、ひときわ天才だと言われているのを聞いたことがあるけど」
「自分を天才だとは思わないけど……そうだね。ゲヘナ学園とも何回か取引はさせてもらったね。ずいぶん昔の話だけど」
「昔？　結構最近、取引したと聞いているのだけど」
「そうだったっけ？　もう、忘れちゃったよ」
　ハレは肩をすくめ、どうでもよさそうに首をかしげた。
「ね、ねえハレ？　どうしたの？　なんか様子がおかしいわよ？」
「そう？　自分ではいつもどおりだと思ってるんだけどな」
「もしかして……操られてるんじゃ？」
「操られてる？　面白いことを言うね、一体誰が私を操るの？」
「それは……ピボットくんじゃないの？」
　ユウカが恐る恐る、想像を口にする。すると、ハレは今度は楽しそうに笑った。
「ピボットくんはそんなことはしないよ。ヒマリ部長と先生はよく分かってるんじゃない？」
「私達といた頃の彼ならそうですが、彼があなたを攫ったときの様子がおかしかったと先生から伺っていますから」
「ああ、そういえば先生とピボットくんは会ってるんだっけ。でも、違うよ。私は操られてなんかいない。むしろ、操ってるのは私のほうじゃないかな？」
「どういう意味ですか？」
「そのままの意味だよ」
「……よくわかりませんが、つまり、ここにいるのはあなたの意思だと？」
　ヒマリの目が細められる。
「うん。そもそも、人がAIに操られるなんて私の信条にも反するし」
「……では、私たちを襲ったことも、あなたの意思なのですか？」
「そうだけど。それがどうかした？」
　ハレは変わらない調子のまま、淡白に言った。
それを聞いて、銃を構えたのはヒナだ。
「だ、ダメ！」
　攻撃耐性に入ったヒナの前に、ユウカが身を晒す。射線を遮られたヒナは、眉をひそめて銃口を下げた。
「は、ハレ？　どうして、そんなことを言うの？　なにか、嫌なことでもあったの？　それなら、話して！　悩みなら、いつでも聞いてあげるから……」
　ユウカが今にも泣きそうな調子で、すがるように言った。
「ありがとう、気持ちだけ受け取っておくよ」
「そんな……」
　ユウカが目を見開いて、気圧されたように一歩後ろへと下がる。ちょうどそこにいたユズが、遠慮がちにその背中を受け止めた。
「……ハレ。単刀直入に聞くわ。あなたは敵？」
　再び、銃を構えたヒナがハレに剣呑な声で問いかける。ヒナに銃口を向けられても、ハレは動じることなく、ポケットに手を入れた。
「不審な動きをしないで。撃つわよ」
　ヒナは鋭い声で警告すると、引き金に手をかけた。それでも、ハレは余裕な表情を崩さない。
「それはやめておいたほうが良いんじゃないかな。それに、その銃を撃ったところでは私には届かない」
「……この距離で、私が外すとでも？」
「撃ってみれば？」
　そう言われてすぐ、ヒナが弾を撃った。一触即発の空気を発砲音が切り裂く。
「ヒナ！？」
　ユウカの絶叫が静かな廊下に響いた。それから悲痛な面持ちでハレを見るが、彼女は傷一つ負っていない。その理由を、ユズが教えてくれる。
「く、空中で弾が弾けた？」
「……いえ、おそらく透明な防弾ガラスでしょう」
　驚いたユズの言葉を、ヒマリが即座に否定する。よく見ると、空中に焦げ目がついている。そこに壁があるのがわかった。
「正解。これで実力行使はやめたほうがいいってわかってくれたかな？」
　仕方なくヒナは銃をおろした。ほうっと安心したような吐息が聞こえる。見れば、ユウカが胸を撫でおろしていた。
「先に実力行使に出たのはそちらでしょう。よく言いますね」
　ヒマリが挑発するようにいった。しかし、この状況で絶対的に有利なのはハレだ。
「……まあ、相手が先生達だって分かってたなら、傷つけるつもりはなかったよ。ごめんね」
「入り口に監視カメラなどを設置しておくのは基本だと思いますが？」
「だね。でも、この施設なら、そんなことしなくても侵入者が来た時点で、特殊なセンサーでわかるようになってるから。……でも、分からなかった。その酸素ボンベと何か関連性があるのかな？」
　ハレが指さしたのは、それぞれが背に負う酸素ボンベだ。明らかに不格好なそれは、事情を知っていなければふざけてると思ってもおかしくないだろう。
「……これはアンチプロトコルの対策のために装備しているのです」
「ふーん。よくわからないけど、流石ヒマリ部長だね。アンチプロトコルの対策を見つけたんだ」
「……別に簡単なことです。アンチプロトコルは絶縁体により無力化できることを知っていれば、私でなくとも思いついたでしょう」
「でも、それを実行できるのが凄いことなんだよ。さすが、天才だね」
　この状況では、皮肉にしか聞こえない。いや、実際に皮肉で言っているんだろう。ヒマリが眉間にシワを寄せ、不快感をあらわにする。
「やはり、あなたはハレではありませんね」
「まだ言ってるの？　本人が私だって言ってるのに」
「私の知ってるハレは、天才という言葉を軽々しく使うことはありませんでしたから」
「……まぁ、お互いの主張を通しあってもジリ貧だし。本題に入るとしようか」
　ポケットからスマホを取り出す。目にも止まらぬ速度で操作した。
　すると、突然廊下の至る所のハッチが開き、大量のオートマタが顔を出す。大型なタイプも混じっている。入り口で襲われたとき以上の数が、明確な敵意を向けていた。
「……ハレ、これは一体どういう真似です？」
　ヒマリもまた同じだ。ハレに明確な敵意を込めた睨みを効かせる。
「映画とかでよくあるでしょ。お前は知りすぎたっていうやつ」
「は、ハレ！　本気なの！？」
「……本気だよ。本当は入り口の迎撃システムで帰ってくれればよかったんだけど……破られちゃったからね。まさか、ゲヘナの風紀委員長が直接乗り込んでくるとは思わなかったよ」
「ハレ……みんなを傷つけようなんて、悪い冗談だ。……本気で怒るよ」
　先生のそれは敵意ではない。間違った道を進もうとしている生徒を正そうとする教師としての責務だ。
「怖いね、先生。でも、ごめんね。私にもどうしても譲れないことがあるから、今はあまり、邪魔されたくないんだ」
　スマホの画面の上にセットされた親指。あと少し画面に近づければ、オートマタによる一斉射撃が始まるのかもしれない。
　本当にハレがそんなことをするのか、信じたくはないけれど。彼女の目は本気だった。
「……じゃあ、さようなら」
ハレが冷たい笑顔を浮かべて別れの言葉を口にしたその瞬間、先生は懐に手を入れていた。
『先生！　私とプラナちゃんで、オートマタをハッキングします！』
『同調。ハッキング準備、完了』
　大人のカードを取り出す。それに同調して、アロナやプラナも一気に臨戦体制に入る。
…………
……
…
　気づけば目の前に広がっていたのは壊れた教室。先生は見覚えのある景色に目を擦った。
「ここは……」
　アロナの教室だ。なぜ、ここに？　意識だけで中には入ることは可能だ。だが、入るつもりなんてまるでなかったのに。
「そっか。シッテムの箱の中は、こんなふうになってるんだね」
　ふと、耳に入る聞き慣れた、だけど聞こえてはいけないはずの声。
　振り返ると、そこにはハレがいた。
「そ、そんな……ど、どうしてここにハレさんが！？」
　アロナが蒼白な顔で絶望を口にする。
「あなたは……シッテムの箱の管理人かな？　驚いたな。ずいぶんちっちゃい子だね。小学生？」
「な、な！　だれが小学生ですか！　ここから出てってください！」
　アロナがプンスカと怒りながら、ハレに向けて両手をかざす。すると、ハレが顔をしかめた。
「うーん……君がシッテムの箱の管理人なのは本当みたいだね。とんでもない力で追い出されようとしてる。コレじゃ、抗えないや」
そう言いながら、ハレはやれやれとスマホを持つ手を揺らした。
「……そのスマホでシッテムの箱をハッキングしたの？」
「まあね」
「……どうやって？　シッテムの箱はそう簡単にハッキングできないと思うけど」
　尋ねるが、大体予想はついていた。
「それは企業秘密……と言いたいところだけど、どうせヒマリ部長にはバレてると思うし、いっか。アンチプロトコルだよ。シッテムの箱が起動した瞬間を狙って、アンチプロトコルでセキュリティを無効化。そのまま、自分の意識を送り込んで侵入したんだ」
「アンチプロトコル……」
案の定、想像通りの答えが帰ってきて、先生は目を細めた。苦い記憶が思い出される。これで、シッテムの箱が破られたのは２度目だ。
「ハレ、アンチプロトコルを使えるの？」
「使えるよ。といっても、ピボットくんの制御権を貸してもらってるだけだけどね。仮想的なインタフェース、例えばこのスマホとかでアクセスして、入力したプログラムで操作してる」
「なんだか、難しい話だね……」
「そうだね。アンチプロトコルを扱うのは簡単じゃない。でも、使えるようになったら便利だよ……どんなサーバーやデータベースも簡単に侵入できるからね。……まあ、中には例外もあるけど」
　確かに便利かもしれない。だが、仮に使い方を聞いても理解できないだろう。
「それにしても、よくシッテムの箱をハッキングできたね。アンチプロトコルに対する対策は、しっかりしたはずなんだけど」
　端末には絶縁体シートによる完全密閉を施した。あれでアンチプロトコルは届かなくなったはずだが。
「……そうだね。端末だけじゃない。ヒマリ部長の車椅子とかにも、なぜかアンチプロトコルが届かなくてびっくりしたよ。でも、逆にシッテムの箱だからこそ、ハッキングできたとも言えるよ」
「どういうこと？」
「それは、この世界の法則に従属していない。たとえ電波の届かない僻地でも、世界の外を経由して、ネットワークに繋げることができる。私が狙ったのは、その通信経路だよ」
「……ごめん、ちょっとよくわからない」
「だろうね。多分、私以外に理解できる人なんていないんじゃないかな」
　ハレは当然のように言う。冗談を口にしている雰囲気ではなかった。
「……アロナ。もう大丈夫、ハレを追い出そうとしなくていいよ」
　いまだ、ハレに向けて念力のごとく手を突き出しているアロナを制する先生。
「な、なんでですか！？」
　アロナが信じられないと言った顔で目を見開く。
　先生は「いいからいいから」とアロナを宥めると、ハレにいつか聞いたような言葉を投げかけた。
「ハレ、よかったら少し、話をしない？」
「私はいいけど。でも、いいの？　私をここにいさせたままで」
「いいんじゃない？　もう入られちゃってるし」
「……侵入した私がいうのもなんだけど、そんなにガバガバでいいの？　管理人さん、凄い目つきで睨んでるけど」
「むむむむむむむむー！」
「先輩、落ち着くことを推奨します」
　アロナが精一杯の睨みを効かせている。それをプラナが宥めていた。ハレは微塵も動じている様子がない。精神年齢の差が如実に現れているようだった。
「まあまあ、とりあえず座ろうよ。ほら、ハレもアロナ達も」
「じゃあ、ありがたく座らせてもらうね」
「うー！　アロナちゃんはいいです。空でも見てます！」
「先輩、外は雨ですよ」
　空は暗く、教室を出れば雨風にさらされる。
「……ここも、雨なんだね」
　ハレが哀愁の籠もった言葉を漏らした。
「ここも？」
「私が地下に籠る前も雨が続いてたから。しばらく、晴れた空が見れてないなって思って……」
「じゃあ、外に出たらいいんじゃない？」
「そうしたいけど、私はここを離れられないから」
　ハレは諦めたような調子で言った。だけど、そこに悲観の色は見られない。表情や声だけでは、彼女の内心を測ることはできなかった。
「どうして、離れられないの？」
「それは……ピボットくんがコンソールルームで眠ってるからだよ。彼を置いて離れることはできない」
「眠ってる？　ピボットくんもアンチプロトコルの影響を受けたっていうこと？」
「ううん、違う。アンチプロトコルが暴走する可能性があるから、一時的に仮眠してもらってるだけ。まあ、でもみんなが置かれてる状況と、あんまり変わらないかな」
「そうなんだ……でも、そういうことならアンチプロトコルの影響は、もう心配しなくてもいいってこと？」
「今のところはね」
　アンチプロトコルの心配はないというハレの言葉に、ひとまず先生は胸を撫で下ろす。
「でもさ、アンチプロトコルをなんとかするのが目的なら、私たちと協力してもいいんじゃない？」
「それは無理だよ」
「どうして？」
「だって、ヒマリ部長、ピボットくんを破壊する気満々だよ。私はピボットくんを破壊する気なんて、さらさらないから」
　ハレはふふっと薄ら笑いを浮かべた。
「……どうしてそう思ったの？」
「ピボットくんの記憶を覗いたからだよ。ピボットくんとヒマリ部長が、そういう話をしてるって知ってたんだ」
「……そっか」
「その顔と反応、もしかして先生も心当たりがあったの？」
「…………まあね」
　ヒマリが固い決意を込めていたのを知っている。
「でも、私は違うよ。それに、マキやコタマ達だって同じように考える。……ヒマリだって、話せばきっと分かってくれるよ」
「…………うん、先生やみんなの気持ちはわかるよ。ヒマリ部長も優しいから、もしかしたらわかってくれるかもしれないね」
「だったら──」
「でも、それはできない」
「なんで？」
「……これは私が一人でやらなきゃいけないことだからだよ」
「どうして一人じゃなきゃだめなの？」
「ピボットくんに感情を与えたのが私。ピボットくんを……ピボを作ったのが私だからだよ」
「え？　それって、どういう……」
「悪いけど、今はそれ以上は言えない。……話はこれで終わりでいいかな？　そろそろ、行かなきゃ」
「もう行っちゃうの？」
「ごめんね。私ももうちょっと先生と話したいけれど……さっきから、この場所から追い出そうと攻撃され続けてる。もう、耐えられなさそうなんだ」
　言葉の割に淡々とした口調で言うと、ハレは黒コートの袖をまくり、腕をさらした。　よく見ると、薄く透けているのがわかった。
　先生はハッとしてアロナに目を向けた。
　アロナはブンブンと首を振った。続いてプラナに目を向けるが、彼女もゆっくりと首を振った。
「多分、その二人は関係ないよ。これはシッテムの箱というOSそのものが持つ防衛機能なんだと思う」
「そんな……まだ聞きたいことがたくさんあるのに」
「そういうわけだから……じゃあね」
　ハレはスマホをポケットに仕舞うと、ひらひらと手を振って、教室を出ていく。雨にさらされた瞬間、彼女の身体が溶けるように消える。
「先生……とんでもないことが起きてしまいましたね」
　悔しさ半分、驚き半分の面持ちで、アロナは言った。
「そう、だね」
「先生……気をつけてください。なんだかすごく、嫌な予感がします」
「うん。アロナも、いざとなったら頼むよ。頼りにしてるから」
「…………はい」
　最後の返事は、アロナにしては元気のないものだった。ハッキングされ、侵入されたという事実が、自尊心を傷つけてしまったのだろうか。
　気にしなくていいよ。そういうこともある。慰めの言葉はいくつか思いつくし、相手がアンチプロトコルを操れる以上、部が悪い。だが、そんな言葉をかけても無駄だろう。傷ついた自尊心を回復するなら、自分自身で折り合いをつけてもらうか、同じ屈辱を味わった者に発破をかけてもらうしかない。
先生はプラナに目配せすると、目を閉じ、現実へと戻った。
　再び目を開ければ、大量のオートマタに囲まれている状況に舞い戻る。一見状況は変わっていないが、よく見るとオートマタが銃口を下げていた。
「……撃たないのですか、ハレ？」
　ヒマリが冷静に問いかけた。
「うん。撃たない。たった今、目的は果たせたし。無意味にヒマリ部長達を傷つける必要もないからね」
「目的？　今の一瞬で何が出来たというのです？」
　シッテムの箱の中は、現実とは時間の流れが異なる。先生とハレにとって話すに足るだけの時間も、みんなにとっては一瞬に過ぎない。
「それは先生に聞いたほうがいいんじゃない？」
　先生に説明を委ねる。みんなの視線が、先生に集まった。
「……シッテムの箱がハッキングされた」
「なっ！？」
　シッテムの箱が侵された。その事実に、ヒマリを初めユウカやヒナも驚きの声を上げる。ユズとエイミはよくわかっていないようだが、なにかとんでもないことが起こっただけは察しているようで、静かに成り行きを見守っていた。
「シッテムの箱をハッキング？　いったい、どうやって？」
「アンチプロトコルを使ってやったらしい」
「……そうですか。先程の会話から薄々そうじゃないかとは思っていましたが……ハレ。あなたはアンチプロトコルを操っているのですね」
「うん。そうだよ」
ハレは頷く。
ヒマリは予想していた。できれば当たっていてほしくない予想ではあったが。
「しかし、それでもシッテムの箱をハッキングできるとは考え難い。私の認識が間違っていなければ、アンチプロトコルそのものにハッキング能力はないはずですが」
「そのとおりだよ。アンチプロトコルはあくまでハッキングの糸口を作り出すだけ。そこから先の操作は自分でやらなきゃいけない」
「だとしたら、シッテムの箱は人間に攻略できる代物ではありません」
「そうだね。実際、昔の私だったら出来なかったと思うよ」
「……なるほど。そういうことですか」
　ヒマリは理解したらしい。口をつぐむと、難しい顔で目尻を釣り上げた。
「ヒマリ、どういうこと？」
　ヒマリはゆっくりと腕を上げると、ハレの頭上に浮かぶヘイローを指さした。
「その目に変色したヘイロー。まさかとは思ってましたが……ハレ。あなたのヘイローは覚醒してますね？」
　ヘイローの覚醒。聞き慣れない単語に、全員が疑問符を浮かべる。ハレだけが理解しているようで、「へえ」と感心したような吐息を溢す。
「……覚醒なんて、よく知ってるね。ヒマリ部長」
「昔、それについて研究していた碌でもない知り合いがいますから」
　ヒマリは遠い目をして言った。その瞳の先に誰を思い浮かべているのか。
「ハレ、覚醒って何？」
「それはヒマリ部長に聞きなよ。私はもう、これ以上おしゃべりに付き合うつもりはないよ。みんな、悪いけど、ここは大人しく帰ってくれないかな？」
ハレは両手をポケットに突っ込み、顎をしゃくる。すると、オートマタが一斉に壁際に成立し、道を空けた。
「……分かりました。ですが、本当に我々を生かして帰していいのですか？　……どんな手を使ってでも、あなたにお灸を据えに来ますよ」
　ヒマリが鋭い眼光をハレに浴びせる。
「大丈夫だよ。今の私なら、誰が相手でも負けることはないから」
　ハレが不敵に微笑んだ。ミレニアム最高峰の天才を敵に回すことも、まるで意に介さないように。
「……そうですか。では皆さん。いきましょうか」
　ヒマリは車椅子を操作して、踵を返した。
「待って、ヒマリ部長！　せっかくハレと会えたのにこのまま帰っていいの？」
「当然、いいわけがありません。ですが、悔しいですが今ここで戦っても、勝ち目はありません。ここは大人しく出直すのが最善です」
　ヒマリはきっぱりと言った。ユウカが歯噛みする。
　最後に、先生は背後を振り返った。奥に消えていく、ハレの後ろ姿だった。

オートマタの並ぶ道を辿っていくだけで、出口に着くことが出来た。天文台のロビーに集まり、ヒマリを中心に囲む。
「ヒマリ、覚醒って何？」
　代表して、先生が質問をした。
「……私はリオが研究していた資料を見せてもらっただけなので、詳しいわけではありませんが、簡単にいうと進化です。何らかのきっかけでヘイローが廻転し、神秘がより強靭なものへと生まれ変わる現象のことを指すようですよ」
「何らかのきっかけって例えば何？」
「……それはわかっていません。はるか昔に覚醒したヘイローの持ち主が現れたそうですが、当時の研究者がこぞって研究に勤しんでも、なぜそうなったのかはついぞ判明しなかったと言われています。あるいは判明していたとしても、詳しい資料は何一つ残っていない。ただ、ひとつ言われているのはヘイローが破壊される苦しみを上回るほどの苦しみを体験し、乗り越えること。そのうえで天賦の才に近い神秘を持つ者にのみ、覚醒の機会は訪れるということです」
「ヘイローが破壊される苦しみを上回るほどの苦しみ！？　じゃあ、ハレは苦しんでいるっていうこと！？」
　ユウカがヒマリに詰め寄る。ヒマリは興奮するユウカに腕を伸ばし、落ち着くよう促した。
「いえ。ハレはすでに覚醒しています。ならば、言い伝えが正しいのなら、それを乗り越えたということです。今も苦しみ続けているということは、ないかと」
「そ、そうなんだ……」
　ユウカがほっと安堵の息を吐く。彼女の肩を、先生はぽんぽんと叩く。
「……覚醒すると、どうなるの？」
「それは……一説によると、身体能力、集中力などあらゆる力の大幅な向上し、人間の限界を超えると言われています。当然、知能も飛躍的に上がっているはず。ハレがアンチプロトコルを操り、シッテムの箱をハッキングできたのは、それが理由でしょう」　
「なるほど」
　合点がいった。シッテムの箱は人知を超えた異物だ。同じく人知を超えたアンチプロトコルに超人的なハッキング技術。そのような理由でもなければ、ハッキングなど不可能だろう。
「それと、気になってたんだけど、アンチプロトコルでハッキングって出来ないの？」
「ええ。厳密に言うと、アンチプロトコルだけでは不可能です。アンチプロトコルは一切のセキュリティを無効化しますが、侵入した後の命令はハッカーがしなければなりません。プログラミングと同じです」
「そうなんだ……でも、ピボットくんはそんなことしてなかった気がするんだけど」
　生徒会室で対峙した時、ピボットくんは手をかざすだけでハッキングを成功させていた。あれはどういうことなのか。その答えをヒマリが教えてくれる。
「それは恐らく、ピボットくんの存在そのものが超高性能なスーパーコンピュータのようなものだからです。いくら覚醒したとはいえ、ハレも人間ですから。そして、付け入る隙もそこにあります。ミスをしない、完璧な人間など、この世には存在しません。天才美少女である私でさえ、手玉に取られることもある。その逆もしかり。必ず、ハレの目を覚まさせてやりましょう」
　拳を握ると、同意を求めるように全員の顔を見回した。だが、頷いたのはヒナとエイミだけ。ユウカとユズはうつむき、沈黙を保ったままだった。
「ふたりとも、どうしたのです？」
「……ごめん、ヒマリ部長。悪いけど、私はまだ、考えが整理できてないの。少し、時間をもらってもいい？」
「わ、私も何がなんだか……ちょっとよくわかってなくて」
ユウカとユズは、互いに別の理由で戸惑っているようだった。
「……分かりました。では、これ以上は一度帰ってから、あるいは日を改めて話すとしましょうか」
　それから、山を下り電車に乗ってミレニアムへの岐路をたどる。道中、会話はなく終始重い空気だった。これは実質敗走であり、捉え方を変えればハレに裏切られた形になるのだから。
　やがて、ミレニアムの最寄り駅に到着する。
「それじゃあ、私は一旦ゲヘナに帰る。今回のことを報告しなきゃいけない相手がいるから。また連絡してちょうだい」
「分かりました。ああ、それとこちらをお返ししておきます。長い間借りてしまって、すいません」
　ヒナにスマホを手渡す。以前、借り受けていたヒナのプライベートスマホだ。
「私のスマホ……まだ持っててもらって構わないのだけど」
「いえ。ここに帰ってくる途中で中古のスマホを買っておきましたので。モモトークぐらいなら、これさえあれば十分ですから」
「わかった。そういうことなら、受け取っておく」
「ええ。それと、勝手ではありますがモモトークに私の連絡先を追加させていただきました」
「大丈夫。むしろ、手間が省けてありがたい。……それじゃあ、また後で」
　ヒナは別の改札へと向かう。このまま、ゲヘナ学園に直通する電車に乗り換えるのだろう。
「じゃあ、私もここで」
「わ、私も失礼します」
　しばらく歩いてミレニアムに到着すると、ユウカとユズは逃げるようにどこかへ行ってしまった。瞬く間に、パーティメンバーが三人だけになってしまう。
「エイミ。ちょっと体育館の方に行って、眠っている人の数を確認してきてくれますか？　　それと、マキ達の様子も確認してきてください」
「おっけー」
　さらに、ヒマリがエイミに頼み事をしたことで、二人きりになってしまう。
「…………さて。これでようやく二人きりになれましたね、先生」
　まるでこうなることを狙っていたかのように、ヒマリは切れ長の目で先生に目配せをする。
「私が
「ええ。それはもう、熱烈な視線を感じていましたので」
「ね、熱烈っていうほど見てないと思うけど……」
先生は襟を正し、真剣な表情でヒマリを見下ろした。
「ヒマリ。やっぱりヒマリは、まだピボットくんを破壊するつもりなの？」
「ええ。そのつもりです」
　


「先生。覚醒のきっかけは、ヘイローが破壊される以上の苦しみを乗り越えることだと言いましたね」
「そうだね。それがどうかしたの？」
「彼女はピボットくんに連れ去られてからの一週間とちょっとの間に覚醒している。それはつまり、その間に想像を絶するほどの苦しみを味わったということ。先生はその一連の流れに、ピボットくんが関わっていないと思いますか？」
「それはわからない。もしかしたら、他の原因がある可能性もあるよ」
「……だとしても、彼の持つアンチプロトコルがハレの苦しみに関わっているのは事実。それは到底許せることではありません」
「でも、それは悪いのはアンチプロトコルであって、ピボットくんではないんじゃないかな」
「先生。申し訳ありませんが、それは屁理屈というものです」
「……そうだね。ちょっと無理やりだったね」
　ヒマリに諭され、反省する。確かに子供みたいな言い方だった。今の先生の論は、包丁で人を傷つけても、悪いのは包丁だと主張しているようなものだ。まるで、出来の悪い弁護士ごっこである。
「でも、せめて破壊する前に協力することも出来ないのかな？　ハレもアンチプロトコルをなんとかするつもりらしいから」
「それはハレが言っていたのですか？」
「うん。シッテムの箱の中で話していたときにね」
「……だとしたら、なぜ私達に協力を求めなかったのでしょう」
「それはわからない。でも、これは一人でやらなきゃいけないことだって言ってた」
「……そうですか。では、交渉の余地はありませんね。まあ、仮に誘われていたとしても、考えを曲げるつもりはありませんでしたが」
「どうして？　覚醒したことでハレのハッカーとしての腕は上がっているんでしょ？　だったら、ヒマリとハレが協力すれば、なにか解決の糸口が掴めるんじゃないの？」
ミレニアムが誇る二人の天才。ハレとヒマリが組めば、敵なしなんじゃないだろうか。だが、ヒマリは目を閉じると、大きくかぶりを振った。
「…………それがもう、私にはわからないんです。ピボットくんについて研究している時、私は彼の感情とアンチプロトコルの暴走がリンクしていることに気づきました。ですが、解除する方法は見つけられなかった。そもそも、どのようなプログラムで動いているのかさえ理解できなかった。この私がです」
　いつも自身に満ち溢れているヒマリにしては珍しく、それを喪ったような顔つきだ。
「……そもそも、元はといえばこれは彼が言ったことなのです」
「え？」
「もし、自分がこの力でハレさんや皆さんを傷つけることがあれば、いかなる理由があっても、私を破壊してください。と、彼は言いました」
　ヒマリの表情は真剣で、強く開いた双眸がまっすぐに先生の顔を捉えている。嘘をついているわけではないのはひと目でわかった。
「私はあの時聞いた言葉を信じます。正気で誠実で、自身の力に怯えていた頃の彼を信じます。先生、私は間違っているのでしょうか？」
「それは……」
　何も言うことが出来なかった。
「……とにかく、ここまで事態が深刻になった以上、私は今更自分の考えを曲げるつもりはありません。先生はそのことを皆さんに伝えるつもりですか？」
「……言わないよ。それをいっても、不安にさせるだけだ」
「では、力付くでも私を止めてみますか？」
「そんなことはしないよ」
「懸命な判断です」
　ヒマリはそういって鼻息を溢すと、話は終わりだと言わんばかりに車椅子を前進させて、行ってしまった。
「ヒマリ……」
残された先生は遠ざかっていく車椅子の背を見つめたまま、静かに呟いた。
　ヒマリは決して間違ってはいない。正気だった頃のピボットくんの遺言を信じて、自分が信じた道を進もうとしている。そして、彼女はもう覚悟を決めていた。だったら、止めることなんて出来ない。と、思う。
「……だったら、私がするべきことはひとつかな」
　まだ、ちゃんと話を聞くべき生徒がいる。
　先生は額にかかった髪をかきあげて、天に問いかけた。広大な空は、薄暗い雲に覆われている。ふと、不穏な風が頬を撫でた。すごく嫌な風だと思った。
二週間後、講堂。
「さて、皆さん。決戦の時が近づいてまいりました。準備はよろしいですか？」
　壇上で、ヒマリは拡声器を手に、声を張り上げた。
　先生にピボットくんを破壊すると宣言した翌日、ヒマリは講堂に全生徒を集め、ピボットくんの存在とハレの異変について明かした。その後彼女は、ミレニアムに平穏をもたらし、仲間であるハレを救うため、協力者を募った。
　協力者は当然全員とはいかなかったが、応じた生徒はヒマリの予想を良い意味で裏切り、過半数を超えた。また、度々協力してくれたゲヘナの助力も取り付け、本格的にハレにお灸を据えるための計画を練り始めたのだ。
　ヒマリはその計画を「アスハレ作戦」と名付け、半月に渡って準備を進めてきた。それがようやく、決行目前となったのだ。今、行なっているのは最後のミーティングである。
「では、最後に作戦のおさらいをします。目的は至ってシンプルに、目的はピボットくんとハレの拘束です」
　先日とは違って、最後まで行くという意思を示す。ただし、それを分かっているのは先日のハレ奪還作戦に参加したわずかな顔ぶれだけ。
　壇上のヒナとユウカが頷く。観客席に座るユズは、人の多さに震えていた。
　ユウカもユズは、この作戦に参加するべきか、最後まで葛藤していた。だが、悩んだ末にユウカはハレとちゃんと話がしたいと。ユズは、ハレさんとはゲームをした仲ですから。と、それぞれの目的で協力の意思を示したのだ。
「また、総合指揮はこの私、明星ヒマリが行います。救護班の指揮はチナツさんに、補給班の指揮はユウカが取ります。最後に戦闘部隊は細かく分かれていますので、全体の統括は百戦錬磨のゲヘナ風気委員長であるヒナさんに行なってもらいますが、細かい指揮は、それぞれに所属する隊長に従ってください。よろしいですね？」
　はい、とそろった返事が聞こえる。
　ヒマリはアスハレ作戦を計画するにあたって、班ごとに分けた。弾などの物資を補給するための班だ。前回、弾不足に苦しめられたことを、ヒマリは忘れていない。今回は移動兼運搬用のトラックも用意した。銃弾だけでなく、捕縛用グレネードランチャーの弾も可能な限り用意した。仮に二十四時間ぶっ続けで戦うような事態になったとしても、尽きない量の物資がある。
「──おさらいは以上となります。各チームごとの詳しい動きは、それぞれに配った計画書を読み込んでください。では、各自明日に備え、今日はゆっくり休んでください。解散」
予想される懸念やその他の備考も説明し終えると、ヒマリはそういって、壇上を降りる。
「ところでエイミ。まだ先生とは連絡が取れませんか？」
「え、まだ連絡つかないの？　どうしたのかしら……まさか、ハレに連れ去られたなんてことはないわよね？」
「その可能性は限りなく低いと思いますが……連絡が取れないのは心配ですね」
やはり、先日は少し勢い任せに啖呵を切りすぎたのでしょうか。
　ヒマリはしゅんとなった。
先生がいないというのは戦力的に大幅なダウンである。あの場は嘘をついてでも、先生を味方に引き入れるべきだったのだろうか。いや、でもそんなことをしても後々考えの相違が発覚した場合、最悪なタイミングで助力を打ち切られるなんてことも考えられるわけで。
「まぁ、先生のことは考えても仕方ありません。私達には私達のやれることをしましょう。……もしハレのところに行っているなら、どうせ明日わかります」
「…………そうね」
ユウカはいまいち釈然としない様子で頷いた。
　

そして翌日。アスハレ作戦決行日。参加者一行はヒマリが手配したバスに乗り込むと、キヴォトス第三天文台へ集結した。
「では初陣、突入します。準備はよろしいですか？」
　ヒマリがそういうと、はいっ！！　と威勢よく揃った返事が空気を震わせる。第一陣であるA隊は、ゲヘナの風気委員の鎮圧部隊を中心に、ヒナを含めた実力派の生徒のみで構成している。彼女達が切り拓いた道を後続が続くという流れだ。
「じゃあ、行ってくる」
　ヒナが先陣を切って、地下室へと突入していこうとする。まさにその瞬間だった。
　地下室の入り口から大量のオートマタが湧き出てくる。
「…………なるほど。準備は万端ということですか」
以前はなかった入り口からの迎撃。
ヒマリはそれを、ハレからの歓迎の挨拶だと認識した。なぜなら、一つしか入口がないのなら出てくるそばから撃っていけばいいだけの話。事実、ヒナをはじめA隊の集中砲火で、湧き出たオートマタのほとんどを破壊することができた。だが。
「……なるほど。そんなに甘いわけがありませんか」
　ヒマリはニヤリと笑みを浮かべた。入り口のオートマタが破壊されたタイミングで、右と左の窓ガラスを突き破り、大量のオートマタが天文台内へと侵入してきた。
「みなさん、予定が少々狂いましたが、問題ありません。この状況はケースDに酷似しています。A隊は正面、B隊は東方向、C隊は西方向の迎撃！　その他各隊後方に退避してください！」
　戦力の集中した三隊を迎撃にあたらせ、残りは下がる。
　ヒマリは向こうから攻撃に来る状況も想定していた。このような状況はケースDとして、作戦マニュアルにも書いていたことである。
　それにしても、外からオートマタが現れたということは、地下室の入り口はやはり複数あるのだろうか。それともヒマリ達の襲撃に備え、あらかじめ配置していたのか。なんにせよ、ハレもハレで何らかの策を練っていることがこれで分かった。
　今回も敵の湧く数は多いが、数が多いのはこちらとて同じ。また、リソースも十分以上に確保している。やがて、相手が根負けしたのか、それとも単にリソースが尽きたのか、オートマタの発生も止まり、無事に制圧完了する。
「ふふ。今回は私達の勝ちですね」
　大量のオートマタの残骸を前に、ヒマリは勝ち残った笑みを浮かべた。
「では、今度こそ中に──あら？」
　ヒマリは突撃命令を途中で切り、周囲の様子を窺った。足元に、彼女の場合は腰掛ける車椅子越しに強い違和感を覚えたからだ。
「なんか、揺れてない？」
　その違和感を誰かが言葉にした。まるでそれがスイッチだったかのように、地面の揺れは強くなり、バランスを崩す生徒が次第に増える。
　揺れる視界の奥で、ヒマリはとらえた。空っぽの台座が無くなり、空いていたはずの入り口がいつの間にか閉じられているのを。なにか嫌な予感がした。
「みなさん！　退避！」
　ヒマリは即座に号令をかける。しかし、間に合わない。ほぼ同時のタイミングで、地面に亀裂が入る。
「きゃああ！？」
　地面が一気に盛り上がり、爆心地の近くにいた生徒が被害を受ける。
　そして空を見上げれば。
「あれは？」
　巨大な方舟のような機体が聳え立っていた。　甲板にエナジードリンクの缶を握った一人の少女の姿が浮かび上がる。
「…………これはまた、お早いお出ましですね、ハレ」
　ヒマリは冷や汗を浮かべていた。巨大戦艦とでもいうべき様相を呈した物体、それはかつてヒマリ達も乗ったアトラハシースの方舟によく似ていた。
「やあ。久しぶり。やっぱり来たんだね、ヒマリ部長。それに、今度は仲間をたくさん引き連れて」
「ええ。前回、ある程度の情報は得られましたから。今度は本気で、あなたにお灸を据えに来ましたよ、ハレ」
「その大げさな酸素ボンベも人数分用意したんだ。大変だったんじゃない？」
「そうでもありません。この私にかかれば造作もないことです」
　お互いに牽制しあうような会話。



「……じゃあ余計なお世話かもしれないけど、新しい情報をあげるよ」
「何でしょう？」
「まず、今の私はアンチプロトコルを自由に扱えない状態だから、その酸素ボンベも、体に貼り付けてるものも必要ないよ」
「……その言葉が真実だとして、私がそれを易々と信じると思うのですか？」
「さあ？　信じるのも信じないのもヒマリ部長の自由だよ。でも、私はそんなもの、捨てちゃうのをオススメするよ。暑いでしょ？」
「検討しておきましょう」
　ヒマリはまるで信じていなかった。ヒマリは敵の援助をなんの裏付けも無しに信じたりしない。そのことはハレも理解している。
　ハレは手にしていたエナジードリンクを口に含むと、口元を拭った。一度隠され再び現れた唇は笑みを形作っている。
「そっか、じゃあもっと役に立つ情報をあげるよ。この方舟には空き部屋がたくさんあるけど、そのうちの三つにボスが配置されてる。それを倒すと、私のいる部屋のロックが空く仕組みになってるよ」
「……さっきから、どうしてわざわざ敵に塩を送る様な真似をするのです？　心理的な揺さぶりをかけているつもりですか？」
「ううん。単純にそうしないと、フェアじゃないからだよ。ゲームはお互いフェアじゃないと楽しくないからね」
「その余裕……後悔することになりますよ」
「できるものなら、させてみて欲しいけどね」
　最後にそう言うと、ハレは踵を返し、船の奥へと消えていった。
「あれがあのミレニアムの天才ハッカー集団、ヴェリタスのメンバー？　やっぱり噂通りやばい人の集まりだったんだ……」
「で、でもハレ先輩ってあんな性格じゃなかったような……？　確か、操られてる可能性があるんだっけ？」
　ハレが敵に回っているかもしれないことは事前に説明してある。その理由は、敵に洗脳されているということにしていた。そっちの方が、もし彼女が正気に戻った場合、みんなに受け入れられやすいと思ったからだ。この場合、敵というのはどうしてもピボットくんにするしかなかった。そのことに少なからず罪悪感を覚えたが、そこは割り切るしかなかった。
　しかし、いくら事前に聞いていたとはいえ、実際にその瞬間を目の当たりにしたことで、全体を通して動揺のようなものが見られた。特にミレニアムの生徒でハレの人柄を知る生徒の衝撃は大きいようだ。
「皆さん。予期せぬ事態ではありましたが、やるべきことは変わりません。私達の目的はピボットくんの拘束とハレの救出です。引き続き、協力の程をよろしくお願いします」
　あまり、士気を乱されるのは良くない。ヒマリは払拭するため、奮い立たせる。
「では、初陣！　突入をお願いします！」
　返ってくるのは完璧に揃った返事の声。初陣の部隊は、特に実戦経験と戦闘力のある生徒を集めているおかげか、多少のイレギュラーでは動揺は見られない。
　だが、ヒマリ達の目の前にご丁寧に搭乗用のハッチが開いている。これも、ハレの策略か何かだろう。どうも余裕綽々な態度が癪に障るが、どっちにしろ中に突入するのは変わらない。用意された入り口から初陣を突入される。続いて、第二陣が中へ突入する。
『総司令！　第一陣、分かれ道に到達しました！』
　ヒマリの膝下に置かれたタブレットに映る映像。そこには三方向の分かれ道の前で立ち止まるヒナたちの姿が映っている。
「了解です。では、そのまま真っ直ぐに進んでください。間もなく、戦闘になるはずなので用心してください」
　なぜ、電子機器を使えているのか。その答えは、ヒマリはハレがアンチプロトコルが使えないということを知っていたからである。正確には使えないかもしれないと思っていた。
ヒマリがその事実に初めて気付いたのは、アスハレ作戦決行三日前のことだった。
『ヒマリ、ちょっといいかしら』
　地下空間の一室、ヒマリの自室に突如訪れた一機のドローン。スピーカー部分から、最も忌避しており、最も強く印象に残っている声が聞こえる。
「これはまた、珍しい客人が来ましたね、リオ。ご用件は何ですか？　今は見ての通り忙しいのですが」
　ヒマリは作業の手を止めると、ややキツイ言い方でリオに問いかけた。相手がリオという事もあるが、どちらかというとアスハレ作戦に対する感情をぶつけた八つ当たりに等しい。アスハレ作戦は元々急ピッチで進めてきた計画だ。戦闘に慣れていない生徒の訓練や、大量購入した弾薬等の検品、他にも不十分なこと、やりきれていないことはたくさんある。時間の足りなさや思い通りに事が運ばないことへの焦燥、睡眠不足による苛立ちが募っていた。
　だが、リオにとってヒマリの邪険な物言いは日常茶飯事である。気にした風もなく、要件を口にする。
「まずはこれを見てちょうだい」
　そういって、リオのドローンは口元から丸まった薄い冊子を吐き出した。それがヒマリのデスクにストっと落ちる。
「これは？」
　ヒマリは資料を手に取ると、中身を見る前にリオに問いかけた。
「実はここしばらく、ピボットくんに関して研究を続けていたの。それは調査結果をまとめた資料よ」
「研究？　なんの研究をしていたのか知りませんが、リオは彼の行方を知っているのですか？」
「ええ。ピボットくんのコアがある座標を前に教えてくれたじゃない。ミレニアムが大規模なアンチプロトコルの影響を受けてから、真っ先に調べたわ。すると、アンチプロトコルでドローンがハッキングされたの。その後も隙を伺って何度か侵入を試みたけれど、何度もドローンを壊されたわ」
　リオの言葉を聞き流しながら、一ページ目を目にいれる。その内容は第三天文台の地下にいるであろうピボットくんに対し、ドローンで接触を試みた際の結果が書いてある。だが、そのほとんどがアンチプロトコルにより無力化されたという結果に終わったようだ。当然だ。アンチプロトコルを操る敵の隠れ家になんの対策もなしに電子機器で赴くなど、常人が水着で南極に挑むに等しい。リオはそれを毎日続けていたようだ。
　──なぜこの人はなんて無駄なことをしているんでしょうか。
　リオはいったいいくつものドローンを無駄にしているのだろうか。ミレニアムの外にいるらしい彼女は、暴走の影響を受けていないから資源が豊富なようで羨ましい限りだ。続きは見る価値なし。そう決めつけ、ヒマリは冊子を閉じた。
「待って。次のページを見てちょうだい。私が見せたいのはそこよ」
「……何が書いてあるんです？　行っておきますが、私はあなたと違って暇ではないのですが──っ！　これは……」
　これで大したことが書いてなかったらなんて言ってやろうか。そんなことを考えながら、ヒマリは二ページ目に目を通す。だが次の瞬間、あまりに衝撃的な内容を見て、ヒマリは目を見開いた。
「ある日を境にアンチプロトコルにより、ドローンが無効化されることがなくなった。まあ、それ以外のセキュリティに引っかかっているけど……。奇妙だと思わない？　それ以前は侵入なんてしようものなら一瞬で無効化されていたっていうのに、急にそんな状態になるなんて」
「……ええ。もしや、何らかの事情により、アンチプロトコルを扱えなくなっている？」
「確証を持っていうことは出来ないけど、それもひとつの可能性ね。まあ、力を貯めている可能性もあるけど……」
ちょうどこの日から二日前、アスハレ作戦決行日から数えると五日前を境に、急に文章量が増えている。どうやらアンチプロトコルによる無効化を、なぜか受けなくなったらしい。だが、真にヒマリの目が止まったのは添付された図だ。
「……しかし、それも気になりますが、リオ。この見取り図は？」
　ヒマリは血相を変えて、リオに尋ねた。リオが書いたらしい図、それはハレが拠点にしている第三天文台地下の見取り図だった。
「決まってるじゃない。ドローンを使って地道に調べたのよ。……まぁ、コンソールエリアとか、中心部の情報は取れてないけど、ある程度参考にはなるでしょう」
「ある程度どころか、大いに参考になります。リオ、一応確認しておきますが、この情報は確かなんですよね？」
「ええ。嘘の情報を渡す理由がないわ。ついでにもうひとつ言っておくけど、そこに陣取っているのはかつてのあなたと同じヴェリタスの部員、ハレよ」
「ああ、それなら知っています。この間直接乗り込んだ際に会っていますので」
「そう」
　リオは無感情な相槌を打った。ヒマリは冊子を机の上に置くと、
「それよりも、リオ。先程は話を疑ったことを謝罪しましょう。今回は助かりました。この情報があるのならば、作戦はより成功に近づくでしょう。感謝ついでに、あなたも私達の作戦に手を貸してくれるとありがたいのですが……」
「……別に構わないけど、私にできることなんてそうないと思うわよ」
「いえ、ありますよ。リオには用意してもらいたい物がいくつかあるのです」
　ヒマリはリオのドローンに向けて、意味深な笑みを浮かべて言った。

　──まさか、リオから聞いた情報が本当だとは思いませんでした。
　ヒマリは一向に無効化されないタブレットを見ながら、驚きに満ちた表情を見せる。このタブレットが、ヒマリがリオに言った用意してほしかった物の一つだ。他には装着者の健康状態を表示する腕時計や輸送用の車を追加してもらったり、役に立つアイテムをいくつも供給してもらった。
　そのおかげで、快適性や確実性は大幅に増した。とはいえ、アンチプロトコルが使えないという証拠はない。そのため、突然電子機器がハッキングを受け、通信が遮断されても問題ないよう用意はしてあった。特に重要な伝達手段は、あらかじめ指名されている生徒が通信機器の代わりを担う手はずになっている。なお、絶縁体シートと酸素ボンベを着用させているのも、同じ理由である。ただ、用心には用心を重ねる性格というだけ。そして、その情報を得ていることを、ハレに隠す目的も一応あった。

　だが、ハレはヒマリの嘘に気づいていた。
　同時刻、第二コンソールルーム。この戦艦内には至る所に小型の監視カメラが設置されている。ハレはモニター越しにヒマリ達の動向を観察していた。
「……ヒマリ部長、さっきはあんなこと言ってたくせに、私がアンチプロトコルを使えないこと、知ってたみたいだ」
　ハレは両足を椅子の上に乗せ、体育座りの格好で呟いた。
　じゃなきゃ、電子機器を用意したりなんてしない。
　しばらく前から毎日侵入してきた偵察型ドローンの操縦者、逆探知をしても操縦者がわからないように対策されていたが、あれの操縦者はヒマリだったのだろうか。
「まあ、正直どうでもいいんだけど……悪役のセリフ的には、面白くなってきたって感じなのかな」
　ハレはニヤリと笑った。
　

ココカラファイン


　ヒマリは総司令として、タブレットで皆の様子を伺いながら、依然指揮を取り続けていた。初陣からの伝令が入る。
『ヒマリ総司令！　初陣、巨大なオートマタを発見しました！』
「分かりました。そのまま戦闘に入り、その部屋に突入してください」
　何度かの迎撃システムとの戦闘を乗り越え、初陣部隊が最初の部屋に到着した。扉前で侵入者を阻む巨大なオートマタ。これがボスというやつだろう。
「補給班、初陣に物資の支援をお願いします」
　冷静に突撃支持を出すと、ヒマリは続けて物資の補給を命じる。
「また、救護が終わり戦線に復帰できる者は、護衛も兼ねて補給と共に部隊の元へ赴いてください」
　続いて、オートマタの攻撃により離脱していた者を護衛に抜擢する。すでに戦艦内の道は初陣部隊やその他戦闘部隊が切り拓いている。よっぽど危険はないはずだが、万が一の備えをヒマリは忘れない。
『第二陣、巨大なオートマタを発見！』
「ご苦労様です。そのまま戦闘に入り、部屋に突入してください」
『あいあいさー！』
続いて、ボス発見報告が上がるのはモモイたちの部隊だ。
　初陣部隊はすでに戦闘に入っている。ヒナが最前線に突っ込み、次々と現れるオートマタを破壊しては、時に攻撃を喰らいながらも、縦横無尽の大活躍で敵を屠り続けている。最終エリアらしく敵の数は多く、また巨大オートマタもより頑丈に作られているせいかやや時間がかかっているが、この分なら間もなく制圧完了するだろう。
「やったー！　ヒマリ部長、ボスを倒したよ！」
　だが、一番早くオートマタを倒したのは、ヒナを有する初陣ではなく、なんとモモイたちを有する第二陣であった。モモイの歓喜の報告が飛んでくる。
『ヒマリ部長！　アバンギャルド君、やっぱり最強だよー！』
　タブレットの画面の中、分割した映像の一つをタップし、拡大する。モモイやマキ達がアバンギャルドくんを囲んで、楽しそうにはしゃいでいる。
「ふふ、上手くいったようで何よりです。また、リオに感謝しなければなりませんね」
　ユズが操作するアバンギャルド君マークⅣ。それはリオが用意したロボットの最新バージョンである。人形の大きさではあるが、そのパワーは随一であり、機動力もあるため、それにユズの操作技術が加わったことで、尋常じゃない強さを発揮したのだ。その勢いはあのヒナよりも早く敵を倒すほどだった。
『う、うぅ……き、緊張しましたぁあ！』
　ユズの心の底から安心するため息が聞こえてくる。
『こちら第一部隊。巨大オートマタ制圧完了！』
　続いて、初陣部隊による制圧完了の報告も飛んでくる。モニターを切り替え、見ると、大量のオートマタの残骸の上で、ヒナが漢らしく仁王立ちしている。だが、その体中に傷を受けた弾痕や切り傷があり、ところどころ血が流れていた。
「ご苦労様です。第一部隊、ただ今救護班を向かわせますので、応急処置が終わり次第、そのまま部屋に突入してください」
『了解！』
　補給班を向かわせたように、医療班を向かわせる。
「ねえねえ、私達はー？」
「あなた達は少々お待ちを」
　見るからに元気の有り余っているモモイに命令を催促される。こちらは応急処置は必要なさそうだが、ヒマリはまだ命令を出さなかった。代わりに第三部隊へと通信をかける。
「第三陣は苦戦しているようですね……増援はいりますか？」
『すいません、少々手こずっていまして……」
「わかりました。では造園を向かわせますのでしばし耐えてください」
第二部隊へと通信を戻す。
「ではアリス、今から私の指示に従って、第三部隊の援護に行ってもらいます」
「了解です！　ヒーロー登場というやつですね！」
「ヒーローというよりヒロインですけどね。では、アリス以外の第二部隊のメンバーはそのまま部屋に突入してください」
「はーい！」
「中にはどのような脅威が潜んでいるかわかりません。くれぐれも、細心の注意を払ってください」
　ピクニックのようなテンションのモモイに釘を刺す。
「ではアリス、誘導します」
　第三部隊にはヒナやアバンギャルド君といった強力なエースがいないせいか、やや苦戦しているらしい。そこで、ヒマリは力の有り余っているアリスを援軍に送ることに決めた。光の剣を持ち、単純火力だけならヒナを上回る。彼女がいれば、巨大オートマタを倒すくらいはいけるだろう。
「ん？」
　即席で作ったマップに沿ってアリスを導きながら、他の部隊の様子を確認しようとしたら、縮小した第一部隊と第二部隊の画面がブラックアウトしていることに気づく。
「おかしいですね……部屋に入った途端、通信が切れた……もしや、アンチプロトコルによるハッキング？」
　ヒマリは下唇に指を当てて考え込んだ。
　急に通信が途切れたということは、アンチプロトコルによるハッキングを受けた？　アンチプロトコルは使えないはず。いや、そうとは限らない。何らかの理由があって、アンチプロトコルを温存していたが、それをする必要がなくなった。そもそもアンチプロトコルが使えなくとも、他のハッキング手段を講じられたか。どちらもありうる話だ。いずれにしても、異常事態に変わりはない。とはいえ、ヒマリに焦りはなかった。こうなった時の対抗策は考えてあるからだ。この後、伝令役に任命した生徒が戻ってくる手筈になっている。今は落ち着いてそれを待てばいい。しかしながら。
「……戻ってきませんね」
　ヒマリはタブレット上部に映された時刻を見てつぶやいた。通信が途切れてからもう二十分近くが経つというのに、いまだに誰も帰ってこない。
「もしや、何かあったのでしょうか」
　第二部隊はアンチプロトコルでアバンギャルド君を機能停止状態にされたら、戦力が激減する。アリスを救援に向かわせたのは作戦ミスだったろうか。
　第一部隊はヒナという圧倒的な存在がいるが、相手は覚醒したハレだ。完全に安全とは言えない。
「どうにも嫌な予感がします……エイミ」
「なに？　部長」
「第一部隊と第二部隊の様子を見てきてくれますか」
「いいよ。通信機、ちょうだい」
「待って、それなら私もいくわ」
「ユウカ？　気持ちはありがたいですが、あなたには補給班の指揮という大切な役割があるのですが」
「そうだけど、命令はほとんどヒマリ先輩が出してるし、私が現状やることなんて無いに等しいじゃない。それなら、私も前線に出たほうが効率がいいと思うわよ。ヒマリ先輩？」
「……そうですね。では、第二部隊の生存確認をユウカに、第一部隊の生存確認をエイミに任せるとしましょうか」
「おっけー」
「了解」
「ふたりとも、よろしくお願いします」
　と、ふたりに通信機を渡し、単身で中へと送り出した。


　二十分前、第一部隊。
「ヒナ委員長！　ヒマリ総司令との通信が切れました！」
「わかった。伝令役はあなたね？　作戦通り、お願い」
「はっ！　──ひ、ヒナ委員長！　大変です、扉が開きません！」
「えっ？」
　伝令役の少女が扉に張り付き、必死に引いたり押したりしても、びくともしない。
　ヒナが代わって同じことをしてみるが、やはりびくともしない。
「どうやら、閉じ込められたようね」
「ええええ！？」
「狼狽えない。こうなる可能性があるのはわかっていたでしょ。幸い、弾も傷薬もたっぷりある。最悪扉は破壊すればいいから、今はやれることをやりましょう」
　ヒナは落ち着いていた。他の部隊員もすぐに落ち着きを取り戻す。
　それから、ヒナは部屋の中を見渡す。部屋はとても広い大部屋だった。軽い戦闘も出来そうな空間がある。
「……もしかしたら、ハレの言ってたボスって？」
　さっきのオートマタは、耐久力が高いだけで大したことなかった。
　それに、よく思い返してみると、ハレは部屋の中にいるボスを倒せば自分のいる部屋のロックが空くと言っていた。
「みんな、構えて」
　天井がパカっと開く。やがて、降りてきたのは十個の白塗りのボックスだった。それは防音室や公衆電話の形に似ていた。
「……これは？」
　恐る恐る中を開くと、出てきたのは椅子とゴーグル付きのヘルメット。ただし、ヘルメットは至る所に導線が伸びていて、見るからに怪しい雰囲気を漂わせている。
「ヒナ委員長！　ここにこんなものが……」
　一番左端のボックスに入っていたらしい。
「十人でパーティを組んで、この中のヘッドギアを装着して、電脳世界での戦闘に打ち勝ってね。敗北したらゲームオーバー。リスタートは何度でも可能だよ」
「……これは、ハレのメッセージ？」
　電脳世界ってなんだろう。
「とりあえず、つけてみるしかなさそうね」
「ええー！　つ、つけるんですか？　これ？」
「多分、大丈夫だと思うから」
　部下は反対しているが、それを押し切り、ヒナはボックスの中へと入ってみる。それ以外の九個のボックスには、ヒナが独断で選んだ戦闘力の高い九名　当然、彼女達も迂闊に中に入るのは否定派だったが、上司でもあり憧れでもあるヒナに直々に指名されたという誉れが勝った。恐れながらも、ヒナに続いて中に入り、怪しげなヘルメットを頭へ嵌めた。

その頃、第二部隊も同じような状況に陥っていた。
「あわわわ！？」
　ただし、こちらはしばらく経っても慌てたままで、落ち着きく気配がかけらもない。
「お、お姉ちゃん落ち着いて！　とりあえず落ち着いて深呼吸を──」
「ひ、ひいいい……アバンギャルド君が動かなぃいい」
　ユズもアバンギャルド君の中に閉じこもってしまい、人見知りが発動してしまっている。
「もー！　モモ、ミド！　落ち着いてよ！」
「そうだ。慌ててもいいことなど何もないぞ」
「わ、私は落ち着いてますけど……」
　マキとイオリが落ち着かせる。
「……とりあえず、部屋の中を物色しませんか？　何か見つかるかもしれませんし」
　続いて、コタマが冷静に部屋の中を指差す。
　すると間もなく、第一部隊の時と同じように、天井が開いてボックスが降りてくる。
「な、なんだこれ？」
　恐る恐るその中身を開いて、中の様相に困惑するイオリ。問いかけるようにモモイ達の顔を見回して、ぎょっとする。目玉が溢れんばかりに瞼をかっぴらいて、鼻息荒く握り拳を作っていたからだ。
「ど、どうしたんだ、みんな？」
「ぶ──」
「ぶ？」
「ぶ、VRだああああああああ！！！」
わっ！　と、群がってくる。
「わ、わわ！　なになに！？　どういうこと！？」
「これ、VR！　アストロノーツ社が開発した最新機種です！」
「予約しても何年も待たされるっていう噂の幻のハード！」
「や、やってみたいー！」
　ミドリ、ユズ、マキがイオリへの説明をしながら、興奮を口に出す。普段感情を表に出さないコタマも、頬を紅潮させ、キラキラと目を輝かせていた。
「な、なんでみんなそんなに興奮してるんだ……」
　この中では間違いなく実践馴れしているはずのイオリが、最も動揺しているという想定外な状況。この中でただ一人、意味がわかっていない疎外感を覚える。
「私！　一番乗りー！」
「あ、ずるいお姉ちゃん！　私も！」
「あ、えと、その──じゃあ、私はここに！」
「コタマ先輩！　あたしたちも入るよ！」
「もちろんです。マキ、いきましょう」
「お、おい！　危ないぞ！」
　イオリが静止するも、誰も聞く耳持たず、バタンとボックスの中に入ってしまう。あっという間に、半分以上のボックスが使われてしまった。
　──な、なんなんだこいつらは！　なんでこんな得体のしれないもんに平然と飛びつけるんだ！？
　イオリは一般人と組まされることに辟易とした。ヒマリいわく、第一部隊はヒナが一人入れば十分な戦力である。それに次ぐ戦闘力を持つイオリは、ぜひゲーム開発部とヴェリタスの部員を束ねてほしいと頼まれたのだ。正直に言うと、イオリは彼女達を足手まといだと思っていた。事実、彼女達は戦闘のときもほとんど後方で狼狽もしくは応援していただけで何もしていないに等しかった。最も、それはユズが操作するアバンギャルド君が強すぎたせいもあるが。それが急にこの行動力で、緩急に思考がついていかない。
「あ、あの──これ、見てください」
「こ、今度はなんだ？」
　そして、さらに追加の情報が入る。それはミレニアムの生徒が一番左端のボックスの中から取ってきたメモ書きだ。
「なになに？　な、中にあるヘッドギアをつけろ、だって！？　くっ……ということは私達もあれをつけなきゃいけないのか……」
　内容を目にして、イオリは驚いた。そして、最速で最適解を選んだモモイたちを見直してしまう。彼女達は、ただ目の前に現れたゲームに目がくらんだだけなのに。
　イオリは嘆息すると、じっと遠巻きにこちらを見ている一般生徒達に視線を巡らせた。
「そこのあなたとあなた、最後にあなた……ここまですごくいい動きしてたから、悪いけど協力してくれないか？　リスタートってのが何かは知らないけど、十人でつけなきゃいけないだろうし、戦うことになるみたいだから、少しでも腕が立つ人がいいだろうし」
ミレニアムの生徒を二人、ゲヘナの風紀委員の生徒を一人、指名する。彼女達はイオリと同時に中へ入る。ヒナに指名された生徒と違って迷いはなかった。その理由は単純に褒められたのが嬉しいのと、なんの躊躇もなく中に入ったゲーム開発部達の無謀さに触発されたからだ。

　ボックスの中に入り、全員がヘッドギアを装着した直後、ヒナ達は協会のような空間にぽつんと放り出されていた。
「……ここはどこかしら？」
　前に歩く。
VS　“HIERONYMUS”
　赤いアラートで強調された文字が、突如空中に浮かぶ。同時に奥の祭壇に、ポッと巨大なローブを纏った化け物が現れる。
「あ、あわわわわ……な、何あれ！　それに、身体が動きません！」
　くどいようだが、第一部隊は風紀委員の中でも実践経験が豊富な者を集めている。しかし、その一人が怯えた一般女子のような悲鳴を上げた。
　その理由はいくつかある。まず、先程から足が全く動かない。感覚を喪ったかのように固定されている。動かせるのは上半身だけという状況だ。身動きを奪われた状態で怪物と退治させられたのが、余計に恐怖を煽っている。彼女が怯えるのも無理はない。ヒナでさえ、一瞬怖気づいてしまったのだから。
　“HIERONYMUS”──ヒエロニムスが動き出した。だが声は発さない。それが却って不気味差に拍車をかける。
「みんな！　怖気づく前に攻撃！　手は動かせる！」
　こんな状況でも、ヒナは冷静だった。全員を鼓舞する。
　ヒエロニムスの手から、エネルギー弾のようなものが飛んでくる。
「き、ぎゃああああああ」
　それは最も前にいた風紀委員の体に恐ろしい制度で着弾した。たまらず、野太い悲鳴を上げる。
「あああぁぁ……あれ？　い、痛くない？」
　だが、ひとしきり声を出し切った後、被弾した風紀委員が
「……ひ、ヒナ委員長！　なぜかダメージを受けても痛くありません！」
「で、でも見て！　頭の上の緑色のゲージがちょっと減ってる！」
「え！？　わ、私には見えないんだけど！？」
　頭上に浮かんでいるミドリのゲージの右端がオレンジに切り替わっている。
「そう……よくわからないけど痛みがないんだったら、余計に怖気づいてる暇はない！　とにかく攻撃！」
　ヒナは思考を止めた。彼女の視線は、ヒエロニムスの頭上にも同じゲージが浮かんでいるのを捉えていた。今、重要なのは相手より先にそのゲージを減らすことだ。
　だが、いくら撃っても撃っても、微々たる量しかお互いに減らせない。
　そうして、三十秒くらい打ち続けた頃だろうか。
「う、ウルガータ！？」
　突然、ヒエロニムスが両手を合わせたかと思いきや、その中心に現れる小さな光の弾。それが、最前線で攻撃を受け続けていた生徒の胸に吸い込まれる。その頭上、緑ゲージの左上に、十と数字の書かれたアイコンが付与される。
「な、何！？　私今何されたの！？」
「よ、よくわかんない！　でも、頭の上になんか変な数字がついてるよ！」
　誰も何もよくわかっていない。だが、その数字は秒刻みに減っていく。そして、⁰になった瞬間。
「うっ！」
　光を受けた生徒を光源に、パッとなにかが爆ぜた。
「わ！　ゲージめっちゃ減ってる！」
「あ、あんたもだよ！」
「えー！？」
　更にもう一度、同じ攻撃を食らってしまう。すると、爆心地にされた生徒のゲージがゼロに。いったい、どうなってしまうのか。
「な、なにこれ！？　身体が吊り上げられて──やっ！　助けてええ！！！」
　ゲージの無くなった生徒の天井からワイヤーのようなものが垂れてきて、身体に巻き付いた。そのまま、拘束した生徒を連れて行く。連れ去られた生徒は悲鳴をあげ、悲痛な表情を浮かべて無慈悲に退場させられた。その様は、現実で見るにはあまりにショッキングだった。特に、恐怖に染まった表情が、呪いのように伝染する。
「撃つ手を止めない！」
ただ一人、ヒナが鼓舞するも、もうだめだった。次のウルガータが別の生徒を中心に、どんどん数を減らしていく。その度、連れ去られる女子生徒。みな、同じように
「ふえ……ぐすっ!　やだあああ！」
それを何度も見せられたからか、ついには撃つ手を止め、泣き出してしまう生徒まで現れる。
「くっ！」
ヒナは強く奥歯を噛み締めた。皮肉にも、彼女は最後尾に配置されていた。こうなってしまっては、もう声は届かない。ならば、前線に踊り出て、彼女達を勇気づけて上げたかった。だが、自由に足を動かせない今、それはままならない。結局、部下が苦しむ姿を間近で見せつけられる。今まで感じたことのない無力感がヒナを苦しめる。
　そして、ついにヒナは一人になった。
　な、なんとかしなきゃ。
たった一人になってしまった空間で、ヒナは解決策を模索する。だが、動けない彼女にできることはない。何度目のウルガータだろうか。今度は、ヒナの身体に吸い込まれる番だった。
──ここで、私も終わりなの！？
　ヒナは光に包まれた。
「…………え？」
数秒後、ヒナは再び教会に放り出されていた。
「い、委員長？」
「み、みんな……良かった。無事だったのね」
「あ、あああああ！」
　そして、再び目の前に現れるヒエロニムス。
　ヒナ達は、何度も何度もやられ続けた。そのたびに
　みんな、戦意を喪失してしまい、手を止めて呆然と立ち尽くしている。その間にも、容赦なく飛んでくるウルガータ。
……まずは情報を整理しよう。
ただ一人、奮闘しながら、ヒナは冷静に考えた。
足が動かせないなら頭を動かせ。何度やられても、死ぬことはない。ならば、必要以上に恐れることはないのだ。
そのことに気づいているのは、ヒナだけである。
……とはいえ、それも今更の話だけれど。
ヒナは視線を右上に移した。どういう原理なのかわからないが、視界の端々に現実であ見慣れないものが表示されている。ヒナが注目したのは、右上の数字だ。それはタイマーのように見える。だが、６０：００を示したまま、止まっていた。恐らく、何らかのきっかけを与えれば動き出すのだろうけど、その方法は皆目検討もつかない。しかし、動いていないのはかえって幸いかもしれない。この空間では何度やられても生き返ることができるけど、これがゼロになったらどうなるのか、それは考えたくもないことだ。
それと、これは何？　色々と文字が書かれているけど、どういう意味か全くわからない。
次にヒナは、右下にうっすら浮かんでいる四つの選択パネルを見た。左から順にEXスキル、ノーマルスキル、パッシブ+スキル、ドレスチェンジ。これらは最初は真っ暗になっているが、戦闘が始まって時間が経つごとに順に明るくなっていく。スキルということは、自身に与えられた能力なんだろう。おそらく、これを使ってなんとかするべきなんだろうが、いかんせん使い方がわからない。手で押そうにも、押せない。手をギリギリまで目に近づけても、パネル部分の重ね順が手前なのだ。
それと、左にあるよくわからない壺のようなもの。あれにもゲージがついている。
今度は視界の左端、隊列から少し離れたところに不自然に浮かんでいる緑の壺。あれのゲージは初めから全てがオレンジ。
あれになにかアプローチすれば変わるかも？　……でも、銃口を向けることが出来ない。
そして、何度目かわからない全滅を迎える。刻一刻と減っていくタイマー。こんな調子で、本当に生き残れるのだろうか。百戦錬磨のヒナの額を、初めて冷や汗が伝った。

　その頃、第二部隊も同じ状態に陥っていた。
　アビドスの砂漠地帯に非常に酷似した部隊で、こちらもまた怪物と戦わされる。
「うわあああ！　また死ぬうううう！　あたしのHPどんくらい！？　絶対もう死ぬよね！？」
　こちらに表示された相手は“BINAH”──ビナーである。ビナーはヒエロニムスのようなエネルギー弾とは違い、砂嵐で直接的な攻撃を仕掛けてくる。その犠牲になっているのは、戦闘に立っているモモイだ。
「もうミリだよ！　お姉ちゃん、グッジョブ！」
　ミドリがサムズ・アップする。
「あたしまだ何もしてないよ！？　って、うわーん。またやられちゃったー！」
ミドリの言葉に怒りのツッコミを入れた瞬間、モモイのHPゲージがゼロになり、連れ去られる。
　だが、こちらに悲壮感はない。
　なぜならこれがVRゲームだと思っているから。
「ビナーのHPが全然減りません！　確実に正攻法で攻略できるボスではありません。なにかギミックは無いのでしょうか？」
「わ、わかんない！　さっきから探してるけど全然見つからないよ！」
「お、おなじくですう」
　コタマの言葉にマキとユズが順番に答える。
第二陣のゲーム開発部、及びヴェリタスの連合軍は、ヒナたちがやられ続ける恐怖に苦しむ中、緑たちは死に続け、そのたびに得た情報を整理し、非常に建設敵な会話を繰り広げていた。
「こ、この右下にあるの、スキルだよね！？　な、なんとか使えないかな？」
「わからない！　色々試してるけど、全然押せないし、あたしたちは銃を撃つしか出来ない！　しかも敵は当たり前のようにスキル使ってくる！　なんなのこれ！　自分のHPゲージだって確認できなしい、欠陥設計にもほどがあるよ！」
　ヒエロニムスでいうウルガータに当たるビナーのスキルは、アツィルトの光。騒がしい会話を続けるマキたちの身体は、炎のようなエフェクトに包まれている。直接的なダメージはないものの、じわじわと持続した攻撃にHPゲージが徐々に減っている。ウルガータ異常にショッキングな絵面だが、本人たちはまったく気にもとめていなかった。
「こんな素晴らしいゲームをクソゲーにするなんて……ゆ、許せません！」
「もう！　開発者でてこーーーーーーーい！」
ふんすと鼻息荒くしながら腹いせに鉛玉をぶち込んでいたマキだが、度重なる持続ダメージにより、ゲージが無くなってしまい、断末魔を残して強制的に連れ去られていった。続けて、同時に焼かれていたユズ、コタマ、ミドリも退場する。
「お、お前ら……頼もしいな」
　どこか気の抜けている光景に、イオリが呆れた様子で口にする。直後、今度は彼女の身体が炎に包まれた。


ココカラファイン



　その頃、地上ではヒマリがエイミとユウカを送り出したところだった。
　三分割していたモニターをさらに分割し、五画面を同時に俯瞰する。
「ヒマリ総司令！　あそこ、見てください！」
　タブレットと睨めっこしていたところ、待機していた生徒の一人に声をかけられる。顔を上げると、甲板に再びハレが現れる。
「今度はどうしましたか、ハレ。また何か有益な情報でもくれるのですか？」
　挑発的な笑みを浮かべた。
「まあね。さっきの情報は役に立たなかったみたいだから、今度はもっと重要な情報をあげる。特別に私が使ってたコンソールルームを開放してあるから、ヒマリ部長も中に行ったほうがいいよ」
「……再び聞きますが、私が敵に渡された情報を易々と信じると思いますか？」
「疑うのは勝手だけど、このままだとみんな死んじゃうよ？　ただでさえ動けないのに」
　まあ、ゲーム内のタイマーがゼロになったところで一旦ゲームから追い出されるだけなんだけどね。
　ハレがそう思っていることを、ヒマリは知らない。
「さあ、それはいいんじゃない？　あー。それとユウカとエイミは第三部隊に向かわせたほうがいいと思うよ。そっちの方が適正高いと思うから」
　当たり前に言った第三部隊という単語に、ヒマリは目を鋭く細めた。その言葉をハレの前で口にした覚えはない。にも関わらず知っているということは、何らかの方法でこちらの情報を取得しているということ。つまり、こちらの通信を盗聴しているというわけだ。
　ヒマリは沈黙し、顔を俯けると、しばし考え込んだ。ハレの言葉を信じるべきか否かを。
「……なるほど。ですが、単身というわけにはいきませんが、それでも構いませんか？」
やがて、ヒマリはハレの言葉を信じ、中に乗り込むことに決めた。
　さっき、ハレは動けないと言った。それが全く手足も動かせないか、単に部屋から動けないという意味なのかはわからない。確かなのは、彼女達の裁量権をハレが握っているということだ。ゆえに人質を取られ、身代金をを要求されているように。良くないと分かっていても、従うしかない。
　だが、護衛であるエイミがいない以上、直接的な戦闘力に劣るヒマリが乗り込むのはリスクが大きすぎる。特に単身で行くというのは絶対にありえなかった。
「別に、何人連れてってもいいんじゃない？　まぁ、あれをクリアするのはヒマリ部長にしか出来ないと思うけど」
「……分かりました。では、行くとしましょう」
「がんばってね」
　ハレがふっと消える。ホログラムか何かなのだろう。
　その後、ヒマリは護衛の生徒を何人か引き連れ、突入する。
　先に突入した遊撃部隊の後を追っているはずだが、途中にオートマタの残骸などは残されていなかった。すでにハレによって回収されているのだろうか。
　そんなことを考えながら中に入り、数分ほど経ったところで、膝上に置いていたタブレットが震える。ユウカからの通信だった。
『ヒマリ部長、言われた場所に到着したけど、この扉、固くて全く開かないわよ』
　映像を拡大する。すると、扉を片手で持ち、困り顔で力を込めているユウカの姿が映る。
「……恐らく、扉がロックされているのでしょう。中に声も届きませんか？」
「それはもうやったけど……おーい！　ヒナ！　みんなー！　聞こえるー！？　……やっぱりだめ。ノックしても、大声で呼びかけても、誰も反応しないわ」
　ユウカはやれやれと肩をすくめた。
『分かりました。無理に破壊しようとすると、碌でもないことになるかもしれません。ユウカ、しばらくそこで待機していてください。エイミの連絡も待ちます』
　ひとまず、ユウカとの通信を繋げたまま、エイミから報告が来るのを待つ。
『部長、目的地に到着したけど、扉が開かないよ。ロックされてるみたい』
　しばらくしてエイミからも通信が来たが、やはりそちらも同じらしい。
「……分かりました。では二人とも、ひとまずそこに待機していてください。今、私も戦艦内に侵入しています。コンソールルームを探し当てるつもりなので、そこでロックを解除する手段を探します」
『え？　部長も来てるの？　じゃあ、私達も部長のところに行った方がいいんじゃない？』
「いえ、もちろん護衛の生徒たちは引き連れていますので。それよりも、二人には扉の様子がおかしくならないか、監視していてほしいのです」
『わかった。そういうことなら、ここで待ってる』
『しばらく待機ね。了解したわ、ヒマリ部長』
　エイミとユウカの通信が切れると、ヒマリはタブレレットを膝上に戻した。
「さて、我々は何とかしてコンソールルームとやらを探さなければならないのですが……いったいどこにあるのでしょうか」
　ハレはコンソールルームに行けと言っていた。だが、それがどこにあるかも検討つかない。ひとまず、それを探す手段を探さなければ。どこかに何つか都合良くデータにアクセスできるPCでも落ちてないだろうか。
　そんなことを考えていた時だった。突き当たりの通路を曲がったところで、オートマタに遭遇してしまう。
「──敵！？」
　ソワソワしていた生徒の一人が、敵の存在に気づいて、銃を構える。反応の早さは見事だが、素人目に見ても腰が引けていた。
「いえ、大丈夫なようです」
　今にも発砲しそうな生徒を、ヒマリは手で制する。
「このオートマタに敵意はなさそうです」
　ヒマリがそういうと、オートマタは背を向けて歩き出した。
「ついてこいと言ってるようですね」
　まるでガイド役のように導かれる。何度か階段を登り、やがて到着したのは巨大なサーバールームだった。広さは体育館ほどあるが、そのほとんどが大量のコンピュータで埋め尽くされている。
「これは……またとんでもないものを用意しましたね」
　そのコンピュータ群が、ただの凡物でないのは一目で見抜いた。ニュースやネットの記事で見たことがある。これらは多分、スーパーコンピュータ・ゼロだ。
　図形の線をなぞるように、部屋の奥へ向かう。入り口から見て最奥にはコンソールごあった。キーボードやマウスといった入出力装置にメインモニターと四つのサブモニター。それらの危機からつながる導線は一つの本体に繋がり、そこからスーパーコンピュータ・ゼロへ接続されている。
　コンソールエリアの前に着くと、オートマタは手で椅子を差し示した。
「……ここに座れということですか」
　スーパーコンピュータ・ゼロにアクセスさせるとは、よほど慢心しているように見える。とはいえ、当然権限は制限されていた。まず、使えるモニターは三つ。メインモニターと二つのサブモニターだ。それらは初めから起動されていて、すでに実行されたアプリケーションからデスクトップに戻ることも停止することもできない。
　モニターには、黒バックに白文字で、『クリックするとゲームスタート』と簡素に表示されている。
　いったい何が始まるというのか。ひとまず、進まないことに事態は進展しない。
「これは……皆さん？」
　メインモニターに写っているのがヒナ達第一陣が巨大な聖職者のようなモンスターと対峙している映像が、サブモニターの一つにモモイ達がビナーと対峙している映像が映っていた。しかし、いずれも彼女達は棒立ちのまま銃を撃ち続け、敵の攻撃を受け続けている。敵と彼女達の頭上にはHPゲージが浮かんでいて、攻撃を受けるたびにそれが減っていた。
その光景はゲーム画面に酷似している。そう思った時、ふいに右上のタイマーが進んでいないことに気がついた。その瞬間、画面にポップアップが出てくる。
　──三つの電脳世界にストライカーが入った時、ゲームが始まるよ。制限時間は1時間。スキルを上手く使って、ボスを倒してね。全員のHPがゼロになる、もしくは左上のメニューからリスタートを押せばゲームがリスタートされるよ。
なるほど、ハレが度々ゲームという単語を出していたのは、初めからこれをやらせるつもりだったのですね。しかし、なぜ？　意図が分からない。単に遊んでいるだけだろうか。なんにせよ、これをクリアするしかなさそうだ。
「ユウカ、エイミ、聞こえますか？」
『聞こえるよ』『こっちもきこえてる。何かあったの？』
「予定変更です。今から二人には第三部隊への救援に向かってもらいます」
モニターには第三陣の様子も映っているが、彼女達は迂闊には動かず、救出を待つ選択を取ったらしい。部屋の隅に固まり、じっと円を組むように座り込んでいる。彼女達も何らかの形でゲームに参加しなければ始まらないようだ。
『第三部隊に何かあったの？』
「ええ。それは道中話します」
　ヒマリはユウカとエイミを第三部隊のいる部屋へと誘導する。その道中、ハレが仕掛けてきたゲームについて
『げ、ゲーム！？　なんで今なのよ……あの子、まさかふざけてるわけじゃないわよね？』
「……意図はわかりません。ですが、もしかしたら私達をおちょくっているだけかもしれませんね」
『まったくもう！　別になんだっていいけど、帰ってきたらお説教だからね！　ハレ！』
　走りながらプンスコと憤慨するユウカ。
第三陣がまだゲームに入っていないのは幸いだった。もし、彼女達がゲームを初めてしまっていたら、右上のタイマーが進み始めてしまっていただろうから。
『到着したけど、この中に入ればいいのね？』
「ええ。そちらは開くはずなので、お願いします」
　恐らく、ゲームスタートと同時に扉がロックされる仕組みになっているはずだ。
『開いた！　開いたわ、ヒマリ部長』
　ユウカの高揚した報告が入る。
「では、中に入ったら白い防音室のようなものが十個あるはずです。それで何かして、ゲームに入ってください」
『何かしてって……いくらなんでも抽象的過ぎない？』
「中に入ったら通信が途切れる可能性が高いので、今はこうするしかないのです。もちろん、通信が途切れないのならそれでいいのですが……」
『了解』
　第三部隊への通信が途切れていることから、同様の状態に陥る可能性が高い。また、目の前のモニターでも全体を俯瞰する画角でしか部屋の様子を映せないため、このような曖昧な指示しか出せなかった。
　その後、案の定ユウカとエイミが中に入ると、通信は途切れてしまった。また、モニターの映像でユウカが外に出られないか確認していたが、扉が開けられなくなっているようだ。恐らく、ゲームが始まる前までは中に入ることだけ可能で、ゲームが始まったらどちらからも開けられなくなる仕組みなのだろう。
　中に入ったユウカとエイミは、先に入っていた第三部隊のメンバーに囲まれ、話し始めた。外から入ってこられた理由やどうして来れたかなどを聞いているのだろう。
　ヒマリとしては説明はそこそこにさっさとゲームを始めてほしいところだった。ヤキモキしながら動向を見守っていると、ようやくエイミが白い防音室に歩み寄り、中を確認する。中に何かあることに気づいたようだ。やがて、一番端のボックスから紙を見つける。それはハレが残した注意書きだ。
　しばらく話し合いを続けた結果、ユウカとエイミを始め、十人のメンバーがそれぞれ防音室の中へと入る。それからすぐに、第三部隊を映していた画面が切り替わる。

　第三部隊のいる部屋に入ったユウカとエイミは、集まってきたみんなとの話を終えると、白い防音室の中に怪しいゴーグル付きのヘルメットと椅子があるのを発見した。怪しさ満点な雰囲気だが、きっとそれをつけることがゲーム開始なのだろう。ヒマリの話では、今こうしている間にも第一部隊や第二部隊はボスとの戦いで、やられては生き返ってを繰り返しているはずだ。ユウカは自身とエイミを筆頭に八人の生徒を選び、中へ入った。
　椅子に腰掛け、「ヘッドホンを装着してから数秒後、ユウカは一瞬意識が飛んだような錯覚を覚えた。
「……ん。ここは？」
瞬く間に視界が暗くなり、次に目を開くと、彼女は異様な雰囲気の室内にに立たされていた。正面には丸い土俵のようなステージとSCREAMと書かれたピカピカ光る看板。左右にトンネルがふたつあり、それぞれ線路が走っている。地下鉄の走る遊園地という印象を覚えた。
　それともうひとつ気になるのが、視界の中に映ったゲーム画面のようなUI。ヒマリに事前に聞かされていたこともあり、ユウカはすぐに自分がゲームの世界に入り込んでしまったことを察した。
「ゆ、ユウカ。何があったの？　私達、どうしてこんなところにいるの？　それに、動けないよ！」
不安げな声で尋ねられる。腰を捻って後方を振り返ると、自身を除く防音室に入った九名が同じフィールドに立っていた。
声を発したのは、ユウカと同じクラスの生徒だった。今にも泣き出しそうな不安げな瞳をユウカに向けている。第三部隊は慎重な生徒が多い。彼女はその中でも特に臆病であることを知っている。だが、同時にユウカが困っているからと、危険な八名の内に立候補してくれた優しい子であることも知っている。
「ごめん、私も何が起こっているのかよくわからないけど、大丈夫よ。この状況はヒマリ部長の言っていた通り、予定通りだから！」
　ユウカは彼女を元気づけるため、ニコリと笑顔を浮かべると、安心させるように明るい声でいった。
「うん、私達にはヒマリ部長がついてるから大丈夫。それに、いざとなったら私とユウカが前線みんなを守るから、心配しなくてもいいよ」
　続いて、エイミも　その言葉通り、ユウカとエイミの立ち位置は隊列の中で最も前。ゲームで例えるならタンクのいる位置だ。みんなを守ると言っても、まともに移動の出来ない現状、あまり説得力のない言葉ではあるが、二人が最前列に立っているという事実が、他の八人を安心させているのは事実だ。
　その後間もなく、キキキっと不気味な笑い声が聞こえた。
　はっとして正面を見ると、先程まで誰も立っていなかったステージの上にシルクハットを被った巨大なマスコットのようなモンスターが立っている。
「な、あれって……あの化け物は何！？」
　VS　“GOZZ”
　視界の中に赤いテロップが流れる。
「よくわからないけど、戦うしかなさそうね……みんな、銃は撃てる！？」
「う、うん！」
「じゃあ、とりあえず攻撃して！　あいつを倒すわよ！」
　ユウカの号令をきっかけに、全員が銃を構え、トリガーを握る。視界の右上のタイマーが動き出していた。

無事にユウカ達第三部隊がゲーム画面へと入った。その瞬間、凍結していた三つの時間が同時に動き出す。
「さて。スキルを使えとのことですが……これ、ですか？」
　ヒマリはマウスを動かし、カーソルを右下のスキルパネルに重ねた。すると、画面がスローになり、説明文のようなものが表示された。
　攻撃を1回弾き返すシールドを張る。
　試しにそれをクリックしてみる。だが、それだけでは何も起こらず、対象を選択してくださいという指示が出る。カーソルをユウカに合わせ、クリックした。
「……なるほど。スキルはこういう風に使うわけですか」
　そのゲームの仕様をヒマリは瞬時に理解した。要はソーシャルゲーム等にありがちな戦略ゲームだ。
「しかし、これを三人同時ですか……一見、クリアは無謀に見えますが、ハレがそんなクソゲーを作るとも思えません。……いいでしょう、このゲーム。天才の名にかけて、クリアして見せます」
　ヒマリは笑ってみせた。


　第三部隊、VSゴズ。
「え！？　なんか来た！？」
ユウカは　彼女の意識とは裏腹に、身体はいつの間にか現れたスマホを操作する。およそ一秒弱、ふと、
「分からない……分からないけど、私達にとって得なことに違いはないわ。このまま一気に倒し切りましょう！」

第一部隊、VSヒエロムニス
　何度、何度倒され続ければいいの？
　もう何度心の中で唱えたわからない疑問を、ヒナはさらに唱えた。
　この空間に放り込まれてから、一体どれほどの時間が経ったのか。それほど経ってはいないが、体感時間はその数倍だ。
　みんなのメンタルもそろそろ限界なのに。
　ヒナは目を細めた。
　最後尾に配置されているヒナには、他のメンバーの様子がよく見える。みな、一様に戦意を喪失していた。仮に痛みがなくとも、何度も殺され、また殺されに戻るのは心に来る。この場の長としてふさわしい振る舞いをしなければならない。そんな言葉で自らを奮い立たせているが、終わらない死の連鎖に正直まいっていた。
　そして、彼女達はまた全滅し、同じようにリスポーンさせられる。今度もまた、殺されるために舞い戻る。
　だが、今度は違った。
「……え？」
　その変化に真っ先に気づいたのは、ヒナだった。
ドレスチェンジのスキルが使用される。直後、ヒナの身体は青く白い光に包まれ、
「な、ヒナ委員長！？　どうしたんですかその格好！？」
　先程のヒナのつぶやきに反応した生徒の一人が振り返り、驚愕に染まった顔で問いかけた。
「…………分からない。でも、これは──」
　ヒナは唖然としながら、ゆっくりと首を振った。
　光が霧散した瞬間。気づけばヒナはドレスを纏っていた。変わり果てた自分に驚く。
　そして数秒後、今度は新しく生まれ変わったEXスキルが使用される。
　すると、ヒナの身体はひとりでに動き、中腰でライフルを構える。
　1秒後、1度目の射撃を発した。
　２秒後、さっきよりも威力の高い射撃を放つ。
　３秒後、最大級の射撃が空気を切り裂いた。
　反動にヒナが顔をしかめる。だが、その効果はあまりに覿面だった。
「──ォォオオオ！」
　ヒエロニムスが大きくのけぞる。HPゲージも、通常攻撃を撃つよりは大きく削れている。反撃の狼煙に士気がわずかに上がる気配がした。
「す、すごいですヒナ委員長！　今、何したんですか！？」
「わ、分からない。私は何もしてない……」
　気づけば、服もいつものそれに戻っている。
　考えられるのは外部からの干渉。不思議と、浮かんだのはヒマリの顔だった。
「……まだ何が起こってるかよくわからないけど、きっといいことに間違いはない。この隙に一気に攻撃しよう。みんな、協力して」
「はい！！！」
　ヒナの言葉はとても力強く聞こえた。生気を失っていた顔に再び活力がみなぎる。
再び攻撃を再開したヒナたち第一部隊。突然発動したドレスチェンジによる反撃の狼煙を上げた後、止まっていた手を動かし、だけど。　
あまり敵のゲージが削れていない。
 　ヒナはわずかに顔をしかめた。その事実に気づいているのは果たして自分だけなのか、それとも士気を気にして口に出していないだけなのか。
「こ、今度は私が──」
　それはヒナの一個前に配置されている生徒だった。彼女にも、外部からの干渉が起きたらしい。腰から取り出した瓶のようなものを投げる。
「え！　なんでそっち！？」
　それも、ヒエロニムスに対する大打撃を与えるものなのかと期待した。だからこそ、投げた本人も驚いていた。
　瓶が壺に直撃する。すると、それが持つゲージがマックスまで回復する。
　そして、またヒナの身体にドレスチェンジが発生する。
　三度の射撃。今度は最初に撃った三発よりも、更にHPゲージが削れる。
「ま、また私！？　あれ、でも今度は──」
　瓶を投げる。今度はウルガータを食らった本人だ。
「あ、あれ！？　爆発が……起きない！？」
　ウルガータも不発に終わる。
　それからしばらく、攻撃する。ヒエロニムスの体力を半分ほど削った辺りだった。
「こ、今度は何！？」
　ゴゴゴゴと視界が揺れ、地面が割れる。
　悲鳴とともに落ちた。
「な、なんか場所が変わった！？」
　だいぶ高いところから落下したはずなのに、身体的なダメージはやはりない。
「落ち着いて。場所が変わっても、さっきと同じ要領でやれば倒せるはずだから」
そういって、ヒナが全体を鼓舞した証拠だった。中央の生徒を中心に、範囲的な爆発が起きる。それを食らった生徒のゲージが、ウルガータを食らった分以上に削れている。驚く間もなく、飛んでくるのは“ウルガータ”。今度はなすすべなくそれをくらい、中央の生徒のゲージがなくなり、ワイヤーで吊り上げられてしまう。
　“ダマススの招講”そして、“ウルガータ”
　ステージが変わり、敵の攻撃手段が増えた。なるほど。そんなに簡単には行かない、というわけね。
　そして、ヒナ達はほどなくして全滅してしまう。全滅後、一瞬視界がブラックアウトして、また最初のステージに戻される。
　そこからまた、何度も何度もやられ続ける繰り返し。だが、今度は前のような悲壮感はない。最初のステージを安定して突破できるようになったからだ。苦しかったときに比べ、前に進めているという安心感はヒナたちの心を強く強く支えていた。不安があるとすれば、右上のタイマーだが、それもまだたっぷりと残っている。
　何度もやられ、リスポーンし続けていくうちに、スキルの発動タイミングなどが変わっていく。それは敵を倒すため、最適なスキル回しを模索しているように見えた。
　そのうち、彼女達は確信していた。自分たちを操る誰かの存在を。
　同時に、全員の想いは一つになっていた。どうせ自分でEXスキルやドレスチェンジを使えないなら、それは誰かに任せればいい。自分にできるのはただ撃ち続けることだけ。今はそれに集中しよう、と。
　

　第二陣。
「くらえ！　ペイントボール！！！」
　マキが叫び、ボールを投げる。
「ナイスデバフ！　マキ！」
「えへへ！　な、なんだかよくわからないけど、急にスキルが使えるようになってよかったね、ミド！」
　マキに与えられたEXスキルはデバフを与え、強力なダメージを与えるシンプルな効果だ。
「でも、なんで急にスキルが使えるようになったんだろうね？　まあ、自由に使えるわけじゃなそうだけど」
「というより、何者かに操作されている気がします」
「だね！　でも、さっきからほしいと思った瞬間にスキルが使える……凄腕の人には間違いないよ！　もしかして、ヒマリ部長なんじゃない！？」
「それはわかりません。ですが、私はヒマリ部長がゲームをしているのを見たことがないです──お、今度は私の番ですね」
　呑気な会話を交わしながら、コタマがEXスキルを発動する。彼女の能力は味方全体の攻撃力の底上げだ。具体的な数字が明記されていない。そのため効果がどれほどあるかはわからないが、バフというのは受けられるだけで嬉しいものだ。
「おい！　お前ら、無駄口を叩いてないで攻撃しろ！」
「わかってるよ！　いけいけー！」
　イオリの叱責に、モモイが答える。
　ビナーは防御デバフが重要な相手だと理解していた。マキのスキルによるデバフは長くない。それがかかっているうちに攻撃するのが大事だ。だから、どれだけ攻撃をくらおうが、身体が燃えようが微塵もひるまない。もっとも、怯んだところで逃げることも
出来ないだが。
「わ、私が回復します！」
　そして、HPが減れば回復スキルを持つ生徒が回復を飛ばしてくれる。そして、HPを削ると、ビナーが逃げる。
「あ！　あいつ逃げたー！」
「追いかけろー！」
身体が勝手に動き、ビナーを追いかける。
「いたー！　もう逃さないんだからね！　って、眩しい！？」
　ビナーに追いついたと思いきや、その目がピカッと光り、モモイは顔をしかめる。
“浄化の光”
　そして、目を開ければHPに　そして、防御デバフまで。
「うわ！　し、死ぬー！」
「か、回復！」
　慌てて回復することで、なんとかHPを半分まで戻すことに成功する。だが、
「ち、ちょっと！　やばい！　こいつ、パワーアップしてない！？」
　さらに、“アツィルトの光”まで飛んでくる。
「うわーん！　死んだー！」
　身体を燃やされ、モモイが離脱する。焦りの雰囲気が伝搬する。
「く、くらえペイントボール！」
「こ、今度は私も！」
　マキのデバフに合わせ、今まで牙を隠していたユズのEXスキルが発動する。
ユズのEXスキルはマキから防御デバフを無くしたような効果だ。ただし、息を潜めた分だけ、攻撃力が上がるという文言つき。
「す、すごい！　ビナーのHPがもうあんなに削れてます！」
ここまでずっと、息を潜めた分の攻撃は一際強力だった。
　三分の二まで減っていたビナーのHPを三分の一にまで減らす。
「わ！　また逃げた！」
予想外に大きな攻撃を受けたから、ビナーは地中に潜り、逃げる。当然、追いかけるマキたちだが。
「あ、あたしも撃つぞ！　発射！」
　イオリのスキルは、扇状に拡散する三段攻撃だ。
「みんな！　上見て！」
「え？　……わあ、そんなのってありー？」
　マキが乾いた笑みを浮かべる。
空から降ってくるのは、大量のミサイル。それは、追い詰められたビナーが苦し紛れに放った最大火力の攻撃だった。
　“大道の劫火”
　パーティの中心めがけ、放たれた大量のミサイルは、マキたちのHPを消し飛ばすには十分だった。

第三部隊、VSゴズ。
「い、いやあああああああ轢かれ──あれ？」
　線路上に吹き飛ばされる。右側にただ一人飛ばされてしまったユウカ。地面が赤く光り、奥のトンネルに二つのライトが見えた。そのまま電車に轢かれると思いきや。
　なんと、ユウカの身体にあたった電車が跳ね返る。それはゴズの頭にあたり、目を回させることに成功した。もちろん、ゴズのHPゲージも削れている。
「おー。さすが体重百キロだね。まささ、電車と相撲して勝つなんて」
「な！　ち、違うわよ！　ていうかエイミ、その誤解、まだ溶けてなかったの！？　あれは誰かからハッキングを受けたせいだって言ってるじゃない！」
　これは無論、ユウカに　そもそもユウカの体重が百キロあろうが、電車の重さはトンを有に越える。それに走ってきた分の動力が加わるのだ。普通は跳ね返すなんて芸当、できるはずもない。だが、ユウカの体重ならワンちゃん行けるかもしれない。そんな声がどこからともなく、聞こえるようだった。
「お、おー？　今度は私だ」
　エイミがスキルを撃つ。彼女のスキルは前方に攻撃だ。なんの捕捉効果もないシンプルなスキルだ。
「みんな！　危ない！」
続いて、今度は左にやってくる電車。ユウカが忠告しつつも、自身の力で逃げられない彼女達は電車に惹かれてしまう。そして、HPゲージが一瞬で吹き飛んだ。
「え！？　ち、ちょっとみんな！？　なんでやられちゃったの！？」
「わ、私達の体重じゃ足りなかったみたい」
「はあ！？　んなわけないでしょうがあああああ！」
九人がまとめて轢かれてしまい、全員が一撃でやられてしまった。ただひとり残されたユウカの絶叫が響き渡る。間もなく、ヒマリによるリスタートが入り、一行は一度目の全滅を迎えた。
　二回目。今度はユウカが電車を跳ね返すまでは同じ。
　変わったのはその後の行動だ。
エイミのスキルが発動することはなく、ユウカの身体が光る。
「ち、ちょっと！？　なんで私、体操服着てるの！？」
ユウカにも、ドレスチェンジの機能が追加されていた。その姿は
「ま、眩しい太もも……美味しそう！」
「は、はあ！？　ち、ちょっと何言ってるの！？」
ユウカのクラスメイトの生徒は、お腹が空いていた。あらわになったユウカの太ももを見て、衝撃的な言葉を口にする。
直後、EXスキルが発動する。彼女のEXスキルは、ある一定地点に仲間を引き寄せることができる。それにより、電車の範囲外に飛ばされてしまった仲間を回避させることに成功した。
「す、すごい！　ユウカ、電車を躱せたよ！」
そうして、ゴズの攻撃をいなし続け、時にはユウカの体重（シールド）で電車を跳ね返す。しばらくして、ゴズのHPを半分削ると、こちらも第二段階へ移行する。
ゴズが指をパチンと鳴らすと、別の場所へ強制的に転移させられたのだ。
「ここ……サーカス場？」
　真っ先に浮かんだ印象を言葉にする。
「こ、攻撃が当たらない！」
「ユウカ！　こっちには当たるよ！」
　そして、目まぐるしく入れ替わる本物と偽物。地面に照らされた赤青黄色のグラスライトによる衝撃波、三つの並んだ箱がシャッフルされ、そのうちの一つからボクシンググローブがパンチを放ってくる特殊なギミックに翻弄される。結局、そのギミックを見抜くことが出来ず、第三部隊は二度目の全滅を迎えることとなった。


　コンソールルーム。
　ヒマリはマウスを忙しなく動かし、三つの戦況を操っていた。
「……なるほど。ドレスチェンジというのは要は一時的なパワーアップのようなものなのですね」
　まず、ヒナのドレスチェンジを使ってみた。すると、今度は彼女の姿が変わり、すべてのスキルも変化した。ドレスを纏ったヒナのスキルは、段階を追って強化する直線攻撃だ。
「そして、このコストというのは一定時間で回復するスキルを使うためのポイント、というわけですね」
　ヒマリは急激な速度でゲームに慣れていく。
すぐにこれみよがしに置かれた緑の壺の存在理由に気づき、回復スキルを持つ生徒のスキルを飛ばした。あの壺はHPを回復されると、敵にデバフを与える効果を持つのだ。ウルガータがHPをマックスにすることで爆発を不発に終わらせることができるのも見抜いた。もっとも、それは単に爆発に備え、できる限りHPを増やしておこうという用心深さが功を奏しただけだが。
「ふむ、HPを減らすと、敵が強化されるというギミックですか」
　第二段階。成すすべなくやられてしまった。申し訳ないと思いながらも、彼女の思考は第１段階をより早く突破する手段に割かれる。やがて、ヒマリは壺の回復によるデバフが一回きりで終わらないことを悟る。
同時に、ビナーに対する分析も行っていた。
　ビナーは防御デバフが非常に大事なボスだ。ゆえに、マキのEXスキルに合わせ、集中攻撃をする必要がある。そのために、コストを貯めるという小技も駆使した。
　続く第二段階。こちらはユズのEXスキルで突破できる。だが、それではモモイがやられてしまう。何度も彼女を真っ先に離脱させるのは
そして第三段階。こちらは、ビナーが最後の大技、“大道の劫火”を開幕で必ず撃ってくる。イオリのスキルで対処した。イオリのスキルは三連発の波状攻撃。単体に出せば、高い火力を出すこともできるが、その進化は殲滅力にある。ゆえに、ミサイルに撃ってみた。すると、ミサイルの数を大幅に減らすことができ、被弾も抑えられた。敵の技も多く、殲滅力の高さには手を焼いたが、その分こちらにもモモイやユズなど、強力なスキルを持つ生徒がいたおかげで、ビナーは最も簡単に攻略できた相手だった。
続いて、ゴズ。
　こちらはビナーと反対に最も攻略に時間のかかったボスだ。
　というのも、列車のタイミングに合わせてユウカのドレスチェンジで仲間を移動させなければならず、また第二段階では敵が三体に分身、本物を見分けねばならないという始末。だが、カードの色で見抜く術を見つけてから、比較的にスムーズに攻略はできた。とはいえ、こちらの第三部隊にはヒナやユズといった火力を持つ生徒もいない。エイミのEXスキルが最も火力のある攻撃だが、それも焼け石に水。敵の攻撃をいなしていき、地道に削っていくという立ち回りが求められた。そういう意味でも苦戦する相手だったのだ。そして、結局三体のボスを全部討伐することには成功したものの、残り時間は十秒という超ギリギリ。勝てはしたが、こんなにギリギリではヒマリとしては不満な結果だった。だが、周りの生徒は違う。彼女達は、ヒマリの激闘を見ているだけだった。しかし、刻一刻と減っていくタイマー、段階を増して強くなる敵に、手に汗握っていた。当事者以上にヒヤヒヤしていた。
「く、クリアしましたね！」
　後方で固唾を飲んで見守っていた生徒が歓声を上げ、喜びに打ち震えた。しかし、ヒマリは依然険しい顔をしたまま、モニターから目を離さない。
「ひ、ヒマリ部長？　どうしたのです？」
　ヒマリが喜ばないことを不自然に思い、生徒の一人が尋ねる。この時、ヒマリはその先を見ていた。
「このまま、ハレのいる場所の特定、及びセキュリティを掌握します」
　ハレ、余裕でいたつもりかもしれませんが、私をみすみすコンソールエリアにいれるとは、あまりに迂闊すぎましたね。
　ヒマリはほくそ笑んだ。実はボス攻略の途中、ヒマリは使っているPCに対し、ハッキングをしかけていた。とはいえ、ヒマリ自身が何かをしたわけではない。繋がっている本体に挿してあるUSB。そこにはヒマリ特性のハッキングツールをインストールしてある。もし、アンチプロトコルが使えず、システムを乗っ取り合うような勝負になった場合の秘密兵器として持ってきたのだ。
「も、もう次の手を打ってるんですか？」
「ええ、先手必勝はハッカーの基本です。後手に回った勝負に勝ちは訪れません」
「そ、そうなんですね。すごい……」
　たった一時間での三パーティ同時攻略。それをやり遂げたというのに、喜ぶこともなくハッキングに取り掛かる。あまりに人間離れした切替の早さに、周囲で見守っていた一般生徒たちは息を呑む。明星ヒマリの天才的な性質に畏怖する。
　それからしばらく、生徒たちはヒマリの作業を見届ける。彼女達は、ヒマリが何をしているのかまったくわかっていなかった。だが、目にも止まらぬタイピング速度、目まぐるしく数字や文字が入力される画面、普段からPCに触れる機会はあっても、これほど自在に操れたことはない。みな、圧倒的な手さばきに目も心も奪われていた。
「…………くっ」
　突然、一心不乱に手を動かしていたヒマリが手を止め、悔しそうに歯を食いしばった。
「な、何があったのですか？」
　後ろで見届けていた生徒の一人が尋ねた。ここは邪魔をするべきではない。わかっていても、好奇心を抑えられなかった。ミレニアムの天才は、今どんな状況に陥っているのか。彼女のしていることを知ってみたかった。
「ハレにアクセスをブロックされました。……どうやら、クリア後間髪入れずハッキングすることを読まれていたようですね」
　なんと、ヒマリの早すぎる打つ手に対し、カウンターを仕掛けたようだ。みな、理解する。小鈎ハレもまた天才なのだと。
「ふう。やはり、そううまくはいかないものですね」
　ヒマリはぐっと腕をあげて伸びをする。
「ヒマリさん、手を止めちゃうんですか？　ハッキングを仕返したりはしないんですか？」
「そうしたいのは山々なのですが、それは出来ません。そもそもここはハレの土俵なのです。一度主導権を握られてしまっては、仮想的にそれを奪い返すのは不可能です」
「は、はあ……」
　ヒマリの言葉の意味が理解できていない。わかるのは、ということだけだ。そして、少し残念に思う。もっと、この戦いを見ていたかったと。
「ヒマリ部長、画面になにか出てますよ！」
「ああ、本当ですね。これは……ハレからのメッセージでしょうか」
　──ゲームクリアおめでとう。でも、別にそんなことしなくても私のところに案内してあげるよ。さっきのオートマタが案内してくれるから、ついていってよ。
　モニターの中央にぴょこんと表示されたポップアップ。
　やはり、ハレだったらしい。こちらの思考を見透かしたような文面だ。
「……みなさん。ここまで、ついてきていただいてありがとうございます。ここから先は何が起こるかわかりません。拠点に戻っていただいても結構ですよ」
　後はハレに会い、ピボットくんを捕獲するだけだ。もし、アンチプロトコルを持っているなら、ハッキングの対策はしているが、この前のように大量のオートマタと激しい戦闘になる可能性もある。ヒマリの護衛に来てくれた生徒たちは、戦闘には全く向いていない。ここで帰ってもらうのが一番いいのだが。
「い、いえ！　ここまで来たからには最後まで同行させてください！」
「ですが、ここから先は激しい銃撃戦になるかもしれません。ここで戻ったほうが懸命だと思いますが」
「そ、それでも！　ここまで来たからにはこの作戦を最後まで見届けたいんです！　……で、でも。私達が足手まといだというのなら、従いますが……」
「……いえ、足手まといなんてことはありませんよ。」
　ヒマリはふっと無意識にこわばっていた表情を和らげると、大きく首を振った。彼女達のやる気を買ってあげたかった。
その後、壁際で控えていたオートマタに案内されるまま、艦内を進んでいく。
　部屋を出て、上層へと案内してくれる。予想はしていたが、ハレのいるコンソールルームは最上層にあるのだろう。
　道中、セキュリティでロックされた壁をいくつも超え、最上層へと到着する。最上層は一本の通路のようになっていた。奥に巨大な扉が待ち構えている。その手前に人だかりが出来ていた。
「──あっ！　ヒマリ部長！　やっと来た！」
　扉の前にいたのは、先に突入させた遊撃隊のメンバーだった。
　マキが駆け寄ってくる。
「おまたせしました。マキ」
「ねえねえ、さっきのゲームであたし達を操作してたのって、ヒマリ部長だったの？」
「ええ。長引かせてしまって申し訳ありませんが」
「やっぱりー！　全然すごかったよ！　でも、ヒマリ部長って、ゲームとかやらないイメージなのに」
「ふふふ。あれくらいこの私にかかれば造作もないことです」　
「……なるほど、スキルを使っていたのはやっぱりヒマリさんだったのね。ありがとう、助かったわ」
　その会話をそばで聞いていたヒナが納得したように口を開く。
「いえ、私のできることをしただけですので。むしろ、拙い操作で皆さんにご負担をおかけしてすみません。特に第一部隊の方々は、精神に深刻なダメージを受けていたようですし」
「あ、あはは……お恥ずかしいところをお見せしてしまってすみません」
　第一部隊の風紀委員達がメンタルをやられていたのは気づいていた。
　ビーとブザー音が鳴る。扉が開いた。奥のコンソールルームの全貌が明らかにになる。そして、中央に置かれたたくさんの管が伸びる箱のようなベッド。そこにはピボットくんが寝かされているが、ヒマリたちの位置からはちょうど見ることができない。
「やあ、よく来たね、みんな」
　扉の前にはハレが立っていて、出迎えてくれた。
　相も変わらず黒いロングコートを羽織っている。その目とヘイローは赤く輝き、異様な雰囲気を漂わせている。
「は、ハレ先輩！　どうしたのその目とヘイロー！　それに、服が黒い……」
「これはまあ、色々あって。それより、マキ、それにみんなも。よかった、目が覚めたんだね」
「うへへ、ありがとう。ねえ、それよりさっきのゲームって、ハレ先輩が作ったの？」
「うん。結構、面白かったでしょ」
「まあねー。でも、次からは自分でも動けるようにしてほしいな！　もっと自由度がある方がゲームとして面白いと思う！」
「ふふ。わかった、次はそうするよ」
マキとハレがゆるい雰囲気の会話を広げる。唖然として聞いていた。
「ちょっとハレ！　あんた、この前は良くも──きゃっ！？」
「ユウカ。言い忘れてたけど、そこにもガラスの壁があるから、通り抜けるのは無理だよ」
「そ、そういうことは最初に言っておきなさいよ！」
　ユウカが額を擦りながら、ハレに向けて怒りの声を飛ばす。遅れて、ヒマリが手を添えた。確かにそこには透明な壁があり、入ることはできない。
「ハレ、これはどういうことです？　コンソールルームのロックは解除するのではありませんでしたか？」
「うん。ロックは解除して、扉も開けたよ。でも、ここから先に入れるとは言ってない」
「……なるほど。ずいぶん小賢しい言葉遊びをするようになりましたね、ハレ」
「本当はこういうやり方はあんまり好きじゃないんだけどね。今回は仕方なくっていうやつだよ」
　本当に不本意だったんだろう。ハレは困ったように眉尻を下げていった。
「……なんか、ハレ先輩雰囲気変わった？」
「うん、服もいつも見るのと全然違うし、あの目とかもカラコンなのかな？」
「あ、いや、そういうわけじゃなくて、なんか喋り方とか佇まいとか」
　モモイの返事を否定すると、マキは釈然としない表情で首をかしげた。
「それにしても、ヒマリ先輩。よくあのゲームをクリアしたね。結構、難しめに作ってたから、もっと時間がかかると思っていたけど
「あの程度、私にかかればお茶の子さいさいです。それに、一時間という制限時間を設けたのはあなたではありませんか」
「ああ、あれか。ちなみに種明かしをしておくとね、あの右上のタイマーに特別な意味はなくて、ゼロになったら一旦プレイヤーがゲームからログアウトするだけだったんだよ。あれは脳の電気信号をジャックして、意識を仮想空間に落とし込む技術を使っているんだけど、現実に戻ってこれなかったら大変だもんね」
「だったら、次からはそう表記しておいてください。あれでは、ユーザーは１時間後にゲームオーバーになると解釈してしまいます」
「うん。それも次は気をつけるよ」
　ハレは空気を切り替えるように、数秒目を瞑った。
「それで、ヒマリ先輩たちはどうしてこんなところまで来たのかな」
「決まっているでしょう。あなたを連れ戻し、ピボットくんを拘束するためです」
「私を連れ戻してどうするの？　まさか、本当に言葉通りの意味でお灸を据えるってわけじゃないよね」
「いえ、そのままの意味ですよ。あなたがどうしてこんなことをしたのか、その理由次第ではありますが」
「……じゃあ、ピボットくんを捕まえたらどうするの？」
「それも決まっています。アンチプロトコルを封印します」
「それも、言葉遊びだね。本当はピボットくんを破壊するつもりなんでしょ。二度と、アンチプロトコルによる被害が起こらないように」
　ええ！？　っと、驚く声が聞こえる。それはマキ達ピボットくんを知るメンバーのものだった。
「ひ、ヒマリ部長！　嘘でしょ？　ピボットくんを破壊しちゃうって……捕まえはするけど、その後アンチプロトコルをなんとかするんじゃなかったの！？」
「ピボットくんは私達ヴェリタスの大切なメンバーです。彼を破壊するなんて、私は反対です」
　マキとコタマが抗議の声を上げる。モモイたちも声こそ上げなかったが、同じように反対している意思を瞳に宿している。
「……あなた達がピボットくんを慕っていたのは知っています。ですが、それとこれとは別の話なのです」
　反対意見を、ヒマリはバッサリと断ち切った。それから、鋭い目つきでハレの方に向き直る。
「で、それをこの場で暴露して、私の立場を危うくすることが狙いですか？　ならば無駄です。アンチプロトコルが強大な脅威であることに代わりはありません。それに対し対処を試みようとしていることに反感を抱かれる謂れはありません。それに、彼を破壊することは、まだ正気を保っていた頃に彼自身から頼まれたことなのです。私はあのときの彼の言葉を信じます」
「別に、そんなつもりはないよ。私は事実を口にしただけだし、部長の意見も正しいと思う。ピボットくんが自分を破壊するよう頼んだもの、本当の話だしね」
　ハレは心底どうでもいいといった様子で方をすくめた。本当にどうでもよかった。どうせ、そんなことにはならないとわかっているから。
「では、今度はこちらの質問に答えてもらいましょう。ハレ、あなたの目的はなんですか。どうして、このような場所に引きこもり、ピボットくんを匿っているのです？」
「……目的はある意味ヒマリ部長と一緒だよ。私はただ、脅威を無くしたかったんだ。つまり、アンチプロトコルの力をピボットくんから消そうと頑張ってたんだ」
「それなら、一緒に協力すればいいんじゃないの？　どうして、わざわざ一人でやってるのよ！」
「それは出来ないよ。だって、ヒマリ部長はもう結論を出してる。アンチプロトコルを封じる方法は、ピボットくんの破壊以外だけだと。そして、その結論を曲げるつもりがない」
　ヒマリは無言で頷いた。もう、ここに来て嘘も方便も重ねるつもりはない。
「……確かに私は意見を曲げるつもりがありません。ですが、理由は本当にそれだけですか？」
　まだ、　何か隠している理由がある。そして、それをヒマリは察していながら、あえて問いかけた。
　ハレは一瞬、答えるのを渋ったように息を吸う。
「ご明察。もちろん、あるよ。ヒマリ部長の意見を曲げるのは骨が折れそうっていうのもあるけど……困ったことにヒマリ部長のやり方って、唯一の正解なんだよね」
「……そうですか。やはり、そうだったのですね」
　ヒマリはまつげを伏せた。帰ってきた返答は予想通りだったからだ。
「ピボットくんのアンチプロトコルは、決して本体と切り離すことが出来ない。それが、長い研究の果てに私が出した結論だよ」
「じ、じゃあ……」
「そう。アンチプロトコルを封じるには、器であるピボットくんを破壊するしかない。放置すれば、キヴォトスを滅ぼせるほどの暴走が起こる。ピボットくんとキヴォトス、どっちを犠牲にする？　まるでトロッコ問題みたいだよね」
　だれも、答えることは出来なかった。だが、全員の意思は統一している。後者を選ぶしかないと。
「だけど、ヒマリ部長のやり方も、本当の意味で正しいとは言えない。…………だから、私は完全な方法で、ピボットくんを破壊することにしたんだ」
「完全な方法？　それはいったい？」
　ヒマリはその計画を明かしていない。だが、絶縁体で造った密室を用意し、さらに今回用いた絶縁体シートで厳重に拘束したうえで、ヘイローを破壊するつもりだった。そして、アスハレ作戦を準備する傍ら、そちらの準備も進めてある。その計画は誰にもバレないよう、エイミにさえ知らせることなく進めてきた。ゆえに、ハレがその計画さえも見抜いているわけではないと思うが、これまで散々手球に取られてきた経験でドキリとさせられる。
「ねえ、ヒマリ部長。みんな、この地下にどうしてこんな戦艦が眠っていたと思う？」
　ハレはヒマリの質問には答えず、逆に質問を重ねた。
「初めてこれを見た時、思わなかった？　まるで、宇宙船のようだって」


「これは宇宙船なんだ。これでピボットくんを空まで飛ばす。それが私が


ココカラファイン


「


「大昔、アンチプロトコルに研究してる機関があったんだ。この方舟は、もしアンチプロトコルが手に負えなくてキヴォトスを覆い尽くした時、これで宇宙まで逃げるために作ったんだって」

「まあ、結局これを使うつもりはなかったみたいなんだけど……そして、宇宙でもし何かがあったときのために、緊急脱出するための小型宇宙船も用意してた。……当時働いていた人たちを残したままね。ひどい話だよね」


「アンチプロトコルの被害を最小限にするため、宇宙空間でピボットくんを破壊するのが一番良いというのはわかりました。ですが、それにあなたが同行する理由がわかりません」
「それはピボットくんに感情を与えたのは私だからだよ」
「え？」
「ごめんね、ヒマリ部長。みんな。ピボットくんの感情とアンチプロトコルを紐づけたのは私のミス。私が起こしたエラーなんだ」
「みんなを苦しませた。そして、ピボットくんを苦しませた。だから、私はその罪を償わなくちゃいけない」
「…………ハレ、あなたはまさか、死ぬ気なのですか？」
「全然、そんなつもりはないよ。ちゃんと、ピボットくんの身体を破壊した後、宇宙船が戻ってこれるようにプログラムしてあるしね。まあ、実験はしてないから一か八かだけど」
「ハレ？　脱出装置はちゃんとあるって言ってなかった？」
「……先生。ごめんね。脱出装置があるっていう話、あれ嘘だったんだ。
　ハレは申し訳無さそうに謝った。必然、先生を含めた全員の顔がこわばる。先生が死ぬ、それもまたキヴォトスが終わることを示すからだ。だが、先生という存在の重要性は、ハレも重々承知していた。
「大丈夫、安心して。私のわがままに先生まで巻き込むつもりはないよ。裏口が開けてあるから、そこから逃げて。宇宙に行くのは、私一人でいい」
　だが、先生は険しい顔で首を振った。
「いや、私も付き合うよ。ハレを一人にするわけにはいかないから」
「先生……だめだよ。先生はみんなの先生なんだから。私だけのために、こんな危険を冒しちゃダメだよ」
「それでも、ハレのやりたいことを見届けるって、決めたから」
「……頑固だね、先生。本当に死んじゃうかもしれないんだよ？」
「……それでも、ハレをひとりぼっちにさせるよりはマシだよ」
「先生……頑固だね」
　先生は笑う。それはヒマリと同じように、考えを変えるつもりがないと悟る。
「というわけだから。私と先生はピボットくんの破壊に付き添うよ。だから、またね」



「ダメ！　ハレ！　死んじゃうなんて嫌だ！　やめてよおおおおお！！！！！」
　どんどんと、ユウカが透明な壁をたたきながら、力なく膝をつく。壁越しに見える拳が赤くなっている。
「ハレ。どうして、あなたまで一緒に行く必要があるのですか。それに、絶縁体で厳重に梱包するというやり方ではダメなのですか！？」
「それはダメだよ。高濃度のアンチプロトコルには絶縁体さえも意味をなさないんだ」
「ですが、
「それに、どっちにしろピボットくんを破壊することに代わりはないなら。……私は、この子を作った責任を取らなくちゃいけない。
「死ぬことで責任を取れると思っているのですか？　ピボットくんは望むような性格ではないでしょう。彼の想いを背負って生きるのも責任です」
「そうだね。だから、私だって死ぬつもりなんてない。……限りなく低い確率だけどね」
「それはみすみす死にに行ってることだと……なぜわからないのですか！！！」
　ヒマリが激昂する。
「……ハレ。私はあなたを失うことが耐えられないのです。お願いです。考えを改め、ヴェリタスに戻ってきてくれませんか？」
「……ごめんね。もう、決めたことだから」
「ハレ先輩！」
「ハレ！」
　全員が壁に張り付き、呼びかける。だが、ハレは決してそこに近寄ろうとしない。
「ヒマリ部長、マキ、コタマ先輩。ユウカ、それにみんな。大丈夫だよ。私がいなくても──きっと明日も晴れるから」
　ハレはニコリと微笑んだ。彼女が滅多に見せない表情。ヘイローが覚醒した後は、
　扉が閉まる。それから、戦艦が揺れる。
　残されたのはユウカの嗚咽と、叫ぶマキやモモイたちの声。
「っ！　まだです！　諦めてなるものですか！」
　ヒマリはうつむけていた顔を上げると、必死の形相で声を張り上げた。
「先程のコンソールルームに戻ります。ハレは最後の最後で過ちを犯しました。この戦艦が宇宙に行くことができるというなら、コンソールルームにあれを残すべきではありません」
「もしかして！」
「ええ。スーパーコンピュータ・ゼロを使い、この戦艦のシステムを掌握します！！！」
　ヒマリは熱く拳を握った。
「ヒナさん？　何を……」
「案内して。車椅子で行くより、こっちのほうが早い」
「ありがとうございます！」

「部長、車椅子は私がもってくよ」
エイミが車椅子を両手に抱える。



ココカラファイン

宇宙に登っていく。
　扉が閉まった後、

「先生は……本当に

「ねえ、ハレ。どうしてあんなふうに、

「もしかして、みんなにお別れが告げたかったのかな」
「そうだよ。戻れないから、最後にみんなと話したかったんだ。……自分でもワガママだと思うけど、やっぱり寂しかったんだね」
「それはワガママじゃなくて、当然の感情だよ。でも、やり方はあまり良くなかったね」
「それはわかってるけど……

「ピボットくんを造った理由だよ。前世の私も寂しかったんだって」

「……さあ、もう爆発するよ。吸い込んできた分のアンチプロトコルが一気に放出される」
「先生、ごめんね。

「ハレ」

「こういうときはごめんじゃなくて、ありがとうって言うんだよ」
「……そうだね。わかったよ、覚えておく」
ピボットくんの身体が輝き出す。
──ありがとう。先生。
　そういって、ハレは
「…………あ、あれ？」
　ボタンを押す。しかし、中央に寝かされたピボットくんの身体は、うんともすんとも言わない。
「……そのボタンを押しても、ワタシの中のアンチプロトコルは暴走しませんよ」
「え？　ぴ、ピボットくん……どうして、目を覚まして？」

「転送装置はあります。
　ピボットくんは先生の身体を指さした。
「シッテムの箱と大人のカード。いざとなったら、それを使ってハレさんだけでも返すつもりだったんでしょう？」



「ハレさんの想い、伝わっていました。……こんなワタシのために、そこまで親身になってくれてありがとうございます」

「だ、ダメだよピボットくん！　それじゃ、君が一人ぼっちになっちゃう！」
「……ハレさん。ありがとうございます。でも、ここで消えるのはワタシだけでいい。あなたには未来がある。その過ぎた力も、あなたが成長すれば、自ずと手に入れられたはずの力なのです。だから、あなたはここで死んではいけません。──少しだけ、眠っていてください」
「ハレに何をしたの？」
「心配はいりません。アンチプロトコルを使い、ハレさんの身体をハッキングしました」
「

「それと、ハレさんの身体のロールバックを行いました。……ヘイローが覚醒する前に」

「目覚めたら、もう私のことを覚えてはいないでしょう。そして、彼女がヘイローを覚醒させてから知ったすべての真理も。それと、地上に残っているワタシを知るすべての人から、ワタシの記憶を消します」
「……そんなこと、できるの？　みんな、アンチプロトコルには対策してる。絶縁体のシートを身体に貼りつけているんだ」
「それなら大丈夫です。ハレさんも言っていたように高濃度のアンチプロトコルは絶縁体さえも貫通します」
「……そっか。でも、いいの？　そんなことをしたら、ピボットくんはひとりぼっちになっちゃう」
「それも大丈夫です。先生の記憶だけは、残すつもりですから」

「しかし、ハレさんは違う。ハレさんは前世の記憶も含め、ワタシと密接に関わりすぎた。そのため、記憶を失う喪失感で、心が不安定になる可能性があります。だから、先生」
「なにかな」
「──ハレさんのことを、お任せします」
「わかった」
「ありがとうございます」
　最後にピボットくんは笑顔を浮かべる。
　そして、彼の身体は白い光に包まれる。
　その眩しさに目を瞑る。次に目を開けた瞬間、先生は空を落ちていた。手の中に眠る少女は、黄色のヘイローを浮かべ、安らかに寝息を立てている。けれど、その瞳には涙が溢れては、空中へこぼれ落ちている。




エピローグ：ESCAPE　PROCESSING


「ぴ、ピボットくん？」


「……そんな。システムがシャットダウンされてる」

「く。ハレ……あなたはどこまで！」
　それでも、ヒマリは諦めなかった。彼女が死んでしまう前に。救いに



「……
『そうだね。さすがだよヒマリ部長、まさかあれをクリアするとはね』





「やあ、もしもしヒマリ部長？」




ヒナと戦うのはヒエロニムス。
この後、ビナーと交戦となったモモイたちを助けるため、ユウカも突入。だが、モモイ達の言葉により、他に回る。ユウカVS白アンド黒



　元々悪評高いヴェリタスだが、こんな形で酷評されるのはヒマリも望むことではない。だが、彼女が元々ヴェリタスの部長であることは秘密だ。



「…………これはね、昔アンチプロトコルについて

「私がいるとのはいざとなった時の脱出ポッド。でも、収容人数はせいぜい数人。一部の権力ある人しか助けるつもりがないみたい。酷い話だよね」



入り口の迎撃システムが発動したのだろう。しばらくして、絨毯飛び交いぶつかり合う交戦音がする。
「第二陣、突入です」
　そのタイミングでヒマリは後続の舞台を出撃させた。こうすることで、迎撃システムのオートマタを挟み撃ちできるという戦法だ。

「

　

「
　



↓カットでファイン？
　翌日、午後。講堂にて。
「というわけで、アンチプロトコルの発生にはこのピボットくんというロボットが密接に関わっています。彼はヴェリタスの部員であるオマガリハレを攫い、旧キヴォトス第三天文台の地下に立てこもっています」


「……先日、我々は少数精鋭のチームを組み、そこへ向かいました。ハレの指揮する大量のオートマタによる迎撃に遭ってしまい、やむを得ず撤退しました」


「……もちろん、答えはすぐに求めはしません。ですが、あまり時間をかけることもできない。明日、改めて参加の可否は問います。リスクは伴いますが、それでも私の

ヒマリは壇上を降りる。
↑



「ところでエイミ。先生の行方はまだ分からないままですか？」

「うん。連絡も取れないし、　昨日までは普通にいたんだけど……」

「そうですが…………アスハレ作戦


（　ハレはハレで、彼女なりの信念があってアンチプロトコルをどうにかしようとしてる。彼女もまた、自分の信じた道を進んでいるのだろう。
　私はどっちの味方に付けばいいんだろうか。先生の心は、不断な優柔に弄ばれていた。
　今までも、生徒同士の対立が起きることはあった。だが、それは必ずどちらかが、あるいはどちらも道を踏み外していた。だが、今回は違う。どちらにも等しく信条と正義が会って、間違っているとは言えない状況。まるで、一対一のトロッコ問題を押し付けられている感覚だ。
「私は……どうすればいいのかな」）ケシテネファイン


（この後、ハレの元へいく先生。アンチプロトコルの保護パーツなし。焦るヒマリ達。アスハレ作戦結構。ユウカはハレと話がしたい。ユズは、一緒にゲームをした仲だから。参戦）



「それは恐らく無理です。ハレも、

「……天才同士というのは、気が合わないことがほとんどですから」





「ひとまず、今回も収穫はありました。アンチプロトコルの影響は受けなかった。つまり、絶縁体による保護は有効ということ。今からこれを大量生産し、人を集め、キヴォトス第三天文台に襲撃をかけます。そして、ピボットくんを拘束し、破壊する。それと並行してハレを連れ戻します。以上が今後の計画です。」
「それで十分です」







「…………それがもう、私にはわからないんです。ピボットくんについて研究している時、私は彼の感情とアンチプロトコルの暴走がリンクしていることに気づきました。ですが、解除する方法は見つけられなかった。そもそも、どのようなプログラムで動いているのかさえ理解できなかった。この私がです」
　いつも自身に満ち溢れているヒマリにしては珍しく、それを喪ったような顔つきだ。




「それでいいよ。じゃあ、一つ目。さっき、ヒマリがヘイローが覚醒してるって言ってたけど、あれってどういう意味？」
「あー。覚醒ね。それくらいならヒマリ先輩も教えてくれると思うけど……そのまんまだよ。でも、かつて覚醒について研究してた組織が遺した資料には、こう書いてあるね。覚醒は神聖を帯びる者の証に秘められし力を限界を超えて引き起こす。覚醒は己の限界に極限まで近づいた時に起こる。覚醒は神秘を持つもの全てに平等に訪れる機会がある。覚醒した者は神秘が廻転し、ふさわしき色に染まる。……ここに書かれてる神秘っていうのはヘイローのことかな。まぁ、要するにパワーアップだね」
スマホを読み上げるハレ。組織の資料って、スマホで検索して出るものなのだろうか。
「ハレもパワーアップしてるの？」
「してるよ。身体能力も多少上がったし、特に情報処理能力の大幅に向上してるよ。おかげでアンチプロトコルも使いこなせるし、その先のハッキングまでお手のもの。しかも、前に比べて全然疲れなくなったんだ。良いことづくしだね」
「あれ？　アンチプロトコルって、ハッキングも出来るんじゃないの？」
「いや、アンチプロトコルはあくまでハッキングの糸口を作るだけだよ。それ自体にハッキング能力はないから、こんなふうに自分でコードを打ったり、アクセスしないとダメなんだ」
　ハレは被りを振ると、スマホを見せてくれた。覗き込んでみるけど、当然見ても分からない。というか、何が書いてあるかもわからなかった。
「これ……何語？」
「英語だよ。まあ、ちょっとデコレーションして、私以外にはわからないようにしてるけどね」
「これ、ちょっとなんだ……」
　スマホの画面にびっしりと書かれたソースコード。その一文字一文字がぐちゃぐちゃと書かれた落書きのようで、まるで理解できない。というか、人に理解できるものじゃない。これを自在に操れるのも、ヘイローが覚醒した影響なのだろうか。


「あれ？　ちょっと待って。アンチプロトコルにハッキング能力がないから、ピボットくんはどうなの？」
初めて会った時も、シャーレのサーバーをハッキングしたと言っていた。あの時もこんなふうに何かコードを書いていたんだろうか。
「ピボットくんは……存在そのものが超高性能なコンピュータみたいなものだからね。私たちとは前提が違うんだよ」
「そっか。そういうことか……」

「ところで、ピボットくんはどこにいるの？」
　ピボットくんは姿を現していない。
「……ピボットくんなら、コンソールルームで眠ってるよ」




それに、さっきも最初の攻撃で帰ってくれれば良かったと言った。もし、彼女が本気で変わってしまっているなら、あそこで始末できれば
「……先生が


「あ。先生、最後に聞いてもいいかな」
「何？」
「私にみんなを傷つけるつもりはないってわかってたんでしょ？　だったら、どうしてそれを使おうとしたの？」
「……傷つけるつもりはないのはわかってたよ。でも、オートマタに攻撃させようとしてたのは本気だったでしょ？　みんなに万が一のことがあっちゃいけないと思ったんだ。……私は先生だから」
「そっか」

「やっぱり先生は先生だね、安心したよ。……それじゃ、ばいばい」
　ハレは教室を出て行った。
「……ここは」
　次の瞬間、先生はオートマタに囲まれたあの瞬間へと
「先生、どうしたんですか？」
「あれ、今、どんな状況？」
「どうもこうも、ハレがあのオートマタに私達を攻撃させようとしたところです。……なぜか、攻撃はされませんでしたが」
　



後ろの方が敵の数が明らかに多い。しかも、敵の湧くペースも段違いだ。これは前に行くしかないんだろうか。

　

「……先生、このまま進みましょう」






「


「それから、先生は待機していてください」

に先生はヘイローを持っていませんから。もしアンチプロトコルに侵された場合、最も被害を受けるからです」

「まって、ヒマリ。私にはシッテムの箱があるよ？」
「バリアですか？　しかし、シッテムの箱と電子機器であることに変わりはないでしょう。万が一、ということはあり得る話です」
先生は息を呑んだ。ひょっとして、ヒマリは気づいているのだろうか。すでに一度、シッテムの箱が破られていることに。
『な、先生！　みくびらないでください！　私たちはアンチプロトコルなんかには負けてませんよ！』
　ふと、脳内に

「ヒマリ。ヒマリの言いたいことはわかったよ。でも、　それに、私がいれば、みんなの指揮を取ることもできるよ」

「……ヒマリ部長。先生の指揮は私たちのポテンシャルを最大に引き出してくれる。いてもらった方がいいと思うわよ」


「確かに危険だけど……でも、先生ならなんとかしてくれるんじゃないかしら？　方舟の時だってそうだったでしょう？」
苦い記憶が蘇る。あの時、宇宙空間で果てるはずだった先生をアロナとプラナが救ってくれたのだ。だが、その反動で服は燃え尽き、みんなのまえではぁかをさらすことになってしまった。あの後しばらく、シャーレの先生は露出狂なんてレッテルを貼られる羽目になったのだ。
「……ヒマリさん。私もユウカさんに賛成。確かに先生の指揮能力は他に類を見ないものだし、いてくれた方がいいと思う。それに、今度こそは何があっても、私が先生を守るから」
　ユウカに続き、ヒナまでもが援護射撃をしてくれる。
「……わかりました。ですが、先生は


そのためにはピボットくんの居場所の特定から、

（ピボットくんの居場所の特定は、先生がハレと言った展望台のことを思い出して、見つける。ハッキングを試みて、弾かれることで把握。ただ、大量のロボットが出てくることで撤退をやむなし。その後、大規模な明日晴れ作戦へ。そして、ブラックハレの登場）




「わ、私も



「今回、


一部のメンバーが集められた。




これからのあらすじ

アンチプロトコル。それはキヴォトスの外から送り込まれたエネルギー。それは滅ぼすものだった。しかし、それらはヘイローを覚醒させたヒマリ達が一つのコアに封印。事なきを得たかと思ったが、不十分だった。やがて、何度目かのループでハレが真理を解き明かす。その世界線のハレはミレニアムの財貨を強奪し、スーパーコンピュータゼロを購入。ハレはアンチプロトコル襲来と共にヘイローを覚醒させ、その卓越した能力により、シッテムの箱のハッキング（先生も味方した）に成功する。そして、全てを知ってしまったのだ。全てを知った彼女は、ヒマリたちに事実を告げ、アンチプロトコルをコアに入れた後、その制御プログラムと僅かな対抗薬を作り出す。高濃度のアンチプロトコルを浴び、変質した絶縁体を圧縮し、液体に還元したもの。それはヘイローに直接作用する（ハレの耐性の正体）（なお、先生が生きていたのはシッテムの箱の防御シールドのおかげ）なお、ヒマリはハレのけつえきにわずかに含まれたそれから、製法まで逆算、大量生産に成功し、格の違いを見せつける。流石だよ、ヒマリ部長。ただ、覚醒したヘイローを持つハレには勝てない。
前世のハレが開発したのは、アンチプロトコルを格納し、それを段階に分けて放出することで事なきを得る装置。今の世はだめでも、それをシッテ無の箱の昨日で来世に送ることで、来世につなげようとしていた。（真理を知っている
しかし、致命的なバグがあった。それはアンチプロトコル放出のシミュレーションが何度やっても不安定なこと。（100％のシミュレーションは来世に送るプログラムと、RAPを放出するプログラム）ピボットくんに感情が生じてしまったこと。バグ。ハレの意識が投影されてしまったから。ちなみにアンチプロトコルは揮発性であるため、一度放出されたらしばらくは大丈夫。何回かに分けて出されることで、影響は最小限になるはずだった。感情と紐づいてしまったのはバグ。放出の紐がゆるくなったのも同じ。　なお、その分のアンチプロトコルは前世の分。これから来るアンチプロトコルに対抗しなければならないが、前世の記憶があるため大丈夫。今のハレが行っていたのはアンチプロトコル放出システムと感情の紐づけを解除すること。それをするにはどうしても、ピボットくんの感情を消さなければならない結論に。何度、何度やってもだめ。
前世のハレは、高濃度アンチプロトコル放出プログラム、及び追体験する記憶装置を淹れていた。それをハレの脳内に流し、強制的に覚醒させる。電気装置のようなもの？

なお、ヒマリはピボットくんに対し、今度こそヘイローを破壊する意思を固める。リオも一応は頷く。ユウカたちも。先生は仕方ない。
　そして、ハレ救出作戦に。ただ、まさかのハレに拒否される。先生だけが入れる。その後、ハレVSヒマリ。
ヒマリはハレに対しての情を捨て、指示に従わない場合ハレのヘイローごと破壊すると。ヒマリの有無を言わせぬ迫力だった。また、みんな従ってしまう（皆、意識のあるまま倒れるあの苦しみを経験していたため）ハレはヒマリに教える。（この時、宇宙船のハッチの上。なお、。この地下にある宇宙船はかつて神秘について研究していたゲマトリアという集団が残していたもの。パスコードはゲマトリアの生体認証だが、当たり前のようにハッキングして、我が物にした）

アンチプロトコルの真実。しかし、感情を切り離すことが出来ないから、だめ。

また、ピボットくんは何度も同じ未来を繰り返してきた。そのたびに絶望し、泣きわめいた。それをハレは知ってしまったから肩入れしてる。

最終的には、ハレはピボットくんと心中する未来を選択。ピボットくんの感情を切除。キヴォトスの外、すなわち宇宙空間に飛び、そこでアンチプロトコルを吸収させ、段階的に放出。自身は宇宙空間でそのまま死亡（なお、先生も同席）ただ、ピボットくんが予想外の反撃。実は作業中、こっそり逆ハッキングをしかけてた。感情の一部を外に残し、自分の力で放つ。そして、アンチプロトコルを操作し、ハレのヘイローをハッキング、覚醒を収めさせ、また余った力はキヴォトスの全人類に与える。その後、宇宙船でハレ達を返し、それが最後で、後は制御不可。だから感情を切り離し、アンチプロトコルを定期的に放出。
　その後は予定していたエンディングに。


また、覚醒したハレは黒いコートに赤いヘイロー。「……汚れるかもしれないから新調したんだ。たまにはこういうのも悪くないでしょ」



あとがき

・さきがきで述べた致命的な矛盾について。
　ピボットくんの暗号で、キヴォトスで最も多くの情報を持つサーバーをハレが知っていた件について。本篇において、ハレ（キャンプ）の絆ストーリー参照後のモモトークで、その差出人が副部長であることが明かされている。
気づいた方はおめでとうございます。その差出人が副部長じゃないと`;//テンプレリテラルはバッククオートじゃなきゃダメ！　”　’じゃエラー！　SHIT+＠で｀は撃てるよ！
console.log(tet);
document.querySelector("noveltext").textContent = tet;
